{"url":"https://www.moneycontrol.com/news/india/nipuna-karnataka-state-to-partner-with-tech-companies-to-train-youth-in-emerging-technology-12818018.html","title":"Nipuna Karnataka: State to partner with tech companies to train youth in emerging technology","description":"The IT-BT department has identified a range of highly sought-after courses through outreach with industry partners. Corporate Social Responsibility (CSR) funds from IT companies will be utilised to support training programmes and infrastructure development.Karnataka IT-BT minister Priyank KhargeRelated stories","content":"The Karnataka government has decided to partner with IT companies to provide training in emerging and advanced technologies to the youth. The state government on September 9 launched the 'Nipuna Karnataka - Skill Local/Go Global' programme, designed to equip recent graduates from both urban and rural areas with advanced industry-relevant skills in emerging technologies. Launched by the Department of IT, BT, and electronics in collaboration with IT giants such as Infosys, Wipro, and TCS, the programme will offer training in fields including artificial intelligence, blockchain technology, data analysis and processing, and cloud security services. Training is expected to begin later this year. “The programme has an initial budget of Rs 300 crore. Funding will be sourced through various models and schemes, including Corporate Social Responsibility (CSR) initiatives from partner companies. The implementation will be phased, starting with identifying skill gaps, designing the curriculum, and collaborating with industry experts,” said Karnataka IT-BT Minister Priyank Kharge. In the second phase, the programme will introduce role-based training at select locations, including government and private centres. This phase will also involve setting up necessary facilities like computer centres and libraries, as well as collaborating with product companies for on-the-job training and placements. Kharge said, “The Department of Electronics, IT, and BT has identified a range of highly sought-after courses through extensive outreach with industry partners. These courses are designed to keep pace with technological advancements, ensuring Karnataka's youth are equipped with cutting-edge IT skills.” Also, read: After backlash, Karnataka puts job quota-for-locals bill on hold He added that the public-private partnerships initiative would leverage collaborations with top IT companies for curriculum development, training delivery, internships, and placements. CSR funds will support the training programmes and infrastructure development. The programme will offer flexible training models, including a 50-50 partnership between the government and companies, along with other CSR contribution models. “The initiative covers every aspect of skill development—from designing industry-aligned curricula and establishing state-of-the-art training centers across urban and rural Karnataka to offering certifications recognized by leading IT companies and facilitating placements through continuous industry engagement,” Kharge said. Also, read: Karnataka govt will provide industry-ready skills for locals, no need for businesses to panic: IT minister Priyank Kharge A robust monitoring system will be implemented to track the progress of training programmes and placement rates, with a feedback mechanism to ensure continuous improvement. The initiative aims to scale up by establishing more training centres and expanding partnerships with additional IT companies and sectors. “Recognising Karnataka's unique position as a hub for IT and emerging technologies, the government has outlined a comprehensive strategy to bridge the skill gap between fresh graduates, including engineers and STEM professionals, and industry requirements. With the rapid evolution of technology, it is crucial to provide the right skills to prepare Karnataka’s youth for the industry,” Kharge added. Also, read: Karnataka's 100 engineering colleges to be linked with 100 tech companies to make students industry-ready: Priyank Kharge ","cleaned_content":"the karnataka government has decided to partner with it companies to provide training in emerging and advanced technologies to the youth the state government on september \u003cNINE_\u003e launched the nipuna karnataka skill local go global programme designed to equip recent graduates from both urban and rural areas with advanced industry relevant skills in emerging technologies launched by the department of it bt and electronics in collaboration with it giants such as infosys wipro and tcs the programme will offer training in fields including artificial intelligence blockchain technology data analysis and processing and cloud security services training is expected to begin later this year the programme has an initial budget of rs \u003cTHREE_HUNDRED\u003e crore funding will be sourced through various models and schemes including corporate social responsibility csr initiatives from partner companies the implementation will be phased starting with identifying skill gaps designing the curriculum and collaborating with industry experts said karnataka it bt minister priyank kharge in the second phase the programme will introduce role based training at select locations including government and private centres this phase will also involve setting up necessary facilities like computer centres and libraries as well as collaborating with product companies for on the job training and placements kharge said the department of electronics it and bt has identified a range of highly sought after courses through extensive outreach with industry partners these courses are designed to keep pace with technological advancements ensuring karnatakas youth are equipped with cutting edge it skills also read after backlash karnataka puts job quota for locals bill on hold he added that the public private partnerships initiative would leverage collaborations with top it companies for curriculum development training delivery internships and placements csr funds will support the training programmes and infrastructure development the programme will offer flexible training models including a \u003cFIVE_TEN\u003e \u003cFIVE_TEN\u003e partnership between the government and companies along with other csr contribution models the initiative covers every aspect of skill development from designing industry aligned curricula and establishing state of the art training centers across urban and rural karnataka to offering certifications recognized by leading it companies and facilitating placements through continuous industry engagement kharge said also read karnataka govt will provide industry ready skills for locals no need for businesses to panic it minister priyank kharge a robust monitoring system will be implemented to track the progress of training programmes and placement rates with a feedback mechanism to ensure continuous improvement the initiative aims to scale up by establishing more training centres and expanding partnerships with additional it companies and sectors recognising karnatakas unique position as a hub for it and emerging technologies the government has outlined a comprehensive strategy to bridge the skill gap between fresh graduates including engineers and stem professionals and industry requirements with the rapid evolution of technology it is crucial to provide the right skills to prepare karnataka s youth for the industry kharge added also read karnatakas \u003cONE_HUNDRED\u003e engineering colleges to be linked with \u003cONE_HUNDRED\u003e tech companies to make students industry ready priyank kharge","timestamp":"2024-09-09T21:29:00+05:30","market_timestamp":"2024-09-10T09:15:00+05:30","off_market_hours":true}