{"url":"https://www.moneycontrol.com/news/business/markets/mc-inside-edge-a-catchy-tagline-for-reits-needed-dr-agarwal-eye-hospitals-parent-firm-eyes-ipo-slippery-road-ahead-for-car-makers-12825079.html","title":"MC Inside Edge: A catchy tagline for REITs needed, Dr Agarwal Eye Hospital's parent firm eyes IPO, slippery road ahead for car makers","description":"Know what stocks veteran bulls are eyeing, what the bears are ganging up against, major deals and all the inner goings-on from Dalal StreetYour dose of all the inner goings-on from Dalal Street. Related stories","content":"REITs Bhi Sahi Hai! Real Estate Investment Trusts or REITs are a sound vehicle to gain exposure to the real estate sector and various stakeholders, including the capital market regulator, have been pitching it in various forums. The recent past, however, has seen the regulator becoming a bit less vocal on the instrument for obvious reasons. While speaking at a capital market conference recently, SEBI chairperson Madhabi Puri Buch had jokingly said that if she talks about REITs then she will be accused of ‘conflict of interest’. So, it was a welcome change when recently a whole-time member of SEBI prodded the REITs industry to promote the instrument and even work on a catchy line – like ‘Mutual Funds Sahi Hai’. Conflict or no conflict, REITs Bhi Sahi Hai!  Dr Agarwal’s Health Care Ltd, which is the holding company of the listed entity Dr Agarwal's Eye Hospital is set to file a draft document for an initial public offer (IPO) in the next couple of weeks. The Chennai-based entity has already appointed Kotak Mahindra Bank and Morgan Stanley as investment bankers for the planned issue. It had earlier raised over Rs 1,000 crore from TPG Growth and Temasek and the IPO will provide these two investors, among others, an exit opportunity. The two global investors collectively hold a majority stake of around 60 percent in Dr Agarwal’s Health Care and have participated in two fund-raising rounds since May 2022. Auto makers look to strike a balance For many months now, auto makers have been facing the issue of huge inventory pile-ups and with the festive season fast approaching, the time has come to launch new models as well. That’s a rough road for auto makers to drive on. Market insiders say that most of the auto manufacturers are looking to strike a balance by offering huge discounts on existing models and also cutting down on the roll outs in terms of overall supply. For example, if a company planned to roll out 1 lakh units of a new launch, it would only do, say 60,000 or even less. Not the best of scenarios for car makers but one needs to look ahead while also keeping an eye on the rear-view mirror. ","cleaned_content":"reits bhi sahi hai real estate investment trusts or reits are a sound vehicle to gain exposure to the real estate sector and various stakeholders including the capital market regulator have been pitching it in various forums the recent past however has seen the regulator becoming a bit less vocal on the instrument for obvious reasons while speaking at a capital market conference recently sebi chairperson madhabi puri buch had jokingly said that if she talks about reits then she will be accused of conflict of interest so it was a welcome change when recently a whole time member of sebi prodded the reits industry to promote the instrument and even work on a catchy line like mutual funds sahi hai conflict or no conflict reits bhi sahi hai dr agarwal s health care ltd which is the holding company of the listed entity dr agarwals eye hospital is set to file a draft document for an initial public offer ipo in the next couple of weeks the chennai based entity has already appointed kotak mahindra bank and morgan stanley as investment bankers for the planned issue it had earlier raised over rs \u003cONE_THOUSAND\u003e crore from tpg growth and temasek and the ipo will provide these two investors among others an exit opportunity the two global investors collectively hold a majority stake of around \u003cSIX_TEN_PERCENT\u003e in dr agarwal s health care and have participated in two fund raising rounds since may \u003cTWO_THOUSAND\u003e auto makers look to strike a balance for many months now auto makers have been facing the issue of huge inventory pile ups and with the festive season fast approaching the time has come to launch new models as well that s a rough road for auto makers to drive on market insiders say that most of the auto manufacturers are looking to strike a balance by offering huge discounts on existing models and also cutting down on the roll outs in terms of overall supply for example if a company planned to roll out \u003cONE_\u003e lakh units of a new launch it would only do say \u003cSIX_TEN_THOUSAND\u003e or even less not the best of scenarios for car makers but one needs to look ahead while also keeping an eye on the rear view mirror","timestamp":"2024-09-19T11:15:00+05:30","market_timestamp":"2024-09-19T11:15:00+05:30","off_market_hours":false}