{"url":"https://www.moneycontrol.com/news/business/markets/mc-inside-edge-a-stock-exchanges-sme-ipo-platform-under-the-scanner-no-stopping-the-qip-juggernaut-signs-of-a-market-top-but-sit-tight-12827609.html","title":"MC Inside Edge: A stock exchange's SME IPO platform under the scanner, no stopping the QIP juggernaut, signs of a market top but sit tight","description":"Get your dose of all the inner goings-on from Dalal Street. Know what stocks veteran bulls are eyeing and what the bears are ganging up against. Know what stocks veteran bulls are eyeing, what the bears are ganging up against.Related stories","content":"Saga of heightened SME IPO scrutiny continues This is one story that just refuses to die down. Almost daily some news or the other crops up in the SME IPO segment, signalling that the regulator and stock exchanges are busy grappling with issues that need urgent attention. In the latest development, the Securities and Exchange Board of India (SEBI) has directed one of the national level exchanges to disclose the checks and balances it has put in place while allowing SMEs to list on its platform. The trigger for the move seems to be the fact that this exchange has been approving SME IPOs in much shorter time when compared to its competitor, bringing it under the regulatory scanner.  Some of the best educational institutions including IIT may be witnessing a slowdown of sorts in placing their students but when it comes to the equity markets the ability to place equity has not slowed down even a bit. Qualified Institutional Placements or QIPs where shares can be allotted to institutional investors in quick time to raise funds are in vogue. The current calendar year has already become the second-best in terms of cumulative find raising – nearly Rs 65,000 crore. More importantly, market participants are not anticipating any kind of fatigue creeping in with companies across sectors ready with their board resolutions to hit the market in the near future. The renewed interest in Indian equities from foreign institutional investors along with continued buying from their domestic counterparts is making many companies rush to their boards and get the necessary approvals before the tide turns. Are there reasons to FEAR? Everyone seems to be bullish on Indian equities. While they express concern on the valuation front, they also say that India is the place to make money on stocks. A widely followed newsletter globally and in India has reiterated this view and said that liquidity in the market is so huge that inflows are outpacing the supply of new equity. It has, however, said that there are “classic signs” of a “market top” being created and hence corrections can happen at any time. However, it is in no mood to tweak its allocations or weightage to India as it believes that the country looks set to enjoy a long runway of strong growth. Our take: some things are best left for time to tell. ","cleaned_content":"saga of heightened sme ipo scrutiny continues this is one story that just refuses to die down almost daily some news or the other crops up in the sme ipo segment signalling that the regulator and stock exchanges are busy grappling with issues that need urgent attention in the latest development the securities and exchange board of india sebi has directed one of the national level exchanges to disclose the checks and balances it has put in place while allowing smes to list on its platform the trigger for the move seems to be the fact that this exchange has been approving sme ipos in much shorter time when compared to its competitor bringing it under the regulatory scanner some of the best educational institutions including iit may be witnessing a slowdown of sorts in placing their students but when it comes to the equity markets the ability to place equity has not slowed down even a bit qualified institutional placements or qips where shares can be allotted to institutional investors in quick time to raise funds are in vogue the current calendar year has already become the second best in terms of cumulative find raising nearly rs \u003cSIX_TEN_THOUSAND\u003e crore more importantly market participants are not anticipating any kind of fatigue creeping in with companies across sectors ready with their board resolutions to hit the market in the near future the renewed interest in indian equities from foreign institutional investors along with continued buying from their domestic counterparts is making many companies rush to their boards and get the necessary approvals before the tide turns are there reasons to fear everyone seems to be bullish on indian equities while they express concern on the valuation front they also say that india is the place to make money on stocks a widely followed newsletter globally and in india has reiterated this view and said that liquidity in the market is so huge that inflows are outpacing the supply of new equity it has however said that there are classic signs of a market top being created and hence corrections can happen at any time however it is in no mood to tweak its allocations or weightage to india as it believes that the country looks set to enjoy a long runway of strong growth our take some things are best left for time to tell","timestamp":"2024-09-23T12:03:00+05:30","market_timestamp":"2024-09-23T12:03:00+05:30","off_market_hours":false}