{"url":"https://www.moneycontrol.com/news/world/more-than-100-people-missing-after-boat-capsizes-in-nigeria-12834211.html","title":"More than 100 people missing after boat capsizes in Nigeria","description":"The locally made boat, whose capacity was 100 passengers, had about 300 people onboard along the Niger River when it overturned in Niger state's Mokwa district on Monday night, according to the Niger State Emergency Management Agency.More than 100 people missing after boat capsizes in NigeriaRelated stories","content":"More than 100 people, mostly women and children, were missing after an overloaded boat bringing them back from an Islamic festival at night capsized in northwestern Nigeria, authorities said Wednesday. The locally made boat, whose capacity was 100 passengers, had about 300 people onboard along the Niger River when it overturned in Niger state's Mokwa district on Monday night, according to the Niger State Emergency Management Agency. Such boat disasters are common in Nigeria, especially in remote communities where the lack of good roads leaves many with no alternative routes. This is the fourth tragedy involving more than 100 passengers in northern Nigeria since mid-2023, many of them never accounted for. At least 150 people had been rescued by Wednesday morning amid a frantic search operation that is being supported by local divers and volunteers, according to Abdullahi Baba-Arah, head of Niger state's emergency services. “The boat was not supposed to carry more than 100 persons, but there were almost 300 people on it. And that was what resulted in the breakage of the boat,” said Salihu Garba, director of relief and rehabilitation at the state emergency services. Experts say most of the boat disasters in Nigeria in recent years increasingly point to regulatory failures and are often attributed to overloading or poorly maintained boats. ","cleaned_content":"more than \u003cONE_HUNDRED\u003e people mostly women and children were missing after an overloaded boat bringing them back from an islamic festival at night capsized in northwestern nigeria authorities said wednesday the locally made boat whose capacity was \u003cONE_HUNDRED\u003e passengers had about \u003cTHREE_HUNDRED\u003e people onboard along the niger river when it overturned in niger states mokwa district on monday night according to the niger state emergency management agency such boat disasters are common in nigeria especially in remote communities where the lack of good roads leaves many with no alternative routes this is the fourth tragedy involving more than \u003cONE_HUNDRED\u003e passengers in northern nigeria since mid \u003cTWO_THOUSAND\u003e many of them never accounted for at least \u003cONE_HUNDRED\u003e people had been rescued by wednesday morning amid a frantic search operation that is being supported by local divers and volunteers according to abdullahi baba arah head of niger states emergency services the boat was not supposed to carry more than \u003cONE_HUNDRED\u003e persons but there were almost \u003cTHREE_HUNDRED\u003e people on it and that was what resulted in the breakage of the boat said salihu garba director of relief and rehabilitation at the state emergency services experts say most of the boat disasters in nigeria in recent years increasingly point to regulatory failures and are often attributed to overloading or poorly maintained boats","timestamp":"2024-10-02T21:25:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}