{"url":"https://www.moneycontrol.com/news/business/davidson-kempner-books-profit-of-up-to-70-on-adani-bonds-12277791.html","title":"Davidson Kempner books profit of up to 70% on Adani bonds","description":"The investment firm spent about $500 million on the notes of companies including Adani Green Energy Ltd. immediately after Hindenburg published its report in January 2023, said people, who requested anonymity because the information is confidential.Davidson Kempner books profit of up to 70% on Adani bondsRelated stories","content":"Davidson Kempner made a profit of as much as 70% by buying Adani Group dollar bonds during the rout triggered by shortseller Hindenburg Research and later selling them when their prices recovered, according to people familiar with the matter. The investment firm spent about $500 million on the notes of companies including Adani Green Energy Ltd. immediately after Hindenburg published its report in January 2023, said people, who requested anonymity because the information is confidential.  Hindenburg’s allegations of malfeasance — repeatedly denied by Adani officials — triggered a selloff in group companies’ stocks and bonds in early 2023. While some investors sold off their holdings for good, others considered the rout a buying opportunity. A year on from the broadside, the shares and dollar bonds of Adani firms have largely recouped their losses. Spokespeople at Davidson Kempner and Adani declined to comment. ","cleaned_content":"davidson kempner made a profit of as much as \u003cSEVEN_TEN_PERCENT\u003e by buying adani group dollar bonds during the rout triggered by shortseller hindenburg research and later selling them when their prices recovered according to people familiar with the matter the investment firm spent about \u003cFIVE_HUNDRED\u003e million on the notes of companies including adani green energy ltd immediately after hindenburg published its report in january \u003cTWO_THOUSAND\u003e said people who requested anonymity because the information is confidential hindenburg s allegations of malfeasance repeatedly denied by adani officials triggered a selloff in group companies stocks and bonds in early \u003cTWO_THOUSAND\u003e while some investors sold off their holdings for good others considered the rout a buying opportunity a year on from the broadside the shares and dollar bonds of adani firms have largely recouped their losses spokespeople at davidson kempner and adani declined to comment","timestamp":"2024-02-15T12:36:00+05:30","market_timestamp":"2024-02-15T12:36:00+05:30","off_market_hours":false}