{"url":"https://www.moneycontrol.com/news/business/softbank-vision-fund-sold-down-paytm-stake-before-shares-plunged-12227371.html","title":"SoftBank vision fund sold down Paytm stake before shares plunged","description":"The Tokyo-based tech investor saw uncertainty growing in India’s regulatory environment, as well as over Paytm Payments Bank Ltd.’s license, Navneet Govil told Bloomberg News on Thursday.SoftBank vision fund sold down Paytm stake before shares plungedRelated stories","content":"SoftBank Group Corp. sold a majority of its stake in Paytm before regulatory scrutiny caused the once-celebrated Indian fintech firm’s shares to dive, according to the Vision Fund’s executive managing partner. The Tokyo-based tech investor saw uncertainty growing in India’s regulatory environment, as well as over Paytm Payments Bank Ltd.’s license, Navneet Govil told Bloomberg News on Thursday. “We felt it was prudent to start monetizing,” the Vision Fund’s finance chief said. “We’re glad we did a good portion of Paytm before the recent stock correction.” Govil declined to comment on what SoftBank would do with its remaining stake. Paytm has fielded multiple warnings from regulators over the last two years about dealings between its popular payments app and is banking arm, Bloomberg News had reported earlier. The Reserve Bank of India has suspended much of the banking operation’s business, sending Paytm’s stock price down more than 40% from its January peak. SoftBank earlier reported its first profit following four quarters of losses, with its Vision Fund also logging a profit in the December quarter. New bets by the startup investment arm have dwindled to a fraction of the billions it once wielded and have been outpaced by exit activity, however. ","cleaned_content":"softbank group corp sold a majority of its stake in paytm before regulatory scrutiny caused the once celebrated indian fintech firm s shares to dive according to the vision fund s executive managing partner the tokyo based tech investor saw uncertainty growing in india s regulatory environment as well as over paytm payments bank ltd s license navneet govil told bloomberg news on thursday we felt it was prudent to start monetizing the vision fund s finance chief said we re glad we did a good portion of paytm before the recent stock correction govil declined to comment on what softbank would do with its remaining stake paytm has fielded multiple warnings from regulators over the last two years about dealings between its popular payments app and is banking arm bloomberg news had reported earlier the reserve bank of india has suspended much of the banking operation s business sending paytm s stock price down more than \u003cFOUR_TEN_PERCENT\u003e from its january peak softbank earlier reported its first profit following four quarters of losses with its vision fund also logging a profit in the december quarter new bets by the startup investment arm have dwindled to a fraction of the billions it once wielded and have been outpaced by exit activity however","timestamp":"2024-02-09T07:54:00+05:30","market_timestamp":"2024-02-09T09:15:00+05:30","off_market_hours":true}