{"url":"https://www.moneycontrol.com/news/business/companies/some-layoffs-likely-at-zee-firm-revisits-plan-as-standalone-entity-after-sony-terminates-merger-12261091.html","title":"Some layoffs likely at Zee, firm revisits plan as standalone entity after Sony terminates merger","description":"Zee is revisiting plans as a standalone company and is focusing to enhance its performance in the coming quarters after the company posted a below performance in Q3FY24On February 13, ZEEL announced 141% rise in its consolidated net profit at Rs 58.5 for the quarter ending December 31, 2023Related stories","content":"There are likely to be some layoffs in Zee Entertainment as the company is looking to rationalise costs of employees to improve profitability. The latest development comes after Sony terminated a merger with Zee, a deal which was signed over two years ago and was set to build a $10 billion combined entity. \"Tightening our belt on manpower will be part of the plan going forward as we talk about frugality,\" said Zee CEO Punit Goenka during the Q3FY24 earnings call. Goenka also added that several proposals and conditions were proposed to Sony to address their demands but unfortunately, they remain unaccepted. Claims made by Sony, including demand of $90-mn termination fee, not tenable: Zee Entertainment \"The company's proposed merger was terminated by Sony through a communication received on January 22, 2024. The same was reviewed by our Board and appropriate steps have been taken into consideration with the legal experts that are in the best interest of our shareholders and stakeholders. We have even approached the National Company Law Tribunal (NCLT) to seek direction on the implementation of the scheme,\" the CEO said. Zee is now revisiting plans as a standalone company and is focusing on enhancing its performance in the coming quarters. The company reported a 140 percent increase in profit at Rs 58.5 crore in the December quarter of FY24 up from Rs 24.32 crore during the same period a year ago. \"In Q3FY24, overall operating costs declined by 12.8 percent quarter-on-quarter (QoQ) due to lower content costs, fewer movie releases and continuous cost optimization in Zee5. Given our business has high operating leverage, despite effective cost management, EBITDA (Earnings Before Interest, Taxes, Depreciation, and Amortization) margins has declined to 10.2 percent. Net profit for the quarter and year was impacted by merger expenses related exceptional items which came to about Rs 60.3 crore during the quarter,\" said Chief Financial Officer (CFO) Rohit Gupta. While our recent performance has been subdued, a large part of this has been due to temporary and transitory factors, Gupta added. \"Our target will be to reach 8 to 10 percent overall revenue CAGR (Compound Annual Growth Rate) with the current portfolio and to get back to 18 to 20 percent EBITDA margin profile in a stable macro environment. While we will somewhat depend on macro recovery for overall revenue growth, to have a better degree of control on our cost structure we are revisiting with frugality and a fiscal prudence mindset,\" the CFO said. Star alleges non-payment of instalment for ICC sports rights deal, Zee claims breach of agreement ","cleaned_content":"there are likely to be some layoffs in zee entertainment as the company is looking to rationalise costs of employees to improve profitability the latest development comes after sony terminated a merger with zee a deal which was signed over two years ago and was set to build a \u003cONE_TEN\u003e billion combined entity tightening our belt on manpower will be part of the plan going forward as we talk about frugality said zee ceo punit goenka during the q3fy24 earnings call goenka also added that several proposals and conditions were proposed to sony to address their demands but unfortunately they remain unaccepted claims made by sony including demand of \u003cNINE_TEN\u003e mn termination fee not tenable zee entertainment the companys proposed merger was terminated by sony through a communication received on january \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the same was reviewed by our board and appropriate steps have been taken into consideration with the legal experts that are in the best interest of our shareholders and stakeholders we have even approached the national company law tribunal nclt to seek direction on the implementation of the scheme the ceo said zee is now revisiting plans as a standalone company and is focusing on enhancing its performance in the coming quarters the company reported a \u003cONE_HUNDRED_PERCENT\u003e increase in profit at rs \u003cFIVE_TEN\u003e crore in the december quarter of fy24 up from rs \u003cTWO_TEN\u003e crore during the same period a year ago in q3fy24 overall operating costs declined by \u003cONE_TEN_PERCENT\u003e quarter on quarter qoq due to lower content costs fewer movie releases and continuous cost optimization in zee5 given our business has high operating leverage despite effective cost management ebitda earnings before interest taxes depreciation and amortization margins has declined to \u003cONE_TEN_PERCENT\u003e net profit for the quarter and year was impacted by merger expenses related exceptional items which came to about rs \u003cSIX_TEN\u003e crore during the quarter said chief financial officer cfo rohit gupta while our recent performance has been subdued a large part of this has been due to temporary and transitory factors gupta added our target will be to reach \u003cEIGHT_\u003e to \u003cONE_TEN_PERCENT\u003e overall revenue cagr compound annual growth rate with the current portfolio and to get back to \u003cONE_TEN\u003e to \u003cTWO_TEN_PERCENT\u003e ebitda margin profile in a stable macro environment while we will somewhat depend on macro recovery for overall revenue growth to have a better degree of control on our cost structure we are revisiting with frugality and a fiscal prudence mindset the cfo said star alleges non payment of instalment for icc sports rights deal zee claims breach of agreement","timestamp":"2024-02-13T22:49:00+05:30","market_timestamp":"2024-02-14T09:15:00+05:30","off_market_hours":true}