{"url":"https://www.moneycontrol.com/news/business/govt-examining-fdi-flow-from-china-in-paytm-payments-services-12243721.html","title":"Govt examining FDI flow from China in Paytm Payments Services","description":"In November 2020, Paytm Payments Services submitted an application to the RBI seeking a licence to function as a payment aggregator, following the guidelines outlined in the Regulation of Payment Aggregators and Payment Gateways.Govt examining FDI flow from China in Paytm Payments ServicesRelated stories","content":"The Centre is reportedly examining foreign direct investment (FDI) originating from China in Paytm Payments Services Ltd (PPSL), the payment aggregator subsidiary of One97 Communications Ltd (OCL), news agency PTI reported, citing sources. PPSL had applied for a licence with the Reserve Bank of India (RBI) in November 2020 to operate as a payment aggregator under the guidelines on Regulation of Payment Aggregators and Payment Gateways. However, in November 2022, RBI rejected PPSL’s application and instructed the company to resubmit it to comply with Press Note 3 under FDI rules. Notably, OCL counts investment from Chinese firm Ant Group Co. Following the banking regulator’s directive, the company submitted the requisite application on December 14, 2022, to the Centre concerning the past downward investment from OCL into PPSL, aiming to adhere to Press Note 3 outlined under FDI guidelines. An inter-ministerial committee is currently engaged in scrutinising investments originating from China in PPSL. A decision regarding the FDI matter is expected post due consideration and a thorough examination of all relevant aspects, according to the news agency. In accordance with Press Note 3, the government has mandated prior approval for foreign investments in any sector from nations sharing a land border with India. This measure aims to mitigate the risk of opportunistic takeovers of domestic firms in the aftermath of the Covid-19 pandemic. The countries sharing land borders with India include China, Bangladesh, Pakistan, Bhutan, Nepal, Myanmar, and Afghanistan. A spokesperson from Paytm told the news agency that PPSL had initially applied for an online Payment Aggregator (PA) application catering to online merchants. Following this, the central bank instructed PPSL to obtain requisite approvals for past downward investment and then resubmit the application accordingly. Also Read | Without RBI migration approval, Paytm's UPI business faces an existential crisis \"This is part of the regular process where everybody applying for a payment aggregator licence has to get FDI approval,\" the spokesperson said. According to the spokesperson, PPSL diligently adhered to the relevant guidelines and furnished all necessary documents to the regulator within the designated timeframe. Throughout the pending process, PPSL was permitted to sustain its online payment aggregation operations for existing partners, albeit refraining from onboarding any new merchants. \"Since then the ownership structure has changed. The Paytm founder remains the largest stakeholder in the company. Ant Financial reduced its stake in OCL to less than 10 per cent in July 2023. Subsequently, it does not qualify for beneficial company ownership. OCL founding promoter now holds a 24.3 per cent stake. Therefore, your understanding of FDI from China in PPSL is incorrect and misleading,\" the spokesperson said. Last month, the RBI imposed restrictions on PPSL, prohibiting it from accepting deposits or top-ups in customer accounts, prepaid instruments, wallets, and FASTags, among other transactions, effective from February 29, 2024. The RBI's action against PPSL is a direct result of a thorough system audit report followed by a compliance validation report conducted by external auditors. (With inputs from PTI) ","cleaned_content":"the centre is reportedly examining foreign direct investment fdi originating from china in paytm payments services ltd ppsl the payment aggregator subsidiary of one97 communications ltd ocl news agency pti reported citing sources ppsl had applied for a licence with the reserve bank of india rbi in november \u003cTWO_THOUSAND\u003e to operate as a payment aggregator under the guidelines on regulation of payment aggregators and payment gateways however in november \u003cTWO_THOUSAND\u003e rbi rejected ppsl s application and instructed the company to resubmit it to comply with press note \u003cTHREE_\u003e under fdi rules notably ocl counts investment from chinese firm ant group co following the banking regulator s directive the company submitted the requisite application on december \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e to the centre concerning the past downward investment from ocl into ppsl aiming to adhere to press note \u003cTHREE_\u003e outlined under fdi guidelines an inter ministerial committee is currently engaged in scrutinising investments originating from china in ppsl a decision regarding the fdi matter is expected post due consideration and a thorough examination of all relevant aspects according to the news agency in accordance with press note \u003cTHREE_\u003e the government has mandated prior approval for foreign investments in any sector from nations sharing a land border with india this measure aims to mitigate the risk of opportunistic takeovers of domestic firms in the aftermath of the covid \u003cONE_TEN\u003e pandemic the countries sharing land borders with india include china bangladesh pakistan bhutan nepal myanmar and afghanistan a spokesperson from paytm told the news agency that ppsl had initially applied for an online payment aggregator pa application catering to online merchants following this the central bank instructed ppsl to obtain requisite approvals for past downward investment and then resubmit the application accordingly also read without rbi migration approval paytms upi business faces an existential crisis this is part of the regular process where everybody applying for a payment aggregator licence has to get fdi approval the spokesperson said according to the spokesperson ppsl diligently adhered to the relevant guidelines and furnished all necessary documents to the regulator within the designated timeframe throughout the pending process ppsl was permitted to sustain its online payment aggregation operations for existing partners albeit refraining from onboarding any new merchants since then the ownership structure has changed the paytm founder remains the largest stakeholder in the company ant financial reduced its stake in ocl to less than \u003cONE_TEN_PERCENT\u003e in july \u003cTWO_THOUSAND\u003e subsequently it does not qualify for beneficial company ownership ocl founding promoter now holds a \u003cTWO_TEN_PERCENT\u003e stake therefore your understanding of fdi from china in ppsl is incorrect and misleading the spokesperson said last month the rbi imposed restrictions on ppsl prohibiting it from accepting deposits or top ups in customer accounts prepaid instruments wallets and fastags among other transactions effective from february \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the rbis action against ppsl is a direct result of a thorough system audit report followed by a compliance validation report conducted by external auditors with inputs from pti","timestamp":"2024-02-12T08:24:00+05:30","market_timestamp":"2024-02-12T09:15:00+05:30","off_market_hours":true}