{"url":"https://www.moneycontrol.com/news/business/companies/star-alleges-non-payment-of-instalment-for-icc-sports-rights-deal-zee-claims-breach-of-agreement-12261081.html","title":"Star alleges non-payment of instalment for ICC sports rights deal, Zee claims breach of agreement","description":"Both Zee and Sony have alleged breach of agreement for the ICC Cricket TV rights deal.Disney Star, which had acquired the ICC TV and digital rights for India from 2024 to 2027 for $3 billion, had retained the digital rights and sub-licensed the TV rights to Zee in 2022Related stories","content":"The contract between Zee Entertainment and Star India for the television rights of ICC cricket may get terminated over the alleged breach of the Alliance Agreement between the two parties, which they had agreed upon for the sports rights deal. Star India had sent letters to Zee alleging a breach of the agreement during the December quarter of FY24 on account of non-payment of dues for the rights concerning the first instalment of the rights fee aggregating to $203.56 million or Rs 1,693.42 crore. This was along with the payment for bank guarantee commission and deposit interest aggregating Rs 17 crore and financial commitments including furnishing of corporate guarantee confirmation as stated in the alliance agreement, Zee said in a document released along with its Q3FY24 results on February 13. On the other hand, Zee said that Star has not acted as per the agreement and has failed to obtain necessary approvals, and execution of necessary documentation and agreements. The company's management believes that Star by its conduct has breached the Alliance Agreement and is in default of the terms thereof and consequently, the contract stands repudiated. Zee said that it has communicated to Star that the alliance agreement cannot be preceded and has sought a refund of Rs 68.54 crore paid to Star. Claims made by Sony, including demand of $90-mn termination fee, not tenable: Zee Entertainment Case history On August 26, 2022, Zee entered into an Alliance Agreement with Star India Private Limited in which Star would grant sub-licensing rights concerning television broadcasting rights of the International Cricket Council's, (ICC) Men's and Under 19 (U-19) global events for a period of four years (ICC 2024-2027) on an exclusive basis. Disney Star acquired the ICC TV and digital rights for India from 2024 to 2027 for $3 billion. It retained the digital rights and sub-licensed the TV rights for the men's and Under-19 global events to Zee. The ICC Under-19 Men's Cricket World Cup 2024, held from January 19 to February 11, was the first tournament under the new media rights cycle. While Zee said that it had identified this acquisition of strategic importance, analysts have pointed out that the deal would result in annual losses of Rs 1,520 crore in FY25 and beyond due to high content cost, lowersports ad revenue and cricket content are available for free on streaming platform. In addition, after Sony terminated the merger, experts had said that Zee may not be able to fulfil this commitment of the ICC sports rights deal with a cash balance of Rs 600 crore. While some legal experts have said that Disney Star may not hesitate to take Zee to court if it fails to honour the agreement, Zee has said that it has strong and valid grounds to defend any claims. ","cleaned_content":"the contract between zee entertainment and star india for the television rights of icc cricket may get terminated over the alleged breach of the alliance agreement between the two parties which they had agreed upon for the sports rights deal star india had sent letters to zee alleging a breach of the agreement during the december quarter of fy24 on account of non payment of dues for the rights concerning the first instalment of the rights fee aggregating to \u003cTWO_HUNDRED\u003e million or rs \u003cONE_THOUSAND\u003e crore this was along with the payment for bank guarantee commission and deposit interest aggregating rs \u003cONE_TEN\u003e crore and financial commitments including furnishing of corporate guarantee confirmation as stated in the alliance agreement zee said in a document released along with its q3fy24 results on february \u003cONE_TEN\u003e on the other hand zee said that star has not acted as per the agreement and has failed to obtain necessary approvals and execution of necessary documentation and agreements the companys management believes that star by its conduct has breached the alliance agreement and is in default of the terms thereof and consequently the contract stands repudiated zee said that it has communicated to star that the alliance agreement cannot be preceded and has sought a refund of rs \u003cSIX_TEN\u003e crore paid to star claims made by sony including demand of \u003cNINE_TEN\u003e mn termination fee not tenable zee entertainment case history on august \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e zee entered into an alliance agreement with star india private limited in which star would grant sub licensing rights concerning television broadcasting rights of the international cricket councils icc mens and under \u003cONE_TEN\u003e u \u003cONE_TEN\u003e global events for a period of four years icc \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e on an exclusive basis disney star acquired the icc tv and digital rights for india from \u003cTWO_THOUSAND\u003e to \u003cTWO_THOUSAND\u003e for \u003cTHREE_\u003e billion it retained the digital rights and sub licensed the tv rights for the mens and under \u003cONE_TEN\u003e global events to zee the icc under \u003cONE_TEN\u003e mens cricket world cup \u003cTWO_THOUSAND\u003e held from january \u003cONE_TEN\u003e to february \u003cONE_TEN\u003e was the first tournament under the new media rights cycle while zee said that it had identified this acquisition of strategic importance analysts have pointed out that the deal would result in annual losses of rs \u003cONE_THOUSAND\u003e crore in fy25 and beyond due to high content cost lowersports ad revenue and cricket content are available for free on streaming platform in addition after sony terminated the merger experts had said that zee may not be able to fulfil this commitment of the icc sports rights deal with a cash balance of rs \u003cSIX_HUNDRED\u003e crore while some legal experts have said that disney star may not hesitate to take zee to court if it fails to honour the agreement zee has said that it has strong and valid grounds to defend any claims","timestamp":"2024-02-13T22:15:00+05:30","market_timestamp":"2024-02-14T09:15:00+05:30","off_market_hours":true}