{"url":"https://www.moneycontrol.com/news/business/vedantas-aluminium-business-head-says-demerger-process-to-be-completed-in-next-9-12-months-12246741.html","title":"Vedanta's aluminium business head says demerger process to be completed in next 9-12 months","description":"Billionaire Anil Agarwal-owned Vedanta Ltd had last year announced creation of independent verticals through demerger of its metal, power, aluminium, and oil and gas businesses to unlock potential value.Vedanta's aluminium business head says demerger process to be completed in next 9-12 monthsRelated stories","content":"Vedanta is working \"actively\" for demerger of its key businesses, including aluminium, into separate listed companies and the process is likely to be completed in next nine to 12 months, a top official of the company said. Billionaire Anil Agarwal-owned Vedanta Ltd had last year announced creation of independent verticals through demerger of its metal, power, aluminium, and oil and gas businesses to unlock potential value. In an interview to PTI, John Slaven, CEO of aluminium business of Vedanta, said, \"We are working very actively in securing the successful demerger of the aluminium business.\" The process for the demerger is currently underway and is subject to a number of approvals from various authorities, he added. The move, he said, will be an evolutionary step for Vedanta's aluminium business as it will help Vedanta Aluminium to chart out its own course. \"I think more fundamentally it enables our investors and Vedanta Resources to really have a much better understanding of the opportunities and potential of the aluminium business. \"It will become much more visible as it would be a pure-play. We will have a dedicated management team, a dedicated board of directors will be able to chart our own strategy with input from the investor community,\" Slaven said. About capacity expansion plans for 2024-25, he said that the company will see a significant change in its business because the refinery expansions at Lanjigarh will be effectively completed by the end of next fiscal year. \"We are expanding our BALCO smelter, so we are essentially going from 5,50,000 tonnes to a million tonnes, Slaven said, adding that the production is expected to come in the late second quarter or in the beginning of the third quarter, and progressively ramp up during the rest of FY25. \"We are also completing expansion of our value-added products. We are adding billet capacity, we are adding capacity for foundry alloy, we are increasing the capacity of our rolled products business so we are taking that from 44,000 tonnes to about 100,000 tonnes. So a lot of that is going to be completed during the next fiscal,\" he said. The production at Vedanta's Sijimali bauxite mine will begin in the third quarter of next financial year, he said. Besides, the company's additional three coal mines -- Kuraloi, Radhikapur, Ghogharpalli -- will start production in about nine to 18 months. Vedanta Aluminium, a business of Vedanta Limited, is the country's leading producer of aluminium, manufacturing more than half of India's aluminium i.e., 2.29 million tonnes in FY'23. It is also into value-added aluminium products that find critical applications in core downstream industries. ","cleaned_content":"vedanta is working actively for demerger of its key businesses including aluminium into separate listed companies and the process is likely to be completed in next nine to \u003cONE_TEN\u003e months a top official of the company said billionaire anil agarwal owned vedanta ltd had last year announced creation of independent verticals through demerger of its metal power aluminium and oil and gas businesses to unlock potential value in an interview to pti john slaven ceo of aluminium business of vedanta said we are working very actively in securing the successful demerger of the aluminium business the process for the demerger is currently underway and is subject to a number of approvals from various authorities he added the move he said will be an evolutionary step for vedantas aluminium business as it will help vedanta aluminium to chart out its own course i think more fundamentally it enables our investors and vedanta resources to really have a much better understanding of the opportunities and potential of the aluminium business it will become much more visible as it would be a pure play we will have a dedicated management team a dedicated board of directors will be able to chart our own strategy with input from the investor community slaven said about capacity expansion plans for \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e he said that the company will see a significant change in its business because the refinery expansions at lanjigarh will be effectively completed by the end of next fiscal year we are expanding our balco smelter so we are essentially going from \u003cFIVE_HUNDRED_THOUSAND\u003e tonnes to a million tonnes slaven said adding that the production is expected to come in the late second quarter or in the beginning of the third quarter and progressively ramp up during the rest of fy25 we are also completing expansion of our value added products we are adding billet capacity we are adding capacity for foundry alloy we are increasing the capacity of our rolled products business so we are taking that from \u003cFOUR_TEN_THOUSAND\u003e tonnes to about \u003cONE_HUNDRED_THOUSAND\u003e tonnes so a lot of that is going to be completed during the next fiscal he said the production at vedantas sijimali bauxite mine will begin in the third quarter of next financial year he said besides the companys additional three coal mines kuraloi radhikapur ghogharpalli will start production in about nine to \u003cONE_TEN\u003e months vedanta aluminium a business of vedanta limited is the countrys leading producer of aluminium manufacturing more than half of indias aluminium i e \u003cTWO_\u003e million tonnes in fy23 it is also into value added aluminium products that find critical applications in core downstream industries","timestamp":"2024-02-12T13:08:00+05:30","market_timestamp":"2024-02-12T13:08:00+05:30","off_market_hours":false}