{"url":"https://www.moneycontrol.com/news/technology/auto/tata-motors-ties-up-with-leadit-for-greener-future-12249141.html","title":"Tata Motors ties up with LeadIT for greener future","description":"As a member of LeadIT, the auto major will be able to harness the power of global best practices, influence policy-making, and together with other members strengthen climate action plans, thereby accelerating transition towards net-zero emissions.Tata Motors ties up with LeadIT for greener future","content":"Tata Motors on Monday said it has tied up with the Leadership Group for Industry Transition (LeadIT), a global alliance launched by governments of Sweden and India at the UN Climate Action Summit in September 2019. As a member of LeadIT, the auto major will be able to harness the power of global best practices, influence policy-making, and together with other members strengthen climate action plans, thereby accelerating transition towards net-zero emissions. \"Our pledge to attain net-zero emissions across our Passenger Vehicles (PV) business by 2040, and our Commercial Vehicles (CV) business by 2045, is a testament to our commitment to a greener future,\" Tata Motors Vice President and Chief Sustainability Officer SJR Kutty said in a statement. Sweden's Minister for Climate and the Environment and Co-Chair of LeadIT, Romina Pourmokhtari said the membership signals an important commitment to net-zero from a leading global manufacturer in the supply chain. \"Demand signals are crucial for the transformation of our industry. Fostering dialogues and strengthening partnerships in areas where transition challenges need to be addressed is core to achieving reduced climate emissions,\" she added. ","cleaned_content":"tata motors on monday said it has tied up with the leadership group for industry transition leadit a global alliance launched by governments of sweden and india at the un climate action summit in september \u003cTWO_THOUSAND\u003e as a member of leadit the auto major will be able to harness the power of global best practices influence policy making and together with other members strengthen climate action plans thereby accelerating transition towards net zero emissions our pledge to attain net zero emissions across our passenger vehicles pv business by \u003cTWO_THOUSAND\u003e and our commercial vehicles cv business by \u003cTWO_THOUSAND\u003e is a testament to our commitment to a greener future tata motors vice president and chief sustainability officer sjr kutty said in a statement swedens minister for climate and the environment and co chair of leadit romina pourmokhtari said the membership signals an important commitment to net zero from a leading global manufacturer in the supply chain demand signals are crucial for the transformation of our industry fostering dialogues and strengthening partnerships in areas where transition challenges need to be addressed is core to achieving reduced climate emissions she added","timestamp":"2024-02-12T15:36:00+05:30","market_timestamp":"2024-02-13T09:15:00+05:30","off_market_hours":true}