{"url":"https://www.moneycontrol.com/news/business/japans-mizuho-bank-acquires-15-stake-in-credit-saison-india-for-rs-1200-crore-12257791.html","title":"Japan's Mizuho Bank acquires 15% stake in Credit Saison India for Rs 1,200 crore","description":"This is Credit Saison's first investment from an external investor, a statement from CS India said.Japan's Mizuho Bank acquires 15% stake in Credit Saison India for Rs 1,200 crore","content":"Digital non-banking finance company Credit Saison (CS) India on Tuesday said Japan's Mizuho Bank has acquired 15 per cent stake in it for Rs 1,200 crore. This is Credit Saison's first investment from an external investor, a statement from CS India said. This strategic investment will enable CS India to continue its journey towards becoming a well-diversified, resilient lending franchise with a focus on growth and profitability, the statement added. Later, it expanded into retail lending through partnerships. Currently, it has 1.2 million active loans worth over Rs 10,000 crore, Presha Paragash, chief executive of CS India said. Mizuho Bank is the retail and corporate banking unit of Mizuho Financial Group while CS India is the domestic arm of Saison International, one of Japan's largest lenders. ","cleaned_content":"digital non banking finance company credit saison cs india on tuesday said japans mizuho bank has acquired \u003cONE_TEN_PERCENT\u003e stake in it for rs \u003cONE_THOUSAND\u003e crore this is credit saisons first investment from an external investor a statement from cs india said this strategic investment will enable cs india to continue its journey towards becoming a well diversified resilient lending franchise with a focus on growth and profitability the statement added later it expanded into retail lending through partnerships currently it has \u003cONE_\u003e million active loans worth over rs \u003cONE_TEN_THOUSAND\u003e crore presha paragash chief executive of cs india said mizuho bank is the retail and corporate banking unit of mizuho financial group while cs india is the domestic arm of saison international one of japans largest lenders","timestamp":"2024-02-13T13:46:00+05:30","market_timestamp":"2024-02-13T13:46:00+05:30","off_market_hours":false}