{"url":"https://www.moneycontrol.com/news/business/indigo-signs-financing-pact-with-boc-aviation-for-4-airbus-a320neo-aircraft-12265041.html","title":"IndiGo signs financing pact with BOC Aviation for 4 Airbus A320NEO aircraft","description":"The deal has been signed for four Airbus A320NEO aircraft.IndiGo signs financing pact with BOC Aviation for 4 Airbus A320NEO aircraft","content":"Singapore-headquartered BOC Aviation Ltd on Wednesday said it has entered into a finance lease transaction with InterGlobe Aviation Ltd (IndiGo). The deal has been signed for four Airbus A320NEO aircraft. \"We are pleased to be closing another four finance leases with IndiGo,\" said Steven Townend, Chief Executive Officer and Managing Director, BOC Aviation. The aircraft are all powered by CFM LEAP-1A engines. All four aircraft are scheduled for delivery in 2024. \"We are pleased to announce that we have extended our partnership with BOC Aviation through a lease agreement for four Airbus A320NEO aircraft,\" said Riyaz Peermohamed, Chief Aircraft Acquisition and Financing Officer of IndiGo. He further said that these aircraft will be instrumental in supporting the company's expansion plans and strengthening our position in both domestic and international markets. \"At IndiGo, we are dedicated to providing our customers with unparalleled travel experiences, and this partnership will allow us to continue delivering affordable, on-time, and hassle-free travel across our extensive 6E network,\" he said. ","cleaned_content":"singapore headquartered boc aviation ltd on wednesday said it has entered into a finance lease transaction with interglobe aviation ltd indigo the deal has been signed for four airbus a320neo aircraft we are pleased to be closing another four finance leases with indigo said steven townend chief executive officer and managing director boc aviation the aircraft are all powered by cfm leap \u003cONE_\u003e a engines all four aircraft are scheduled for delivery in \u003cTWO_THOUSAND\u003e we are pleased to announce that we have extended our partnership with boc aviation through a lease agreement for four airbus a320neo aircraft said riyaz peermohamed chief aircraft acquisition and financing officer of indigo he further said that these aircraft will be instrumental in supporting the companys expansion plans and strengthening our position in both domestic and international markets at indigo we are dedicated to providing our customers with unparalleled travel experiences and this partnership will allow us to continue delivering affordable on time and hassle free travel across our extensive \u003cSIX_\u003e e network he said","timestamp":"2024-02-14T11:09:00+05:30","market_timestamp":"2024-02-14T11:09:00+05:30","off_market_hours":false}