{"url":"https://www.moneycontrol.com/news/world/ongc-in-talks-to-restart-libya-operations-expand-in-venezuela-executive-12230931.html","title":"ONGC in talks to restart Libya operations, expand in Venezuela: Executive","description":"\"Once it gets started for Oil India, same applies to us. We are also in the same pact with National Oil Corporation of Libya,\" Sushma Rawat, director of exploration with ONGC said.India's ONGC in talks to restart Libya operations, expand in Venezuela: Executive","content":"India's Oil and Natural Gas Corp is in talks to restart its operations in Libya and to increase production in Venezuela, a company executive said on Friday. \"Once it gets started for Oil India, same applies to us. We are also in the same pact with National Oil Corporation of Libya,\" Sushma Rawat, director of exploration with ONGC said. Earlier this week, Reuters reported that Oil India is talks with stakeholders to restart drilling in Libya, 13 years after the company exited the country due to political instability. ONGC is also in talks to increase production in Venezuela, Rawat told reporters on the sidelines of India Energy Week event in Goa. Oil India, too, is in talks with operators to ramp up oil production in the South American nation, Reuters had reported this week. The United States had granted sanctions relief for OPEC member Venezuela in October last year in recognition of a deal for elections this year. However, on Jan. 29 the country began reinstating sanctions on Venezuela. Rawat also said the company will start drilling in Andaman Islands by the end of the year and Cauvery Delta in South India by this month or March. The official also said the company needs tax rebates and cost benefits when it goes for exploration in difficult regions. ","cleaned_content":"indias oil and natural gas corp is in talks to restart its operations in libya and to increase production in venezuela a company executive said on friday once it gets started for oil india same applies to us we are also in the same pact with national oil corporation of libya sushma rawat director of exploration with ongc said earlier this week reuters reported that oil india is talks with stakeholders to restart drilling in libya \u003cONE_TEN\u003e years after the company exited the country due to political instability ongc is also in talks to increase production in venezuela rawat told reporters on the sidelines of india energy week event in goa oil india too is in talks with operators to ramp up oil production in the south american nation reuters had reported this week the united states had granted sanctions relief for opec member venezuela in october last year in recognition of a deal for elections this year however on jan \u003cTWO_TEN\u003e the country began reinstating sanctions on venezuela rawat also said the company will start drilling in andaman islands by the end of the year and cauvery delta in south india by this month or march the official also said the company needs tax rebates and cost benefits when it goes for exploration in difficult regions","timestamp":"2024-02-09T12:44:00+05:30","market_timestamp":"2024-02-09T12:44:00+05:30","off_market_hours":false}