{"url":"https://www.moneycontrol.com/news/business/vedanta-aluminium-launches-e-commerce-platform-12255251.html","title":"Vedanta Aluminium launches e-commerce platform","description":"The e-commerce platform will provide buyers with just-in-time delivery, real-time AI-based price discovery, and end-to-end visibility of their purchase, from order placement to delivery.Vedanta Aluminium launches e-commerce platformRelated stories","content":"Vedanta Aluminium said it has launched an e-commerce platform for facilitating the sale of primary aluminium products. The e-commerce platform will provide buyers with just-in-time delivery, real-time AI-based price discovery, and end-to-end visibility of their purchase, from order placement to delivery. The company has listed over 750 aluminium products on the e-superstore, 'Vedanta Metal Bazaar'. Customers have the option to choose from a selection of channel finance and logistics providers to facilitate their procurement journey. \"For small and medium-sized companies, this is going to be a real game changer,\" Vedanta Aluminium CEO John Slaven told PTI. Further, Slaven termed the e-commerce platform as a breakthrough for the industry in India as it would help the company in serving its customers a full range of products. \"Over 750 products are available and all aspects of the buying process from really identifying which products they want, understanding pricing, which is a very complex and dynamic process, and then everything from negotiating the contract, documenting, and then managing the logistics...and then delivery to the to their site. And then for financial reconciliation, all of that can be done on this platform,\" he added. Products on offer include ingots, billets, primary foundry alloy, wire rods, rolled products, flip coils, hot metal, and Restora --low-carbon aluminium. In addition, the superstore also offers customised solutions tailored to the needs of the company's customer base. Vedanta Aluminium, a business of Vedanta Ltd, manufactured 2.29 million tonne of aluminium in FY23. ","cleaned_content":"vedanta aluminium said it has launched an e commerce platform for facilitating the sale of primary aluminium products the e commerce platform will provide buyers with just in time delivery real time ai based price discovery and end to end visibility of their purchase from order placement to delivery the company has listed over \u003cSEVEN_HUNDRED\u003e aluminium products on the e superstore vedanta metal bazaar customers have the option to choose from a selection of channel finance and logistics providers to facilitate their procurement journey for small and medium sized companies this is going to be a real game changer vedanta aluminium ceo john slaven told pti further slaven termed the e commerce platform as a breakthrough for the industry in india as it would help the company in serving its customers a full range of products over \u003cSEVEN_HUNDRED\u003e products are available and all aspects of the buying process from really identifying which products they want understanding pricing which is a very complex and dynamic process and then everything from negotiating the contract documenting and then managing the logistics and then delivery to the to their site and then for financial reconciliation all of that can be done on this platform he added products on offer include ingots billets primary foundry alloy wire rods rolled products flip coils hot metal and restora low carbon aluminium in addition the superstore also offers customised solutions tailored to the needs of the companys customer base vedanta aluminium a business of vedanta ltd manufactured \u003cTWO_\u003e million tonne of aluminium in fy23","timestamp":"2024-02-13T11:15:00+05:30","market_timestamp":"2024-02-13T11:15:00+05:30","off_market_hours":false}