{"url":"https://www.moneycontrol.com/news/business/larsen-toubro-bags-significant-orders-in-middle-east-12255341.html","title":"Larsen \u0026 Toubro bags 'significant' orders in Middle East","description":"The company did not disclose the order value. However, according to its classification, significant orders value in the range of Rs 1,000 crore to Rs 2,500 crore.Larsen \u0026 Toubro bags 'significant' orders in Middle East","content":"Infrastructure major Larsen \u0026 Toubro (L\u0026T) on Tuesday said that its hydrocarbon division has bagged \"significant orders\" from a client in the Middle East. The company did not disclose the order value. However, according to its classification, significant orders value in the range of Rs 1,000 crore to Rs 2,500 crore. \"The Hydrocarbon vertical, L\u0026T Energy Hydrocarbon (LTEH) of Larsen \u0026 Toubro (L\u0026T), has secured an onshore order and an offshore order from a prestigious client in the Middle East,\" the infrastructure major said in a stock exchange filing. The offshore order involves mainly brownfield work including upgradation of shutdown systems in existing offshore platforms. Larsen \u0026 Toubro is a USD 23 billion Indian multinational engaged in engineering, procurement and construction (EPC) projects, hi-tech manufacturing, and services. ","cleaned_content":"infrastructure major larsen toubro l t on tuesday said that its hydrocarbon division has bagged significant orders from a client in the middle east the company did not disclose the order value however according to its classification significant orders value in the range of rs \u003cONE_THOUSAND\u003e crore to rs \u003cTWO_THOUSAND\u003e crore the hydrocarbon vertical l t energy hydrocarbon lteh of larsen toubro l t has secured an onshore order and an offshore order from a prestigious client in the middle east the infrastructure major said in a stock exchange filing the offshore order involves mainly brownfield work including upgradation of shutdown systems in existing offshore platforms larsen toubro is a usd \u003cTWO_TEN\u003e billion indian multinational engaged in engineering procurement and construction epc projects hi tech manufacturing and services","timestamp":"2024-02-13T11:48:00+05:30","market_timestamp":"2024-02-13T11:48:00+05:30","off_market_hours":false}