{"url":"https://www.moneycontrol.com/news/business/reliance-in-talks-to-buy-tata-play-stake-from-disney-report-12280381.html","title":"Reliance in talks to buy Tata Play stake from Disney: Report","description":"The oil-to-telecom conglomerate is looking to buy Walt Disney's 29.8% stake in the loss-making Tata Play as it seeks to offer its entire JioCinema content to Tata's customers, the newspaper reported, citing sources aware of the development.Reliance in talks to buy Tata Play stake from Disney: ReportRelated stories","content":"Reliance Industries is in talks to buy Disney's stake in satellite TV provider Tata Play, the Business Standard newspaper reported on Thursday, as billionaire Mukesh Ambani's firm seeks to bolster its media presence. The oil-to-telecom conglomerate is looking to buy Walt Disney's 29.8% stake in the loss-making Tata Play as it seeks to offer its entire JioCinema content to Tata's customers, the newspaper reported, citing sources aware of the development. Bankers are currently valuing Disney's stake in Tata Play, which also offers access to video streaming services, the report added. Reliance, which runs multiple TV channels and JioCinema streaming app through its media unit Viacom18, is looking to strengthen its hold on India's $28-billion media and entertainment market. Tata Play swung to a loss of 1.05 billion rupees (about $13 million) in fiscal 2023, compared with a profit of 686 million rupees. Its revenues fell 5% during the same period. The Temasek-backed company had confidentially filed for a $300 million IPO more than a year ago, Economic Times reported. Reliance and Disney did not immediately respond to Reuters' request for comments, while a spokesperson for Tata Play declined to respond. Reliance is close to merging its India media business with Disney with a 51%-54% stake, Reuters reported earlier this month. The deal values the U.S. giant's Indian operations at $3.5 billion. Bodhi Tree, a joint venture between James Murdoch and former top Disney executive, Uday Shankar, is also set to buy a stake of around 9% in the newly merged entity. Disney will hold around 40%. Tata Sons owns a majority stake of 50.2% in Tata Play. Singapore's Temasek holds about 20%, while Disney owns the rest. Disclosure: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary. ","cleaned_content":"reliance industries is in talks to buy disneys stake in satellite tv provider tata play the business standard newspaper reported on thursday as billionaire mukesh ambanis firm seeks to bolster its media presence the oil to telecom conglomerate is looking to buy walt disneys \u003cTWO_TEN_PERCENT\u003e stake in the loss making tata play as it seeks to offer its entire jiocinema content to tatas customers the newspaper reported citing sources aware of the development bankers are currently valuing disneys stake in tata play which also offers access to video streaming services the report added reliance which runs multiple tv channels and jiocinema streaming app through its media unit viacom18 is looking to strengthen its hold on indias \u003cTWO_TEN\u003e billion media and entertainment market tata play swung to a loss of \u003cONE_\u003e billion rupees about \u003cONE_TEN\u003e million in fiscal \u003cTWO_THOUSAND\u003e compared with a profit of \u003cSIX_HUNDRED\u003e million rupees its revenues fell \u003cFIVE_PERCENT\u003e during the same period the temasek backed company had confidentially filed for a \u003cTHREE_HUNDRED\u003e million ipo more than a year ago economic times reported reliance and disney did not immediately respond to reuters request for comments while a spokesperson for tata play declined to respond reliance is close to merging its india media business with disney with a \u003cFIVE_TEN_PERCENT\u003e \u003cFIVE_TEN_PERCENT\u003e stake reuters reported earlier this month the deal values the u s giants indian operations at \u003cTHREE_\u003e billion bodhi tree a joint venture between james murdoch and former top disney executive uday shankar is also set to buy a stake of around \u003cNINE_PERCENT\u003e in the newly merged entity disney will hold around \u003cFOUR_TEN_PERCENT\u003e tata sons owns a majority stake of \u003cFIVE_TEN_PERCENT\u003e in tata play singapores temasek holds about \u003cTWO_TEN_PERCENT\u003e while disney owns the rest disclosure moneycontrol is a part of the network18 group network18 is controlled by independent media trust of which reliance industries is the sole beneficiary","timestamp":"2024-02-15T15:09:00+05:30","market_timestamp":"2024-02-15T15:09:00+05:30","off_market_hours":false}