{"url":"https://www.moneycontrol.com/news/business/indias-ltimindtree-grooms-two-insiders-for-ceo-job-sources-say-12257041.html","title":"India's LTIMindtree grooms two insiders for CEO job, sources say","description":"Chief Operating Officer Nachiket Deshpande and President Sudhir Chaturvedi are the front-runners for the role as the board prefers to have an insider at the helm of the company, one of the persons said.India's LTIMindtree grooms two insiders for CEO job, sources sayRelated stories","content":"LTIMindtree, India's No.6 IT services provider by revenue, has identified two internal candidates for the top job as it is unlikely to extend CEO Debashis Chatterjee's term that is set to end next year, according to two persons familiar with the matter. Chief Operating Officer Nachiket Deshpande and President Sudhir Chaturvedi are the front-runners for the role as the board prefers to have an insider at the helm of the company, one of the persons said. LTIMindtree and the executives did not respond to Reuters' requests seeking comment. \"The risk to cohesion and culture seems to be a key concern among the selection team. Going outside would only work if that leader could continue unifying the two sides,\" Constellation Research founder Ray Wang said. Tech veteran Chatterjee, aged 58 and better known as \"DC\", took the reins of LTIMindtree in November 2022, after the merger of Larsen \u0026 Toubro firms L\u0026T Infotech and Mindtree in the same month. His term at the company, in which the infra giant held a 68.6% stake as of December 2023, is due to end in late 2025. \"Nachiket (Deshpande), who is also the current CEO's protégé since his Cognizant days, has been the CEO-in-waiting for a while,\" one of the persons said. \"So, it is a question of when, not if, DC will hand over the reins to him.\" Deshpande and Chaturvedi are taking more calls and responsibilities these days than before, the person added. LTIMindtree's rivals have also seen changes at the top. Industry leader Tata Consultancy Services elevated insider K Krithivasan as CEO last year after Rajesh Gopinathan quit abruptly, while Infosys veteran Mohit Joshi took over as Tech Mahindra CEO in December 2023. Wipro CEO Thierry Delaporte's five-year term is set to end in July 2025, according to an exchange filing. Chatterjee's successor will face an uphill task of boosting the fortunes of a company, which is yet to fully benefit from the merger. \"Management highlighted that a weak macro environment played spoilsport to synergy realisation. We partly agree, but also believe that execution could have been better,\" Kotak Institutional Equities said in a post-earnings note last month. The C-suite changes could shake up the IT industry. \"Expect to see intensifying competition as each new head brings in new strategies for growth. The industry has been in a rut with growth slowing down and staying in the lower single digits for most (companies),\" Omdia Research's Hansa Iyengar said. She expects the new leaders to shuffle portfolios, renew focus on areas such as artificial intelligence and cloud, and double down on measures to improve efficiencies and margins. \"It will be good for the industry to have a shake-up of sorts,\" Iyengar, the principal analyst at the tech advisory firm, said. ","cleaned_content":"ltimindtree indias no 6 it services provider by revenue has identified two internal candidates for the top job as it is unlikely to extend ceo debashis chatterjees term that is set to end next year according to two persons familiar with the matter chief operating officer nachiket deshpande and president sudhir chaturvedi are the front runners for the role as the board prefers to have an insider at the helm of the company one of the persons said ltimindtree and the executives did not respond to reuters requests seeking comment the risk to cohesion and culture seems to be a key concern among the selection team going outside would only work if that leader could continue unifying the two sides constellation research founder ray wang said tech veteran chatterjee aged \u003cFIVE_TEN\u003e and better known as dc took the reins of ltimindtree in november \u003cTWO_THOUSAND\u003e after the merger of larsen toubro firms l t infotech and mindtree in the same month his term at the company in which the infra giant held a \u003cSIX_TEN_PERCENT\u003e stake as of december \u003cTWO_THOUSAND\u003e is due to end in late \u003cTWO_THOUSAND\u003e nachiket deshpande who is also the current ceos prot g since his cognizant days has been the ceo in waiting for a while one of the persons said so it is a question of when not if dc will hand over the reins to him deshpande and chaturvedi are taking more calls and responsibilities these days than before the person added ltimindtrees rivals have also seen changes at the top industry leader tata consultancy services elevated insider k krithivasan as ceo last year after rajesh gopinathan quit abruptly while infosys veteran mohit joshi took over as tech mahindra ceo in december \u003cTWO_THOUSAND\u003e wipro ceo thierry delaportes five year term is set to end in july \u003cTWO_THOUSAND\u003e according to an exchange filing chatterjees successor will face an uphill task of boosting the fortunes of a company which is yet to fully benefit from the merger management highlighted that a weak macro environment played spoilsport to synergy realisation we partly agree but also believe that execution could have been better kotak institutional equities said in a post earnings note last month the c suite changes could shake up the it industry expect to see intensifying competition as each new head brings in new strategies for growth the industry has been in a rut with growth slowing down and staying in the lower single digits for most companies omdia researchs hansa iyengar said she expects the new leaders to shuffle portfolios renew focus on areas such as artificial intelligence and cloud and double down on measures to improve efficiencies and margins it will be good for the industry to have a shake up of sorts iyengar the principal analyst at the tech advisory firm said","timestamp":"2024-02-13T12:58:00+05:30","market_timestamp":"2024-02-13T12:58:00+05:30","off_market_hours":false}