{"url":"https://www.moneycontrol.com/news/business/coal-india-to-add-new-mines-expand-existing-ones-to-meet-higher-demand-chairman-says-12267821.html","title":"Coal India to add new mines, expand existing ones to meet higher demand, chairman says","description":"India has increasingly relied on coal to address record power demand in recent months, with the rise in coal-fired power output outpacing renewable energy growth for the first time since at least 2019.Coal India to add new mines, expand existing ones to meet higher demand, chairman saysRelated stories","content":"State-run Coal India plans to start operations at five new mines and expand capacity of at least 16 existing ones to address growing demand for the fuel, its chairman told Reuters on Wednesday. India has increasingly relied on coal to address record power demand in recent months, with the rise in coal-fired power output outpacing renewable energy growth for the first time since at least 2019. A record output by Coal India - the world's largest coal miner whose profits and share price have surged since early 2023 - is set to boost inventories at power plants running on domestic coal by 16.1% year-over-year to 40 million metric tons by end-March, Coal India Chairman P.M. Prasad said in written response to questions. Coal India aims to boost output by more than 7% to a record 838 million tons for the next fiscal year that starts April 1, with initial stockpiles at 80 million tonnes, over 15% higher from a year earlier. The miner plans to start operations at five new mines, with a combined annual capacity of 14.3 million tons, in the next fiscal year, Prasad said. Coal India's revenue growth has outpaced an increase in costs in the recent years, but spending surged nearly 20% each in 2022 and 2023. Prasad expects higher outsourcing of mining and \"natural\" average annual attrition of 12,000-13,000 employees to help manage expenses. The company currently has over 220,000 people on its payrolls. The miner has awarded nine projects with annual capacity of 83 million tons to private companies, with another two projects capable of producing 32 million tons likely to be awarded before March-end, Prasad said. The company, which has been building solar and coal-fired power generating plants in efforts to diversify, is scouting for lithium assets in Australia, as India looks to secure access to minerals critical to the energy transition. \"We are participating in exploration of lithium assets in Australia that are currently under development stage, and potential long term assets,\" Prasad said, adding that preliminary talks with Australian companies are ongoing. He declined to give further details. Last year's decline in global coal prices from 2022's historic highs prompted Indian traders and users to increase imports of thermal coal, which rose 9.4% to 176.3 million tons in the year ended December 2023. Non-power users were avid buyers of imported coal, Prasad said. Meanwhile, lower seaborne coal prices have resulted in a decline in Coal India's margins on what are usually lucrative spot auction sales, though volumes offered through auctions rose nearly 80% to 73 million tons in the ten months ended January. The company is on track to auction about 20% of its output for the year that ends March, and will continue to offer between 10% and 20% of its production through auctions, said Prasad, a longtime insider who was promoted to chairman in July. ","cleaned_content":"state run coal india plans to start operations at five new mines and expand capacity of at least \u003cONE_TEN\u003e existing ones to address growing demand for the fuel its chairman told reuters on wednesday india has increasingly relied on coal to address record power demand in recent months with the rise in coal fired power output outpacing renewable energy growth for the first time since at least \u003cTWO_THOUSAND\u003e a record output by coal india the worlds largest coal miner whose profits and share price have surged since early \u003cTWO_THOUSAND\u003e is set to boost inventories at power plants running on domestic coal by \u003cONE_TEN_PERCENT\u003e year over year to \u003cFOUR_TEN\u003e million metric tons by end march coal india chairman p m prasad said in written response to questions coal india aims to boost output by more than \u003cSEVEN_PERCENT\u003e to a record \u003cEIGHT_HUNDRED\u003e million tons for the next fiscal year that starts april \u003cONE_\u003e with initial stockpiles at \u003cEIGHT_TEN\u003e million tonnes over \u003cONE_TEN_PERCENT\u003e higher from a year earlier the miner plans to start operations at five new mines with a combined annual capacity of \u003cONE_TEN\u003e million tons in the next fiscal year prasad said coal indias revenue growth has outpaced an increase in costs in the recent years but spending surged nearly \u003cTWO_TEN_PERCENT\u003e each in \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e prasad expects higher outsourcing of mining and natural average annual attrition of \u003cONE_TEN_THOUSAND\u003e \u003cONE_TEN_THOUSAND\u003e employees to help manage expenses the company currently has over \u003cTWO_HUNDRED_THOUSAND\u003e people on its payrolls the miner has awarded nine projects with annual capacity of \u003cEIGHT_TEN\u003e million tons to private companies with another two projects capable of producing \u003cTHREE_TEN\u003e million tons likely to be awarded before march end prasad said the company which has been building solar and coal fired power generating plants in efforts to diversify is scouting for lithium assets in australia as india looks to secure access to minerals critical to the energy transition we are participating in exploration of lithium assets in australia that are currently under development stage and potential long term assets prasad said adding that preliminary talks with australian companies are ongoing he declined to give further details last years decline in global coal prices from \u003cTWO_THOUSAND\u003e s historic highs prompted indian traders and users to increase imports of thermal coal which rose \u003cNINE_PERCENT\u003e to \u003cONE_HUNDRED\u003e million tons in the year ended december \u003cTWO_THOUSAND\u003e non power users were avid buyers of imported coal prasad said meanwhile lower seaborne coal prices have resulted in a decline in coal indias margins on what are usually lucrative spot auction sales though volumes offered through auctions rose nearly \u003cEIGHT_TEN_PERCENT\u003e to \u003cSEVEN_TEN\u003e million tons in the ten months ended january the company is on track to auction about \u003cTWO_TEN_PERCENT\u003e of its output for the year that ends march and will continue to offer between \u003cONE_TEN_PERCENT\u003e and \u003cTWO_TEN_PERCENT\u003e of its production through auctions said prasad a longtime insider who was promoted to chairman in july","timestamp":"2024-02-14T13:29:00+05:30","market_timestamp":"2024-02-14T13:29:00+05:30","off_market_hours":false}