{"url":"https://www.moneycontrol.com/news/business/sona-comstar-gets-certification-under-auto-pli-scheme-12337771.html","title":"Sona Comstar gets certification under auto PLI scheme","description":"The company had filed seven applications for different products under the PLI scheme, and it has received the certification for its first product, a hub wheel drive motor for electric two-wheelers, Sona Comstar said in a regulatory filing.Sona Comstar gets certification under auto PLI scheme","content":"Auto component maker Sona BLW Precision Forgings (Sona Comstar) on Thursday said the company has received certification under the auto Production Linked Incentive (PLI) scheme. The company had filed seven applications for different products under the PLI scheme, and it has received the certification for its first product, a hub wheel drive motor for electric two-wheelers, Sona Comstar said in a regulatory filing. The company is the first automotive component company to receive the certification, it added. In 2021, the government introduced the auto PLI scheme to incentivise the domestic production of high-value advanced automotive technology vehicles and products. The PLI scheme for the auto and auto component sector has a budgetary outlay of Rs 25,900 crore over five years, starting from FY24. ","cleaned_content":"auto component maker sona blw precision forgings sona comstar on thursday said the company has received certification under the auto production linked incentive pli scheme the company had filed seven applications for different products under the pli scheme and it has received the certification for its first product a hub wheel drive motor for electric two wheelers sona comstar said in a regulatory filing the company is the first automotive component company to receive the certification it added in \u003cTWO_THOUSAND\u003e the government introduced the auto pli scheme to incentivise the domestic production of high value advanced automotive technology vehicles and products the pli scheme for the auto and auto component sector has a budgetary outlay of rs \u003cTWO_TEN_THOUSAND\u003e crore over five years starting from fy24","timestamp":"2024-02-23T13:42:00+05:30","market_timestamp":"2024-02-23T13:42:00+05:30","off_market_hours":false}