{"url":"https://www.moneycontrol.com/news/business/odisha-cm-lays-foundation-stone-for-jsw-groups-rs-65000-crore-steel-facility-12290041.html","title":"Odisha CM lays foundation stone for JSW Group's Rs 65,000 crore steel facility","description":"The proposed project would have an annual steel manufacturing capacity of 13.2 million tonne (MT) with a captive power plant and captive jetties with cargo-handling capacity, JSW Steel said in a BSE filing.Odisha CM lays foundation stone for JSW Group's Rs 65,000 crore steel facilityRelated stories","content":"Odisha Chief Minister Naveen Patnaik on Friday laid the foundation stone for a steel project of JSW Group to be set up at an estimated investment of Rs 65,000 crore. The proposed project would have an annual steel manufacturing capacity of 13.2 million tonne (MT) with a captive power plant and captive jetties with cargo-handling capacity, JSW Steel said in a BSE filing. The complex at Dhinkia Nuagaon and Gadakujanga under Jagatsinghpur district will also have a cement manufacturing unit and modern township and other components, it said. \"The integrated steel project by JSW Steel is expected to drive economic growth in the region by fostering a robust ancillary and downstream ecosystem with employment potential of approximately 30,000 direct \u0026 indirect jobs,\" the company said. The Industrial Development Corporation of Odisha (IDCO) has handed over 2,958 acre of land to JSW for setting up the integrated manufacturing facility with 30 per cent of the total project land to be dedicated for preservation of forests and water bodies. On the investments, the filing said \"JSW Steel \u0026 JSW Group entities have envisaged an investment of approximately Rs 65,000 crore, subject to necessary approvals, in order to establish this integrated complex in a phased manner.\" JSW Steel is the flagship business of the diversified USD 23 billion JSW Group which also has interests in energy, infrastructure, cement, paints, sports, and venture capital. ","cleaned_content":"odisha chief minister naveen patnaik on friday laid the foundation stone for a steel project of jsw group to be set up at an estimated investment of rs \u003cSIX_TEN_THOUSAND\u003e crore the proposed project would have an annual steel manufacturing capacity of \u003cONE_TEN\u003e million tonne mt with a captive power plant and captive jetties with cargo handling capacity jsw steel said in a bse filing the complex at dhinkia nuagaon and gadakujanga under jagatsinghpur district will also have a cement manufacturing unit and modern township and other components it said the integrated steel project by jsw steel is expected to drive economic growth in the region by fostering a robust ancillary and downstream ecosystem with employment potential of approximately \u003cTHREE_TEN_THOUSAND\u003e direct indirect jobs the company said the industrial development corporation of odisha idco has handed over \u003cTWO_THOUSAND\u003e acre of land to jsw for setting up the integrated manufacturing facility with \u003cTHREE_TEN_PERCENT\u003e of the total project land to be dedicated for preservation of forests and water bodies on the investments the filing said jsw steel jsw group entities have envisaged an investment of approximately rs \u003cSIX_TEN_THOUSAND\u003e crore subject to necessary approvals in order to establish this integrated complex in a phased manner jsw steel is the flagship business of the diversified usd \u003cTWO_TEN\u003e billion jsw group which also has interests in energy infrastructure cement paints sports and venture capital","timestamp":"2024-02-16T14:55:00+05:30","market_timestamp":"2024-02-16T14:55:00+05:30","off_market_hours":false}