{"url":"https://www.moneycontrol.com/news/business/pure-ev-raises-8-million-in-latest-funding-round-12303111.html","title":"Pure EV raises $8 million in latest funding round","description":"The funding was led by Bennett Coleman and Company Ltd, Hindustan Times Media Ventures, alongside Ushodaya Enterprises Pvt Ltd, existing investors and high net-worth individuals, Pure EV said in a statement.Pure EV raises $8 million in latest funding round","content":"Electric two-wheeler firm Pure EV on Monday said it has raised USD 8 million (around Rs 66 crore) from a consortium of investors. The funding was led by Bennett Coleman and Company Ltd, Hindustan Times Media Ventures, alongside Ushodaya Enterprises Pvt Ltd, existing investors and high net-worth individuals, Pure EV said in a statement. The Hyderabad-based company said it is currently in the final stage of concluding its Series A1 funding round, amounting to USD 25 million with the participation of a foreign institutional investor. \"We will be rapidly expanding our pan-India sales network from 140 to 300 dealers in the next six months,\" Pure EV Co-Founder \u0026 CEO Rohit Vadera stated. The company sells a range of electric motorcycles and scooters and has already sold over 70,000 units. ","cleaned_content":"electric two wheeler firm pure ev on monday said it has raised usd \u003cEIGHT_\u003e million around rs \u003cSIX_TEN\u003e crore from a consortium of investors the funding was led by bennett coleman and company ltd hindustan times media ventures alongside ushodaya enterprises pvt ltd existing investors and high net worth individuals pure ev said in a statement the hyderabad based company said it is currently in the final stage of concluding its series a1 funding round amounting to usd \u003cTWO_TEN\u003e million with the participation of a foreign institutional investor we will be rapidly expanding our pan india sales network from \u003cONE_HUNDRED\u003e to \u003cTHREE_HUNDRED\u003e dealers in the next six months pure ev co founder ceo rohit vadera stated the company sells a range of electric motorcycles and scooters and has already sold over \u003cSEVEN_TEN_THOUSAND\u003e units","timestamp":"2024-02-19T13:15:00+05:30","market_timestamp":"2024-02-19T13:15:00+05:30","off_market_hours":false}