{"url":"https://www.moneycontrol.com/news/business/electric-bike-sharing-platform-yulu-bikes-raises-19-25-million-capital-in-equity-funding-12336201.html","title":"Electric bike-sharing platform Yulu Bikes raises $19.25-million capital in equity funding","description":"The capital infusion will enable Yulu to maintain its growth streak and will strengthen its market leadership as it expands its reach in terms of vehicles, operational locations, and product and technology innovation to keep up with the rise in demand from users, the company said in a statement.Electric bike-sharing platform Yulu Bikes raises $19.25-million capital in equity fundingRelated stories","content":"Electric bike-sharing platform Yulu Bikes on Friday said it has secured USD 19.25-million (Rs 160 crore) capital in equity funding through the issuance of shares to the company's existing strategic investors-- Magna and Bajaj Auto Ltd. The capital infusion will enable Yulu to maintain its growth streak and will strengthen its market leadership as it expands its reach in terms of vehicles, operational locations, and product and technology innovation to keep up with the rise in demand from users, the company said in a statement. On Thursday, Bajaj Auto said in a regulatory filing that it has raised its stake in Yulu Bike to 18.8 per cent of the paid-up equity share capital with an additional Rs 45.75 crore investment in the company. Yulu also said that it is on track to raise its Series C round of funding soon. The equity infusion will help the company fast-track its growth plans, said Amit Gupta, Co-founder \u0026and CEO of Yulu. \"Yulu has seen demand speeding up in the last couple of quarters. In particular, our shared EV services have transformed the urban delivery landscape by increasing the share of green deliveries while enabling livelihoods,\" he added. The company will continue to strengthen its leadership in the mobility-as-a-service (MaaS) segment by deepening existing business lines and opening up new use cases and geographies, Gupta added. \"Bajaj and Yulu enjoy a strategic partnership and our role extends to beyond being a financial investor. We see very good potential in the space of shared and last-mile mobility. Hence, together we continue to leverage our combined expertise in consumer knowledge, technology, and manufacturing to build a business in this space,\" said Rakesh Sharma, Executive Director at Bajaj Auto. Matteo Del Sorbo, Executive Vice President, Magna International and Global Lead of Magna New Mobility, said, Yulu's journey showcases the vital role played by green mobility solutions in the emerging markets context. Yulu currently runs 30,000 EVs across Bengaluru, Mumbai, Navi Mumbai, Delhi and Gurugram. ","cleaned_content":"electric bike sharing platform yulu bikes on friday said it has secured usd \u003cONE_TEN\u003e million rs \u003cONE_HUNDRED\u003e crore capital in equity funding through the issuance of shares to the companys existing strategic investors magna and bajaj auto ltd the capital infusion will enable yulu to maintain its growth streak and will strengthen its market leadership as it expands its reach in terms of vehicles operational locations and product and technology innovation to keep up with the rise in demand from users the company said in a statement on thursday bajaj auto said in a regulatory filing that it has raised its stake in yulu bike to \u003cONE_TEN_PERCENT\u003e of the paid up equity share capital with an additional rs \u003cFOUR_TEN\u003e crore investment in the company yulu also said that it is on track to raise its series c round of funding soon the equity infusion will help the company fast track its growth plans said amit gupta co founder and ceo of yulu yulu has seen demand speeding up in the last couple of quarters in particular our shared ev services have transformed the urban delivery landscape by increasing the share of green deliveries while enabling livelihoods he added the company will continue to strengthen its leadership in the mobility as a service maas segment by deepening existing business lines and opening up new use cases and geographies gupta added bajaj and yulu enjoy a strategic partnership and our role extends to beyond being a financial investor we see very good potential in the space of shared and last mile mobility hence together we continue to leverage our combined expertise in consumer knowledge technology and manufacturing to build a business in this space said rakesh sharma executive director at bajaj auto matteo del sorbo executive vice president magna international and global lead of magna new mobility said yulus journey showcases the vital role played by green mobility solutions in the emerging markets context yulu currently runs \u003cTHREE_TEN_THOUSAND\u003e evs across bengaluru mumbai navi mumbai delhi and gurugram","timestamp":"2024-02-23T10:27:00+05:30","market_timestamp":"2024-02-23T10:27:00+05:30","off_market_hours":false}