{"url":"https://www.moneycontrol.com/news/business/gqgs-adani-investment-reaches-10-billion-as-stocks-bounce-back-12338361.html","title":"GQG’s Adani investment reaches $10 billion as stocks bounce back","description":"The fund’s initial investment of $1.9 billion in March has ballooned to $10 billion in value, helped by market gains and additional stakes, according to fund manager Sudarshan Murthy.GQG’s Adani investment reaches $10 billion as stocks bounce backRelated stories","content":"The total value of GQG Partners LLC’s stake in Adani Group companies has grown about fivefold, as the stocks extend their recovery from short-seller Hindenburg Research’s scathing report. The fund’s initial investment of $1.9 billion in March has ballooned to $10 billion in value, helped by market gains and additional stakes, according to fund manager Sudarshan Murthy. This marks a big win for the contrarian bet by veteran Rajiv Jain’s firm after Hindenburg accused the Adani Group of stock-price manipulation and accounting fraud — charges that the conglomerate has repeatedly denied. The Gautam Adani-led group has recovered more than two-thirds of the market capitalization that it lost following the report, after it wooed investors and bankers. India’s top court has also rejected a high-level probe into Hindenburg’s allegations. “Adani Power is the country’s largest private thermal power producer,” and may double its capacity through 2029, Murthy said. Meanwhile, Adani Green Energy Ltd. has secured land “that gives them a clear runway where they can build in the next five years,” he added. The GQG Partners Emerging Markets Equity Fund has about $2.23 billion invested in seven Adani companies, of which $1.06 billion is in Adani’s energy and utility companies. ","cleaned_content":"the total value of gqg partners llc s stake in adani group companies has grown about fivefold as the stocks extend their recovery from short seller hindenburg research s scathing report the fund s initial investment of \u003cONE_\u003e billion in march has ballooned to \u003cONE_TEN\u003e billion in value helped by market gains and additional stakes according to fund manager sudarshan murthy this marks a big win for the contrarian bet by veteran rajiv jain s firm after hindenburg accused the adani group of stock price manipulation and accounting fraud charges that the conglomerate has repeatedly denied the gautam adani led group has recovered more than two thirds of the market capitalization that it lost following the report after it wooed investors and bankers india s top court has also rejected a high level probe into hindenburg s allegations adani power is the country s largest private thermal power producer and may double its capacity through \u003cTWO_THOUSAND\u003e murthy said meanwhile adani green energy ltd has secured land that gives them a clear runway where they can build in the next five years he added the gqg partners emerging markets equity fund has about \u003cTWO_\u003e billion invested in seven adani companies of which \u003cONE_\u003e billion is in adani s energy and utility companies","timestamp":"2024-02-23T15:04:00+05:30","market_timestamp":"2024-02-23T15:04:00+05:30","off_market_hours":false}