{"url":"https://www.moneycontrol.com/news/business/air-india-tata-advanced-systems-to-invest-rs-2300-crore-in-karnataka-12302971.html","title":"Air India \u0026 Tata Advanced Systems to invest Rs 2,300 crore in Karnataka","description":"Chief Minister Siddaramaiah and Large and Medium Industries Minister M B Patil were among those present at an MoU signing ceremony in this regard here.Air India, Tata Advanced Systems to invest $277 million in KarnatakaRelated stories","content":"Tata Group companies Air India and Tata Advanced Systems Limited (TASL) plan to invest Rs 2,300 crore in Karnataka for various projects providing employment to about 1,650 people, it was announced on Monday. Chief Minister Siddaramaiah and Large and Medium Industries Minister M B Patil were among those present at an MoU signing ceremony in this regard here. Air India is planning to set up a Maintenance Repair and Overhaul (MRO) facility and \"create\" Bengaluru as the aviation hub in South India, an official statement said. \"The investment for the project is around Rs 1,300 crore. This will ensure direct employment generation of 1,200 people,\" it said. TASL is planning to set up three projects with total investment of Rs 1,030 crore -- Passenger to Freighter Aircraft Conversion facility (Rs 420 crore), a gun manufacturing facility (Rs 310 crore) and Aerospace and Defence Research and Development in Karnataka (Rs 300 crore). These projects would generate direct employment for 450 people, it said. TASL's plans to source more than 50 per cent of its 13,000 parts from Karnataka for its gun manufacturing facility, which is estimated to provide employment to 2,000-3,000 people in 300-350 small and medium enterprises, it added. ","cleaned_content":"tata group companies air india and tata advanced systems limited tasl plan to invest rs \u003cTWO_THOUSAND\u003e crore in karnataka for various projects providing employment to about \u003cONE_THOUSAND\u003e people it was announced on monday chief minister siddaramaiah and large and medium industries minister m b patil were among those present at an mou signing ceremony in this regard here air india is planning to set up a maintenance repair and overhaul mro facility and create bengaluru as the aviation hub in south india an official statement said the investment for the project is around rs \u003cONE_THOUSAND\u003e crore this will ensure direct employment generation of \u003cONE_THOUSAND\u003e people it said tasl is planning to set up three projects with total investment of rs \u003cONE_THOUSAND\u003e crore passenger to freighter aircraft conversion facility rs \u003cFOUR_HUNDRED\u003e crore a gun manufacturing facility rs \u003cTHREE_HUNDRED\u003e crore and aerospace and defence research and development in karnataka rs \u003cTHREE_HUNDRED\u003e crore these projects would generate direct employment for \u003cFOUR_HUNDRED\u003e people it said tasls plans to source more than \u003cFIVE_TEN_PERCENT\u003e of its \u003cONE_TEN_THOUSAND\u003e parts from karnataka for its gun manufacturing facility which is estimated to provide employment to \u003cTWO_THOUSAND\u003e \u003cTHREE_THOUSAND\u003e people in \u003cTHREE_HUNDRED\u003e \u003cTHREE_HUNDRED\u003e small and medium enterprises it added","timestamp":"2024-02-19T13:19:00+05:30","market_timestamp":"2024-02-19T13:19:00+05:30","off_market_hours":false}