{"url":"https://www.moneycontrol.com/news/business/air-asia-to-start-thiruvananthapuram-kuala-lumpur-service-12301801.html","title":"Air Asia to start  Thiruvananthapuram-Kuala Lumpur service","description":"Air Asia Berhad will be operating the Thiruvananthapuram-Kuala Lumpur service with an Airbus 320 aircraft with a capacity of 180 passengers, it said.Air Asia to start  Thiruvananthapuram-Kuala Lumpur service","content":"Air Asia Berhad will be operating a direct flight from Thiruvananthapuram International Airport to Kuala Lumpur, the capital city of Malaysia, from February 21, an airport statement said. Air Asia Berhad will be operating the Thiruvananthapuram-Kuala Lumpur service with an Airbus 320 aircraft with a capacity of 180 passengers, it said. The flight, scheduled to arrive at 11.50 PM and depart at 12.25 AM, will be operated initially on Tuesdays, Thursdays, Saturdays and Sundays from Thiruvananthapuram. More connectivity to East Asian countries has been a demand for a long time, including by IT companies, the statement said, adding this service would boost the travel and tourism sectors of Kerala and south Tamil Nadu. ","cleaned_content":"air asia berhad will be operating a direct flight from thiruvananthapuram international airport to kuala lumpur the capital city of malaysia from february \u003cTWO_TEN\u003e an airport statement said air asia berhad will be operating the thiruvananthapuram kuala lumpur service with an airbus \u003cTHREE_HUNDRED\u003e aircraft with a capacity of \u003cONE_HUNDRED\u003e passengers it said the flight scheduled to arrive at \u003cONE_TEN\u003e pm and depart at \u003cONE_TEN\u003e am will be operated initially on tuesdays thursdays saturdays and sundays from thiruvananthapuram more connectivity to east asian countries has been a demand for a long time including by it companies the statement said adding this service would boost the travel and tourism sectors of kerala and south tamil nadu","timestamp":"2024-02-19T11:59:00+05:30","market_timestamp":"2024-02-19T11:59:00+05:30","off_market_hours":false}