{"url":"https://www.moneycontrol.com/news/business/expect-india-to-be-third-largest-market-among-118-countries-mercedes-benz-12405811.html","title":"Expect India to be third largest market among 118 countries: Mercedes-Benz","description":"The Region Overseas for Mercedes Benz comprises 118 countries, excluding North America, Europe and China.Expect India to be third largest market among 118 countries: Mercedes-BenzRelated stories","content":"German carmaker Mercedes-Benz expects India to become its third biggest market in its 'Region Overseas' over the next 2-3 years with demand anticipated to remain strong for luxury products, according to a senior company executive. The Region Overseas for Mercedes Benz comprises 118 countries, excluding North America, Europe and China. India is the fifth largest market in the region after Japan, South Korea, Australia and Turkey. \"Our Region Overseas markets which encompass 118 markets across the world and India happens to be market number five for us. So you can imagine the relevance and importance it serves not only today, but also for the future of the Mercedes Benz brand,\" Mercedes-Benz AG Head of Region Overseas, Sagree Sardien told reporters here. When asked about the expected timeframe to achieve the target, she stated, \"We are convinced that with the way the Indian market is developing, we should see this happening in the next two to three years.\" Terming India a strategic market for the brand, Sardien noted that the company has seen sales of its high-end models grow in double digits for the last couple of years and expects the same to continue this year and beyond. She noted that the company will add 12 new models, including three battery electric vehicles, in the market this year. The company also plans to tap smaller cities as it looks to establish sales outlets in 10 new locations ranging from Jammu to Kottayam to scale operations, Sardien stated. Mercedes-Benz India reported its highest ever sales of 17,408 units in 2023. Sardien said the electrification journey in India is picking up slowly for Mercedes-Benz with 4 per cent of total sales in the country coming from EVs. \"I completely believe that we will see a double-digit (growth) in electrification for our product range within this market,\" she said. \"Customers' preferences are obviously at a much slower pace than the demand we expected,\" she said adding the company would go according to the transformation of customers. Sardien noted that the company will not change its strategic direction. \"It is clear that the future is electric for us, but we ensure that we cater for our customers' changing preferences and where market conditions are actually allowing,\" she said. When asked about the potential of the overall luxury car market in India, Sardien said it can touch 1 lakh unit mark probably by the end of this decade. \"But I think there are some fundamental things that need to happen in the market and it is highly dependent on how customers transition here between the combustion engine and the battery electric vehicle architecture,\" she added. The luxury car market in India is around 47,000 units per annum and remains a miniscule part of the overall passenger vehicle segment which crossed the 41 lakh units mark last year. ","cleaned_content":"german carmaker mercedes benz expects india to become its third biggest market in its region overseas over the next \u003cTWO_\u003e \u003cTHREE_\u003e years with demand anticipated to remain strong for luxury products according to a senior company executive the region overseas for mercedes benz comprises \u003cONE_HUNDRED\u003e countries excluding north america europe and china india is the fifth largest market in the region after japan south korea australia and turkey our region overseas markets which encompass \u003cONE_HUNDRED\u003e markets across the world and india happens to be market number five for us so you can imagine the relevance and importance it serves not only today but also for the future of the mercedes benz brand mercedes benz ag head of region overseas sagree sardien told reporters here when asked about the expected timeframe to achieve the target she stated we are convinced that with the way the indian market is developing we should see this happening in the next two to three years terming india a strategic market for the brand sardien noted that the company has seen sales of its high end models grow in double digits for the last couple of years and expects the same to continue this year and beyond she noted that the company will add \u003cONE_TEN\u003e new models including three battery electric vehicles in the market this year the company also plans to tap smaller cities as it looks to establish sales outlets in \u003cONE_TEN\u003e new locations ranging from jammu to kottayam to scale operations sardien stated mercedes benz india reported its highest ever sales of \u003cONE_TEN_THOUSAND\u003e units in \u003cTWO_THOUSAND\u003e sardien said the electrification journey in india is picking up slowly for mercedes benz with \u003cFOUR_PERCENT\u003e of total sales in the country coming from evs i completely believe that we will see a double digit growth in electrification for our product range within this market she said customers preferences are obviously at a much slower pace than the demand we expected she said adding the company would go according to the transformation of customers sardien noted that the company will not change its strategic direction it is clear that the future is electric for us but we ensure that we cater for our customers changing preferences and where market conditions are actually allowing she said when asked about the potential of the overall luxury car market in india sardien said it can touch \u003cONE_\u003e lakh unit mark probably by the end of this decade but i think there are some fundamental things that need to happen in the market and it is highly dependent on how customers transition here between the combustion engine and the battery electric vehicle architecture she added the luxury car market in india is around \u003cFOUR_TEN_THOUSAND\u003e units per annum and remains a miniscule part of the overall passenger vehicle segment which crossed the \u003cFOUR_TEN\u003e lakh units mark last year","timestamp":"2024-03-05T14:51:00+05:30","market_timestamp":"2024-03-05T14:51:00+05:30","off_market_hours":false}