{"url":"https://www.moneycontrol.com/news/business/adani-dollar-bonds-see-robust-demand-signals-comeback-to-global-market-12404081.html","title":"Adani dollar bonds see robust demand; signals comeback to global market","description":"Adani Green Energy priced a $409 million 18-year bond after receiving nearly $3 billion of demand for it, said the sources, who have direct knowledge of the deal.Adani dollar bonds see robust demand; signals comeback to global marketRelated stories","content":"Adani group saw massive demand on Monday for its first dollar bond since a short-seller attack last year, in what two banking sources said was being seen internally as a test for the conglomerate's access to global capital markets. Adani Green Energy priced a $409 million 18-year bond after receiving nearly $3 billion of demand for it, said the sources, who have direct knowledge of the deal. The issuer received bids from 163 investors, of which, 45% were from Asia, 24% from the United States, 21% from Europe and the rest from the Middle East, a company source told Reuters on Tuesday, requesting anonymity as they were not authorized to speak to the media. The final coupon pricing was sharply below the fair value seen by CreditSights at 7.45% and also lower than Nomura's 6.8250%. Analysts at CreditSights had noted that the bonds were likely to generate strong demand given the lack of high-yield paper in the Asian U.S. dollar bond market and the enthusiasm for Indian renewable infrastructure credit. Nomura did not factor in any new issuer premium on Adani Green's bond issue considering the muted supply of Asian high yield bonds and the stronger than expected bond performance of the latest bond offering by IRB Infrastructure Developers, it said in a note. Other operating companies in the group could follow with bond issues after seeing robust demand, the first source said. Adani Energy Solutions is planning to raise around $400 million-$500 million through a private placement of bonds for which it is in early talks with U.S. institutional investors, Reuters reported last week. The board of Adani Green Energy has approved the above-mentioned pricing, tenure and the other terms of the bond issue, it informed Indian exchanges on Tuesday. Adani group company stocks and bonds saw a massive selloff early last year after U.S. short seller Hindenburg Research issued a report that alleged improper governance practices, stock manipulation and use of tax havens by the Adani Group. The group has denied these allegations. In the aftermath of the selloff Adani executives and advisers launched a charm offensive with investors globally, according to the bankers. The proceeds from the bond issue will be used by the company to repay $500 million of senior unsecured notes that mature in June. The bonds are rated 'Ba1' by Moody's Investor Service and 'BBB-' by Fitch Ratings. ","cleaned_content":"adani group saw massive demand on monday for its first dollar bond since a short seller attack last year in what two banking sources said was being seen internally as a test for the conglomerates access to global capital markets adani green energy priced a \u003cFOUR_HUNDRED\u003e million \u003cONE_TEN\u003e year bond after receiving nearly \u003cTHREE_\u003e billion of demand for it said the sources who have direct knowledge of the deal the issuer received bids from \u003cONE_HUNDRED\u003e investors of which \u003cFOUR_TEN_PERCENT\u003e were from asia \u003cTWO_TEN_PERCENT\u003e from the united states \u003cTWO_TEN_PERCENT\u003e from europe and the rest from the middle east a company source told reuters on tuesday requesting anonymity as they were not authorized to speak to the media the final coupon pricing was sharply below the fair value seen by creditsights at \u003cSEVEN_PERCENT\u003e and also lower than nomuras \u003cSIX_PERCENT\u003e analysts at creditsights had noted that the bonds were likely to generate strong demand given the lack of high yield paper in the asian u s dollar bond market and the enthusiasm for indian renewable infrastructure credit nomura did not factor in any new issuer premium on adani greens bond issue considering the muted supply of asian high yield bonds and the stronger than expected bond performance of the latest bond offering by irb infrastructure developers it said in a note other operating companies in the group could follow with bond issues after seeing robust demand the first source said adani energy solutions is planning to raise around \u003cFOUR_HUNDRED\u003e million \u003cFIVE_HUNDRED\u003e million through a private placement of bonds for which it is in early talks with u s institutional investors reuters reported last week the board of adani green energy has approved the above mentioned pricing tenure and the other terms of the bond issue it informed indian exchanges on tuesday adani group company stocks and bonds saw a massive selloff early last year after u s short seller hindenburg research issued a report that alleged improper governance practices stock manipulation and use of tax havens by the adani group the group has denied these allegations in the aftermath of the selloff adani executives and advisers launched a charm offensive with investors globally according to the bankers the proceeds from the bond issue will be used by the company to repay \u003cFIVE_HUNDRED\u003e million of senior unsecured notes that mature in june the bonds are rated ba1 by moodys investor service and bbb by fitch ratings","timestamp":"2024-03-05T12:10:00+05:30","market_timestamp":"2024-03-05T12:10:00+05:30","off_market_hours":false}