{"url":"https://www.moneycontrol.com/news/business/nclt-approves-hinduja-group-firm-indusind-international-holdings-resolution-plan-for-reliance-capital-12359171.html","title":"NCLT approves Hinduja Group firm IndusInd International Holdings' resolution plan for Reliance Capital","description":"The Mumbai bench of the NCLT approved the plan submitted by IIHL (IndusInd International Holdings Limited) in June 2023 in the second round of bidding for the debt-laden company.NCLT approves Hinduja Group firm IndusInd International Holdings' resolution plan for Reliance Capital","content":"The National Company Law Tribunal on Tuesday approved Hinduja Group firm IndusInd International Holdings' Rs 9,650-crore resolution plan for Reliance Capital. The Mumbai bench of the NCLT approved the plan submitted by IIHL (IndusInd International Holdings Limited) in June 2023 in the second round of bidding for the debt-laden company. A detailed order in the matter is expected later in the day. Reliance Capital had a debt of over Rs 40,000 crore, and four applicants had initially bid with resolution plans. However, the committee of creditors rejected all the four plans for lower bid values and a challenge mechanism was initiated where IIHL and Torrent Investments participated. In June 2023, the Hinduja Group firm was selected by the committee for its bid of Rs 9,661 crore upfront cash. Reliance Capital's cash balance of an additional Rs 500 crore would also go to the lenders. ","cleaned_content":"the national company law tribunal on tuesday approved hinduja group firm indusind international holdings rs \u003cNINE_THOUSAND\u003e crore resolution plan for reliance capital the mumbai bench of the nclt approved the plan submitted by iihl indusind international holdings limited in june \u003cTWO_THOUSAND\u003e in the second round of bidding for the debt laden company a detailed order in the matter is expected later in the day reliance capital had a debt of over rs \u003cFOUR_TEN_THOUSAND\u003e crore and four applicants had initially bid with resolution plans however the committee of creditors rejected all the four plans for lower bid values and a challenge mechanism was initiated where iihl and torrent investments participated in june \u003cTWO_THOUSAND\u003e the hinduja group firm was selected by the committee for its bid of rs \u003cNINE_THOUSAND\u003e crore upfront cash reliance capitals cash balance of an additional rs \u003cFIVE_HUNDRED\u003e crore would also go to the lenders","timestamp":"2024-02-27T11:27:00+05:30","market_timestamp":"2024-02-27T11:27:00+05:30","off_market_hours":false}