{"url":"https://www.moneycontrol.com/news/world/australias-january-inflation-holds-at-two-year-low-eyes-on-february-release-12367331.html","title":"Australia's January inflation holds at two-year low, eyes on February release","description":"Attention is set to quickly turn to February's release for clues on the direction of next steps by the Reserve Bank of Australia as the second month in a quarter will contain more data on inflation in the services sector, which has been declining at a slower pace than for goods.Australia's January inflation holds at two-year low, eyes on February releaseRelated stories","content":"Australian consumer price inflation held at a two-year low in January despite forecasts for an uptick, reinforcing expectations that interest rates are unlikely to increase further. Attention is set to quickly turn to February's release for clues on the direction of next steps by the Reserve Bank of Australia as the second month in a quarter will contain more data on inflation in the services sector, which has been declining at a slower pace than for goods. Across the Tasman, New Zealand held rates steady at 5.5%. In a dovish shift, the Reserve Bank of New Zealand lowered its projections for the future cash rate to peak at 5.6% from 5.7%, adding to signs that it too is likely done tightening. A closely watched measure of core inflation, the trimmed mean, rose an annual 3.8%, down from 4.0% in December. Inflation excluding volatile items and holiday travel slowed to 4.1% from 4.2%. \"I think we want to be careful about reading too much into one month's figure, but there is nothing in here that won't be good news for the RBA,\" said Jonathan Kearns, chief economist at Challenger. \"The question really is going to be what's happening with services inflation,\" he added. February's figures will capture more price changes for a range of services from hair cuts to dining out. The Australian dollar reacted little to the data and was last 0.1% lower at $0.6538. Three-year bond futures held at 96.24. For January alone, CPI fell 0.3% from the previous month, driven by declines in holiday travel, clothes and garments and petrol. Holiday travel slumped 5.2% from a month earlier. Rents grew 7.4% in January from a year earlier, unchanged from December, a sign that rent inflation likely has peaked, while electricity prices rose a modest 0.8%, helped by the government's relief policy. \"The January data suggest that price pressures are likely to abate more rapidly than the RBA is expecting,\" said Marcel Thieliant, Capital Economics' Head of Asia Pacific, adding that he is confident with his call for a first rate cut in August. \"Barring any unforeseen shocks, it seems increasingly likely that the CPI data will undershoot both of the bank's projections.\" The Reserve Bank of Australia has raised interest rates by 425 basis points since May 2022 to a 12-year top of 4.35%, and has not ruled out the risk of another hike if necessary to bring inflation back to the bank's target band of 2-3%. Financial markets are confident the RBA is done tightening. Swaps imply about a 60% chance of a first rate cut in August and a total easing of 38 basis points by the end of the year, little changed from before. ","cleaned_content":"australian consumer price inflation held at a two year low in january despite forecasts for an uptick reinforcing expectations that interest rates are unlikely to increase further attention is set to quickly turn to februarys release for clues on the direction of next steps by the reserve bank of australia as the second month in a quarter will contain more data on inflation in the services sector which has been declining at a slower pace than for goods across the tasman new zealand held rates steady at \u003cFIVE_PERCENT\u003e in a dovish shift the reserve bank of new zealand lowered its projections for the future cash rate to peak at \u003cFIVE_PERCENT\u003e from \u003cFIVE_PERCENT\u003e adding to signs that it too is likely done tightening a closely watched measure of core inflation the trimmed mean rose an annual \u003cTHREE_PERCENT\u003e down from \u003cFOUR_PERCENT\u003e in december inflation excluding volatile items and holiday travel slowed to \u003cFOUR_PERCENT\u003e from \u003cFOUR_PERCENT\u003e i think we want to be careful about reading too much into one months figure but there is nothing in here that wont be good news for the rba said jonathan kearns chief economist at challenger the question really is going to be whats happening with services inflation he added februarys figures will capture more price changes for a range of services from hair cuts to dining out the australian dollar reacted little to the data and was last \u003cZERO_PERCENT\u003e lower at \u003cZERO_\u003e three year bond futures held at \u003cNINE_TEN\u003e for january alone cpi fell \u003cZERO_PERCENT\u003e from the previous month driven by declines in holiday travel clothes and garments and petrol holiday travel slumped \u003cFIVE_PERCENT\u003e from a month earlier rents grew \u003cSEVEN_PERCENT\u003e in january from a year earlier unchanged from december a sign that rent inflation likely has peaked while electricity prices rose a modest \u003cZERO_PERCENT\u003e helped by the governments relief policy the january data suggest that price pressures are likely to abate more rapidly than the rba is expecting said marcel thieliant capital economics head of asia pacific adding that he is confident with his call for a first rate cut in august barring any unforeseen shocks it seems increasingly likely that the cpi data will undershoot both of the banks projections the reserve bank of australia has raised interest rates by \u003cFOUR_HUNDRED\u003e basis points since may \u003cTWO_THOUSAND\u003e to a \u003cONE_TEN\u003e year top of \u003cFOUR_PERCENT\u003e and has not ruled out the risk of another hike if necessary to bring inflation back to the banks target band of \u003cTWO_\u003e \u003cTHREE_PERCENT\u003e financial markets are confident the rba is done tightening swaps imply about a \u003cSIX_TEN_PERCENT\u003e chance of a first rate cut in august and a total easing of \u003cTHREE_TEN\u003e basis points by the end of the year little changed from before","timestamp":"2024-02-28T09:49:00+05:30","market_timestamp":"2024-02-28T09:49:00+05:30","off_market_hours":false}