{"url":"https://www.moneycontrol.com/news/business/godrej-boyce-to-increase-focus-on-smaller-cities-invest-rs-40-crore-in-3-years-on-distribution-12392351.html","title":"Godrej \u0026 Boyce to increase focus on smaller cities, invest Rs 40 crore in 3 years on distribution","description":"The fresh investments by the company, which sells interior solutions, furniture, appliances and locks, will see its footprint getting doubled to more than 400 towns by FY27, a senior official has said.Godrej \u0026 Boyce to increase focus on smaller cities, invest Rs 40 crore in 3 years on distributionRelated stories","content":"Godrej \u0026 Boyce is aiming to invest about Rs 40 crore over the next three years to expand its distribution footprint for its consumer brands in the tier-II and tier-III cities. The fresh investments by the company, which sells interior solutions, furniture, appliances and locks, will see its footprint getting doubled to more than 400 towns by FY27, a senior official has said. \"G\u0026B plans to spend around Rs 10-15 crore every year on store expansion and renovation for the next three years,\" a company spokesperson told PTI. When asked if the expansion activities will be franchisee-driven, the spokesperson said the store expansion will be both \"company and channel-driven\". As per the company website, it had revenues of Rs 14,796 crore in FY23 and was present in over ten industries, including delivering engineering solutions, manufacturing consumer appliances, furniture, locks and security solutions. \"Our vision extends beyond mere expansion. We are committed to crafting market-specific product portfolios aligned with region-specific consumer needs,\" its executive director and chief executive Anil G Verma said. The strategies to be pursued include augmenting retail presence, customsied product innovation, and building a robust and sustainable supply chain to harness the market potential. ","cleaned_content":"godrej boyce is aiming to invest about rs \u003cFOUR_TEN\u003e crore over the next three years to expand its distribution footprint for its consumer brands in the tier ii and tier iii cities the fresh investments by the company which sells interior solutions furniture appliances and locks will see its footprint getting doubled to more than \u003cFOUR_HUNDRED\u003e towns by fy27 a senior official has said g b plans to spend around rs \u003cONE_TEN\u003e \u003cONE_TEN\u003e crore every year on store expansion and renovation for the next three years a company spokesperson told pti when asked if the expansion activities will be franchisee driven the spokesperson said the store expansion will be both company and channel driven as per the company website it had revenues of rs \u003cONE_TEN_THOUSAND\u003e crore in fy23 and was present in over ten industries including delivering engineering solutions manufacturing consumer appliances furniture locks and security solutions our vision extends beyond mere expansion we are committed to crafting market specific product portfolios aligned with region specific consumer needs its executive director and chief executive anil g verma said the strategies to be pursued include augmenting retail presence customsied product innovation and building a robust and sustainable supply chain to harness the market potential","timestamp":"2024-03-03T13:41:00+05:30","market_timestamp":"2024-03-04T09:15:00+05:30","off_market_hours":true}