{"url":"https://www.moneycontrol.com/news/business/suzlon-bags-72-45-mw-wind-power-project-from-juniper-green-energy-12418421.html","title":"Suzlon bags 72.45 MW wind power project from Juniper Green Energy","description":"As part of the project, Suzlon will install 23 Wind Turbine Generators (WTGs) with a Hybrid Lattice Tubular (HLT) tower and a rated capacity of 3.15 Megawatt (MW) each at the client's site at the Dwarka district in Gujarat, a company statement said.Suzlon bags 72.45 MW wind power project from Juniper Green Energy","content":"Renewable energy solutions provider Suzlon Group on Thursday said it has secured a 72.45 MW wind power project from Juniper Green Energy Pvt Ltd. As part of the project, Suzlon will install 23 Wind Turbine Generators (WTGs) with a Hybrid Lattice Tubular (HLT) tower and a rated capacity of 3.15 Megawatt (MW) each at the client's site at the Dwarka district in Gujarat, a company statement said. The company will supply the wind turbines (equipment supply) and execute the project with a scope of supply, supervision, and commissioning. Additionally, Suzlon will undertake post-commissioning operation and maintenance services, according to the statement. JP Chalasani, Chief Executive Officer, Suzlon Group, said, \"we are delighted to announce our third order with Juniper Green Energy Private Limited in just a few months.\" A project of this size can provide electricity to 59,000 households and curb 2.35 lakh tonnes of CO2 emissions per year. ","cleaned_content":"renewable energy solutions provider suzlon group on thursday said it has secured a \u003cSEVEN_TEN\u003e mw wind power project from juniper green energy pvt ltd as part of the project suzlon will install \u003cTWO_TEN\u003e wind turbine generators wtgs with a hybrid lattice tubular hlt tower and a rated capacity of \u003cTHREE_\u003e megawatt mw each at the clients site at the dwarka district in gujarat a company statement said the company will supply the wind turbines equipment supply and execute the project with a scope of supply supervision and commissioning additionally suzlon will undertake post commissioning operation and maintenance services according to the statement jp chalasani chief executive officer suzlon group said we are delighted to announce our third order with juniper green energy private limited in just a few months a project of this size can provide electricity to \u003cFIVE_TEN_THOUSAND\u003e households and curb \u003cTWO_\u003e lakh tonnes of co2 emissions per year","timestamp":"2024-03-07T12:15:00+05:30","market_timestamp":"2024-03-07T12:15:00+05:30","off_market_hours":false}