{"url":"https://www.moneycontrol.com/news/business/sri-lankas-elephant-house-ties-up-with-reliance-consumer-to-sell-beverages-in-india-12370641.html","title":"Sri Lanka's Elephant House ties up with Reliance Consumer to sell beverages in India","description":"Reliance Consumer has a sizeable beverage portfolio, which includes brands such as Campa, Sosyo and Raskik.Elephant House, owned by Ceylon Cold Stores PLC, is a subsidiary of John Keells Holdings PLC, Sri Lanka’s largest listed conglomerate.","content":"Sri Lankan beverage brand Elephant House has tied up with Reliance Consumer Products, the FMCG arm of Reliance Retail Ventures, to manufacture, market, distribute and sell its beverages across India. Reliance Consumer already has a sizeable beverage portfolio, which includes brands such as Campa, Sosyo and Raskik. Elephant House, owned by Ceylon Cold Stores PLC, is a subsidiary of John Keells Holdings PLC, Sri Lanka’s largest listed conglomerate. The company manufactures and sells a wide range of beverages including Necto, Cream Soda, EGB (Ginger Beer), Orange Barley and Lemonade to name a few. The partnership marks a \"significant milestone in the journey of our heritage brand and represents our commitment to delivering our high-quality beverages to new consumer segments\", said Krishan Balendra, Chairperson of the John Keells Group. Disclaimer: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary.  ","cleaned_content":"sri lankan beverage brand elephant house has tied up with reliance consumer products the fmcg arm of reliance retail ventures to manufacture market distribute and sell its beverages across india reliance consumer already has a sizeable beverage portfolio which includes brands such as campa sosyo and raskik elephant house owned by ceylon cold stores plc is a subsidiary of john keells holdings plc sri lanka s largest listed conglomerate the company manufactures and sells a wide range of beverages including necto cream soda egb ginger beer orange barley and lemonade to name a few the partnership marks a significant milestone in the journey of our heritage brand and represents our commitment to delivering our high quality beverages to new consumer segments said krishan balendra chairperson of the john keells group disclaimer moneycontrol is a part of the network18 group network18 is controlled by independent media trust of which reliance industries is the sole beneficiary","timestamp":"2024-02-28T16:17:00+05:30","market_timestamp":"2024-02-29T09:15:00+05:30","off_market_hours":true}