{"url":"https://www.moneycontrol.com/news/business/tata-sons-may-be-valued-at-up-to-96-billion-in-ipo-spark-12405601.html","title":"Tata Sons may be valued at up to $96 billion in IPO: Spark","description":"The listing of Tata Sons would give a boost to India’s IPO market, which has seen a slew of companies looking to sell shares as valuations boom. Tata Sons may be valued at up to $96 billion in IPO: Spark Related stories","content":"Tata Sons Ltd. may fetch a valuation of as much as 8 trillion rupees ($96 billion) in an initial public offering that could potentially take place within the next 18 months, according to Mumbai-based investment banking firm Spark PWM Pvt. The Indian conglomerate — which owns stakes in software major Tata Consultancy Services Ltd. and Jaguar Land Rover maker Tata Motors Ltd. — was classified as an “upper-layer” non-banking financial company by the central bank in September 2022. The category, among other requirements, mandates that such firms seek a public listing within a period of three years. “There are multiple levers of value available from the unlisted investments as the group is entering into new age segments such as semi-conductors” and EV batteries, which could deliver significantly higher value over time, analyst Vidit Shah wrote in a note dated March 4. The listing of Tata Sons would give a boost to India’s IPO market, which has seen a slew of companies looking to sell shares as valuations boom. Listings in the South Asian country has been active, with debuts more than doubling to 56 since the start of 2024 compared to the same period last year. The market value of Tata Sons’ listed investments is estimated at 16 trillion rupees, while its privately-held stakes are projected to be worth about 1-2 trillion rupees, Shah said. Investors may bake in a discount of 30-60% for the holding company, he added. Based on a peak valuation of $96 billion, even a 5% stake in the company would still be worth more than Life Insurance Corp of India’s $2.7 billion IPO in 2022. An IPO may also “lead to the simplification of the complicated group holding structure of the Tata Group,” and may see some of the listed firms liquidate their holdings within the salt-to-software conglomerate, according to Shah. “We believe that ~80% of Tata Sons’ holdings might not be monetizable but the process of restructuring could trigger a re-rating,” Shah said. ","cleaned_content":"tata sons ltd may fetch a valuation of as much as \u003cEIGHT_\u003e trillion rupees \u003cNINE_TEN\u003e billion in an initial public offering that could potentially take place within the next \u003cONE_TEN\u003e months according to mumbai based investment banking firm spark pwm pvt the indian conglomerate which owns stakes in software major tata consultancy services ltd and jaguar land rover maker tata motors ltd was classified as an upper layer non banking financial company by the central bank in september \u003cTWO_THOUSAND\u003e the category among other requirements mandates that such firms seek a public listing within a period of three years there are multiple levers of value available from the unlisted investments as the group is entering into new age segments such as semi conductors and ev batteries which could deliver significantly higher value over time analyst vidit shah wrote in a note dated march \u003cFOUR_\u003e the listing of tata sons would give a boost to india s ipo market which has seen a slew of companies looking to sell shares as valuations boom listings in the south asian country has been active with debuts more than doubling to \u003cFIVE_TEN\u003e since the start of \u003cTWO_THOUSAND\u003e compared to the same period last year the market value of tata sons listed investments is estimated at \u003cONE_TEN\u003e trillion rupees while its privately held stakes are projected to be worth about \u003cONE_\u003e \u003cTWO_\u003e trillion rupees shah said investors may bake in a discount of \u003cTHREE_TEN\u003e \u003cSIX_TEN_PERCENT\u003e for the holding company he added based on a peak valuation of \u003cNINE_TEN\u003e billion even a \u003cFIVE_PERCENT\u003e stake in the company would still be worth more than life insurance corp of india s \u003cTWO_\u003e billion ipo in \u003cTWO_THOUSAND\u003e an ipo may also lead to the simplification of the complicated group holding structure of the tata group and may see some of the listed firms liquidate their holdings within the salt to software conglomerate according to shah we believe that \u003cEIGHT_TEN_PERCENT\u003e of tata sons holdings might not be monetizable but the process of restructuring could trigger a re rating shah said","timestamp":"2024-03-05T14:31:00+05:30","market_timestamp":"2024-03-05T14:31:00+05:30","off_market_hours":false}