{"url":"https://www.moneycontrol.com/news/business/air-india-express-looking-to-operate-40-more-flights-next-fiscal-12370691.html","title":"Air India Express looking to operate 40% more flights next fiscal","description":"At the same time, the airline will focus more on consolidating on the domestic routes and will not be adding many destinations, while the international network may see some marginal increase, said the sources aware of the developments.Air India Express looking to operate 40% more flights next fiscal","content":"Low-cost carrier Air India Express is looking to operate 40 per cent more flights next fiscal on the back of fleet expansion, sources said on Wednesday. At the same time, the airline will focus more on consolidating on the domestic routes and will not be adding many destinations, while the international network may see some marginal increase, said the sources aware of the developments. Air India Express currently operates 350 daily flights and has a fleet of 69 planes. Express will commence flights to Nepal, Bangladesh and Sri Lanka during the forthcoming summer schedule, as per the sources. They also said that Air India Express will complete acquisition of its 50 white tail Boeing 737 Max plane order by December this year, of which it has already inducted 13-14 planes so far. Sources also say that the airline is expected to complete the merger of AirAsia India with it by the second quarter if the next fiscal. Air India Express is expecting all of AirAsia India's fleet to come on its air operator permit by July-August this year when the impending merger gets completed. As of now it has three A320neo planes of Airasia India fleet on its air operator permit. ","cleaned_content":"low cost carrier air india express is looking to operate \u003cFOUR_TEN_PERCENT\u003e more flights next fiscal on the back of fleet expansion sources said on wednesday at the same time the airline will focus more on consolidating on the domestic routes and will not be adding many destinations while the international network may see some marginal increase said the sources aware of the developments air india express currently operates \u003cTHREE_HUNDRED\u003e daily flights and has a fleet of \u003cSIX_TEN\u003e planes express will commence flights to nepal bangladesh and sri lanka during the forthcoming summer schedule as per the sources they also said that air india express will complete acquisition of its \u003cFIVE_TEN\u003e white tail boeing \u003cSEVEN_HUNDRED\u003e max plane order by december this year of which it has already inducted \u003cONE_TEN\u003e \u003cONE_TEN\u003e planes so far sources also say that the airline is expected to complete the merger of airasia india with it by the second quarter if the next fiscal air india express is expecting all of airasia indias fleet to come on its air operator permit by july august this year when the impending merger gets completed as of now it has three a320neo planes of airasia india fleet on its air operator permit","timestamp":"2024-02-28T15:01:00+05:30","market_timestamp":"2024-02-28T15:01:00+05:30","off_market_hours":false}