{"url":"https://www.moneycontrol.com/news/business/a-50-billion-india-pension-fund-may-turn-to-corporate-bonds-12405041.html","title":"A $50 billion India pension fund may turn to corporate bonds","description":"Demand for longer-tenor papers has risen due to increased purchases by pension funds and insurers. A $50 billion India pension fund may turn to corporate bondsRelated stories","content":"The narrowing spreads on longer-maturity Indian government bonds may prompt SBI Pension Funds Pvt. to look for opportunities in corporate and state debt, according to its chief investment officer. “We expect some term premium for the longer-dated securities and if that spread is not available, it would impact the accruals for my subscribers,” Sandeep Pandey, who manages 4.2 trillion rupees ($50 billion) in assets, said in an interview. “I’ll probably have to evaluate other avenues, including state debt or corporate bonds.” Demand for longer-tenor papers has risen due to increased purchases by pension funds and insurers. This has compressed the spread between the 10-year and 30-year bonds to six basis points from more than 100 basis points in May 2020, diminishing the incentive for investors seeking higher yields for holding debt for longer. The yields on benchmark 10-year bond has declined by more than 30 basis points since October to 7.06% on Tuesday, as global funds added to their holdings of index-eligible bonds ahead of the nation’s upcoming inclusion in global bond indexes. In comparison, the yields on top-rated similar-maturity corporate bond stands at 7.54%. The tight liquidity situation in the banking system is also helping widen spreads on the corporate bond portfolio, while the fund doesn’t have much presence on the shorter-end in the government bond curve, Pandey said. Pension funds, insurance companies and provident funds typically see around 15% to 20% incremental flows, while the net supply of sovereign paper hasn’t changed for the coming fiscal year, helping boost demand, said Pandey. The fund has about a one-trillion-rupees portfolio in corporate paper, while about 2.5 trillion rupees in sovereign and state debt. SBI Pension has been positioning for a rate cut by extending the ‘modified duration’ in its bond portfolio to around 6.8-to-6.9 years from 6 years over the past eighteen months, Pandey said. The central bank may cut interest rates by September with a shallow rate cut cycle of around 50 basis points, Pandey said. With the historic spread between the repo rate and 10-year yield being around 50-60 basis points, the 10-year yield should have a floor around 6.75%, he said. ","cleaned_content":"the narrowing spreads on longer maturity indian government bonds may prompt sbi pension funds pvt to look for opportunities in corporate and state debt according to its chief investment officer we expect some term premium for the longer dated securities and if that spread is not available it would impact the accruals for my subscribers sandeep pandey who manages \u003cFOUR_\u003e trillion rupees \u003cFIVE_TEN\u003e billion in assets said in an interview i ll probably have to evaluate other avenues including state debt or corporate bonds demand for longer tenor papers has risen due to increased purchases by pension funds and insurers this has compressed the spread between the \u003cONE_TEN\u003e year and \u003cTHREE_TEN\u003e year bonds to six basis points from more than \u003cONE_HUNDRED\u003e basis points in may \u003cTWO_THOUSAND\u003e diminishing the incentive for investors seeking higher yields for holding debt for longer the yields on benchmark \u003cONE_TEN\u003e year bond has declined by more than \u003cTHREE_TEN\u003e basis points since october to \u003cSEVEN_PERCENT\u003e on tuesday as global funds added to their holdings of index eligible bonds ahead of the nation s upcoming inclusion in global bond indexes in comparison the yields on top rated similar maturity corporate bond stands at \u003cSEVEN_PERCENT\u003e the tight liquidity situation in the banking system is also helping widen spreads on the corporate bond portfolio while the fund doesn t have much presence on the shorter end in the government bond curve pandey said pension funds insurance companies and provident funds typically see around \u003cONE_TEN_PERCENT\u003e to \u003cTWO_TEN_PERCENT\u003e incremental flows while the net supply of sovereign paper hasn t changed for the coming fiscal year helping boost demand said pandey the fund has about a one trillion rupees portfolio in corporate paper while about \u003cTWO_\u003e trillion rupees in sovereign and state debt sbi pension has been positioning for a rate cut by extending the modified duration in its bond portfolio to around \u003cSIX_\u003e to \u003cSIX_\u003e years from \u003cSIX_\u003e years over the past eighteen months pandey said the central bank may cut interest rates by september with a shallow rate cut cycle of around \u003cFIVE_TEN\u003e basis points pandey said with the historic spread between the repo rate and \u003cONE_TEN\u003e year yield being around \u003cFIVE_TEN\u003e \u003cSIX_TEN\u003e basis points the \u003cONE_TEN\u003e year yield should have a floor around \u003cSIX_PERCENT\u003e he said","timestamp":"2024-03-05T13:32:00+05:30","market_timestamp":"2024-03-05T13:32:00+05:30","off_market_hours":false}