{"url":"https://www.moneycontrol.com/news/business/warehouse-developers-bet-on-india-as-companies-look-beyond-china-12478851.html","title":"Warehouse developers bet on India as companies look beyond China","description":"\"It is one of the most wanted places in India for European and American companies,\" said S. Raghuraman, an official of the Greenbase industrial park, near plants run by Apple supplier Foxconn and truckmaker Daimler.Warehouse developers bet on India as companies look beyond ChinaRelated stories","content":"Land is getting hard to find in a sprawling industrial park in southern India where workers are scrambling to build modern new warehouses and factories for companies betting on the country's economic boom or diversifying their supply chains beyond China. \"It is one of the most wanted places in India for European and American companies,\" said S. Raghuraman, an official of the Greenbase industrial park, near plants run by Apple supplier Foxconn and truckmaker Daimler. Inquiries for leasing space in the park, run by Blackstone and real estate tycoon Niranjan Hiranandani, have gone through the roof, he added. To meet the burgeoning demand, Greenbase aims to invest $800 million to quadruple its industrial park space to 20 million sq ft (1.9 million sq m), a target it revealed for the first time. That is just the latest sign of a rush for leased warehouse space that peaked in the last quarter of 2023 at its highest in two years, says real estate firm Colliers, as India's economic growth of more than 8% outstrips advanced nations. Businesses in India have traditionally relied on dingy, stuffy low-rise sheds known as godowns for their storage needs, but these are unsuited to the needs of foreign industrial giants whose investment Prime Minister Narendra Modi wants to lure. So developers such as Greenbase are scouting for land nationwide, grappling with thorny acquisition issues, as they line up millions of dollars in new investment. Prime targets are firms looking to expand manufacturing facilities beyond China as tension with the United States and other countries takes off some of its shine. Companies in the booming e-commerce and manufacturing industries also see India as a hub for exports while looking to boost sales to industries and domestic consumers amid a population of 1.4 billion. \"We thought this is the right moment to enter India as there is a huge potential runway for growth over the next 15 to 20 years,\" said Sandeep Chanda, the India managing director of one of the world's biggest developers, U.S.-based Panattoni. One lure has been spanking new facilities, from ports to highways, added in an $808-billion infrastructure splurge over the last seven years, boosting connectivity and putting the spotlight on previously overlooked plots of land. In a 100-million-euro ($109-million) plan, Panattoni is building its first warehouse complex near the capital, New Delhi, playing up its access to expressways and a rail freight corridor. It plans to strike land deals for four more parks within a year. And Chanda sees room to grow, saying India leases just 45 million sq ft (4 million sq m) of new warehouses a year, a fraction of the 200 million sq ft (19 million sq m) in China. Avendus Capital estimates China has three times more than India's 412 million sq ft (38 million sq m) of the \"Grade A\" warehouses, fitted with automated storage and retrieval systems, that industries from e-commerce to engineering favour. By comparison, Blackstone says the United States has 13 billion square feet (1.2 billion sq m) of warehousing stock. CHINA ALTERNATIVE Colliers says the 7.7 million square ft (715,000 sq. m.) of warehouse space leased in the last quarter of 2023 in the top five Indian cities it tracks was the highest in the last two years. During that period, the supply of \"Grade A\" warehouses rose 336% in Tamil Nadu's capital of Chennai, near the Greenbase park, for the highest growth among the five cities and outperforming the group's average of 55%. Colliers expects automobile, engineering, retail and e-commerce companies to drive further growth. Danish wind turbine maker Vestas just added 20% more space to its assembly and warehouse operations at Greenbase, said Raghuraman, adding that though China is the firm's main hub, \"They want to make India an alternative.\" Vestas \"continuously matures and evolves our global supply chain network and manufacturing footprint,\" it said. Prologis, the world's largest warehouse owner, has returned to India after ending an initial foray in 2007, when it found the market \"too challenging\". Now the company is focusing on \"high-growth, high-consumption\" areas, said Joseph Ghazal, its chief investment officer. \"India has seen strong economic growth, and we believe there is a high level of demand.\" While developers zero in on big cities and warehouses, Bahrain-based Investcorp is taking the opposite tack by betting on smaller warehouses, said Gaurav Sharma, its India investment head. Investcorp plans to raise about $120 million for a fund to partner with developers and build up to eight warehouses in India, a strategy that Reuters is the first to report. But developers often find they first have to resolve complex land issues. India's infrastructure drive fuels high demand for land, leaving few plots in good locations, so that surging prices hit developers' returns as rentals fall behind, executives said. Real estate consultants CBRE say land prices around the Greenbase park rose a fifth in 2023 to $3.6 million for 10 acres (4 hectares), or an area half the size of Buckingham Palace, with increases of more than 50% for some plots near New Delhi. Sometimes a single piece of land can have as many as 50 owners. Panattoni needed eight months to complete acquisition formalities for its complex near the capital. \"Land takes its own sweet time,\" Chanda said, referring to the period spent untangling ownership concerns. ","cleaned_content":"land is getting hard to find in a sprawling industrial park in southern india where workers are scrambling to build modern new warehouses and factories for companies betting on the countrys economic boom or diversifying their supply chains beyond china it is one of the most wanted places in india for european and american companies said s raghuraman an official of the greenbase industrial park near plants run by apple supplier foxconn and truckmaker daimler inquiries for leasing space in the park run by blackstone and real estate tycoon niranjan hiranandani have gone through the roof he added to meet the burgeoning demand greenbase aims to invest \u003cEIGHT_HUNDRED\u003e million to quadruple its industrial park space to \u003cTWO_TEN\u003e million sq ft \u003cONE_\u003e million sq m a target it revealed for the first time that is just the latest sign of a rush for leased warehouse space that peaked in the last quarter of \u003cTWO_THOUSAND\u003e at its highest in two years says real estate firm colliers as indias economic growth of more than \u003cEIGHT_PERCENT\u003e outstrips advanced nations businesses in india have traditionally relied on dingy stuffy low rise sheds known as godowns for their storage needs but these are unsuited to the needs of foreign industrial giants whose investment prime minister narendra modi wants to lure so developers such as greenbase are scouting for land nationwide grappling with thorny acquisition issues as they line up millions of dollars in new investment prime targets are firms looking to expand manufacturing facilities beyond china as tension with the united states and other countries takes off some of its shine companies in the booming e commerce and manufacturing industries also see india as a hub for exports while looking to boost sales to industries and domestic consumers amid a population of \u003cONE_\u003e billion we thought this is the right moment to enter india as there is a huge potential runway for growth over the next \u003cONE_TEN\u003e to \u003cTWO_TEN\u003e years said sandeep chanda the india managing director of one of the worlds biggest developers u s based panattoni one lure has been spanking new facilities from ports to highways added in an \u003cEIGHT_HUNDRED\u003e billion infrastructure splurge over the last seven years boosting connectivity and putting the spotlight on previously overlooked plots of land in a \u003cONE_HUNDRED\u003e million euro \u003cONE_HUNDRED\u003e million plan panattoni is building its first warehouse complex near the capital new delhi playing up its access to expressways and a rail freight corridor it plans to strike land deals for four more parks within a year and chanda sees room to grow saying india leases just \u003cFOUR_TEN\u003e million sq ft \u003cFOUR_\u003e million sq m of new warehouses a year a fraction of the \u003cTWO_HUNDRED\u003e million sq ft \u003cONE_TEN\u003e million sq m in china avendus capital estimates china has three times more than indias \u003cFOUR_HUNDRED\u003e million sq ft \u003cTHREE_TEN\u003e million sq m of the grade a warehouses fitted with automated storage and retrieval systems that industries from e commerce to engineering favour by comparison blackstone says the united states has \u003cONE_TEN\u003e billion square feet \u003cONE_\u003e billion sq m of warehousing stock china alternative colliers says the \u003cSEVEN_\u003e million square ft \u003cSEVEN_HUNDRED_THOUSAND\u003e sq m of warehouse space leased in the last quarter of \u003cTWO_THOUSAND\u003e in the top five indian cities it tracks was the highest in the last two years during that period the supply of grade a warehouses rose \u003cTHREE_HUNDRED_PERCENT\u003e in tamil nadus capital of chennai near the greenbase park for the highest growth among the five cities and outperforming the groups average of \u003cFIVE_TEN_PERCENT\u003e colliers expects automobile engineering retail and e commerce companies to drive further growth danish wind turbine maker vestas just added \u003cTWO_TEN_PERCENT\u003e more space to its assembly and warehouse operations at greenbase said raghuraman adding that though china is the firms main hub they want to make india an alternative vestas continuously matures and evolves our global supply chain network and manufacturing footprint it said prologis the worlds largest warehouse owner has returned to india after ending an initial foray in \u003cTWO_THOUSAND\u003e when it found the market too challenging now the company is focusing on high growth high consumption areas said joseph ghazal its chief investment officer india has seen strong economic growth and we believe there is a high level of demand while developers zero in on big cities and warehouses bahrain based investcorp is taking the opposite tack by betting on smaller warehouses said gaurav sharma its india investment head investcorp plans to raise about \u003cONE_HUNDRED\u003e million for a fund to partner with developers and build up to eight warehouses in india a strategy that reuters is the first to report but developers often find they first have to resolve complex land issues indias infrastructure drive fuels high demand for land leaving few plots in good locations so that surging prices hit developers returns as rentals fall behind executives said real estate consultants cbre say land prices around the greenbase park rose a fifth in \u003cTWO_THOUSAND\u003e to \u003cTHREE_\u003e million for \u003cONE_TEN\u003e acres \u003cFOUR_\u003e hectares or an area half the size of buckingham palace with increases of more than \u003cFIVE_TEN_PERCENT\u003e for some plots near new delhi sometimes a single piece of land can have as many as \u003cFIVE_TEN\u003e owners panattoni needed eight months to complete acquisition formalities for its complex near the capital land takes its own sweet time chanda said referring to the period spent untangling ownership concerns","timestamp":"2024-03-18T15:20:00+05:30","market_timestamp":"2024-03-18T15:20:00+05:30","off_market_hours":false}