{"url":"https://www.moneycontrol.com/news/business/anz-ceo-looks-for-india-china-growth-as-focus-shifts-12480631.html","title":"ANZ CEO looks for India, China growth as focus shifts","description":"Most of the Australian bank’s business across Asia Pacific is through its institutional bank, and the international return-on-equity has grown to mid-teens, up from around 3% when Elliott became CEO more than eight years ago, he said. In mainland China, where ANZ has about 300 people, he expects the business to keep growing. India can’t match China’s past 8-10% growth, Morgan Stanley says","content":"ANZ Group Holdings Ltd. Chief Executive Officer Shayne Elliott aims to grow the firm’s presence in India and Vietnam as well as in China as his clients require the bank’s services in an increasing number of locations. “Our business is shifting geographically quite fast,” Elliott said in a Bloomberg TV interview in Hong Kong Monday. “We need to respond to that as a bank. We are building out our capability in places like India, or like Vietnam, to help with that capacity as we see those trade flows and capital flows shift.” Most of the Australian bank’s business across Asia Pacific is through its institutional bank, and the international return-on-equity has grown to mid-teens, up from around 3% when Elliott became CEO more than eight years ago, he said. In mainland China, where ANZ has about 300 people, he expects the business to keep growing. Investors are monitoring the next move from Elliott at ANZ after the lender was given the green light to acquire Suncorp Group Ltd.’s banking arm. The firm earlier this month reduced its stake in Malaysia’s AMMB Holdings Bhd. and Elliott said the bank’s strategy was focused on exiting positions it has in Bank of Tianjin Co. and Bank Pan Indonesi ","cleaned_content":"anz group holdings ltd chief executive officer shayne elliott aims to grow the firm s presence in india and vietnam as well as in china as his clients require the bank s services in an increasing number of locations our business is shifting geographically quite fast elliott said in a bloomberg tv interview in hong kong monday we need to respond to that as a bank we are building out our capability in places like india or like vietnam to help with that capacity as we see those trade flows and capital flows shift most of the australian bank s business across asia pacific is through its institutional bank and the international return on equity has grown to mid teens up from around \u003cTHREE_PERCENT\u003e when elliott became ceo more than eight years ago he said in mainland china where anz has about \u003cTHREE_HUNDRED\u003e people he expects the business to keep growing investors are monitoring the next move from elliott at anz after the lender was given the green light to acquire suncorp group ltd s banking arm the firm earlier this month reduced its stake in malaysia s ammb holdings bhd and elliott said the bank s strategy was focused on exiting positions it has in bank of tianjin co and bank pan indonesi","timestamp":"2024-03-18T15:18:00+05:30","market_timestamp":"2024-03-18T15:18:00+05:30","off_market_hours":false}