{"url":"https://www.moneycontrol.com/news/business/google-ties-up-with-eci-to-prevent-spread-of-false-information-12445441.html","title":"Google ties up with ECI to prevent spread of false information","description":"Google India in a blog post on Tuesday said its product features are designed to elevate authoritative information on various election-related topics.Google ties up with ECI to prevent spread of false informationRelated stories","content":"Alphabet Inc-owned Google has joined hands with Election Commission of India (ECI) to prevent spread of false information, promote authorised content and label AI-generated data during the upcoming general elections. Google India in a blog post on Tuesday said its product features are designed to elevate authoritative information on various election-related topics. \"We are collaborating with ECI to enable people to easily discover critical voting information on Google Search - such as how to register and how to vote - in both English and Hindi,\" Google said. \"As more advertisers leverage the power and opportunity of AI, we want to make sure we continue to provide people with greater transparency and the information they need to make informed decisions. Our ads policies already prohibit the use of manipulated media to mislead people, like deepfakes or doctored content,\" it said. Google has already started displaying labels for content created with YouTube generative AI features, like Dream Screen. \"Soon, YouTube will begin to require creators to disclose when they've created realistic altered or synthetic content, and will display a label that indicates for people when they're watching this content,\" it said. The blog post further said the company has begun to roll out restrictions on the types of election-related queries for which Gemini will return responses. It said that for news and information related to the election, YouTube's recommendation system prominently surfaces content from authoritative sources on the YouTube homepage, in search results, and highlights high-quality content from authoritative news sources. The popular search engine said they have set policies around demonstrably false claims in areas like manipulated content, incitement to violence, hate speech, and harassment, that could undermine democratic processes. \"We rely on a combination of human reviewers and machine learning to identify and remove content that violates our policies. Our AI models are enhancing our abuse-fighting efforts, while a dedicated team of local experts across all major Indian languages are working 24X7 to provide relevant context,\" the blog post said. Google has set strict policies and restrictions around who can run election-related advertising on its platforms. These include identity verification, certification and authorisation by the ECI, and financier disclosures. \"We take our responsibility for providing high-quality information for these types of queries seriously, and are continuously working to improve our protections,\" the blog post said. Google said it has recently joined the Coalition for Content Provenance and Authenticity (C2PA), and pledged to help prevent deceptive AI-generated imagery, audio or video content from interfering with this year's global elections. Earlier, Google had introduced the Google News Initiative Training Network and the Fact Check Explorer tool to enable newsrooms and journalists deliver reliable, fact-checked updates to debunk misinformation. Additionally, Google is supporting Shakti, India Election Fact-Checking Collective, which is a consortium of news publishers and fact-checkers in India working together to aid the early detection of online misinformation, including deepfakes, and to create a common repository that news publishers can use to tackle the challenges of misinformation at scale. \"Google is committed to working with government, industry, and civil society and surface and connect voters to authoritative and helpful information online,\" the blog post said. ","cleaned_content":"alphabet inc owned google has joined hands with election commission of india eci to prevent spread of false information promote authorised content and label ai generated data during the upcoming general elections google india in a blog post on tuesday said its product features are designed to elevate authoritative information on various election related topics we are collaborating with eci to enable people to easily discover critical voting information on google search such as how to register and how to vote in both english and hindi google said as more advertisers leverage the power and opportunity of ai we want to make sure we continue to provide people with greater transparency and the information they need to make informed decisions our ads policies already prohibit the use of manipulated media to mislead people like deepfakes or doctored content it said google has already started displaying labels for content created with youtube generative ai features like dream screen soon youtube will begin to require creators to disclose when theyve created realistic altered or synthetic content and will display a label that indicates for people when theyre watching this content it said the blog post further said the company has begun to roll out restrictions on the types of election related queries for which gemini will return responses it said that for news and information related to the election youtubes recommendation system prominently surfaces content from authoritative sources on the youtube homepage in search results and highlights high quality content from authoritative news sources the popular search engine said they have set policies around demonstrably false claims in areas like manipulated content incitement to violence hate speech and harassment that could undermine democratic processes we rely on a combination of human reviewers and machine learning to identify and remove content that violates our policies our ai models are enhancing our abuse fighting efforts while a dedicated team of local experts across all major indian languages are working \u003cTWO_TEN\u003e x7 to provide relevant context the blog post said google has set strict policies and restrictions around who can run election related advertising on its platforms these include identity verification certification and authorisation by the eci and financier disclosures we take our responsibility for providing high quality information for these types of queries seriously and are continuously working to improve our protections the blog post said google said it has recently joined the coalition for content provenance and authenticity c2pa and pledged to help prevent deceptive ai generated imagery audio or video content from interfering with this years global elections earlier google had introduced the google news initiative training network and the fact check explorer tool to enable newsrooms and journalists deliver reliable fact checked updates to debunk misinformation additionally google is supporting shakti india election fact checking collective which is a consortium of news publishers and fact checkers in india working together to aid the early detection of online misinformation including deepfakes and to create a common repository that news publishers can use to tackle the challenges of misinformation at scale google is committed to working with government industry and civil society and surface and connect voters to authoritative and helpful information online the blog post said","timestamp":"2024-03-13T02:23:00+05:30","market_timestamp":"2024-03-13T09:15:00+05:30","off_market_hours":true}