{"url":"https://www.moneycontrol.com/news/business/bhel-bags-1600-mw-thermal-project-order-from-ntpc-12486221.html","title":"BHEL bags 1,600 MW thermal project order from NTPC","description":"The plant will be set up adjacent to the existing 2,000 MW thermal power station (TPS) at Singrauli in Sonbhadra district of Uttar Pradesh, BHEL said in a statement.BHEL bags 1,600 MW thermal project order from NTPC","content":"State-owned engineering firm Bharat Heavy Electricals Ltd (BHEL) on Tuesday said it has bagged an order for setting up 1,600 MW Singrauli Supercritical Thermal Power Plant (STPP) Stage-III from NTPC. The plant will be set up adjacent to the existing 2,000 MW thermal power station (TPS) at Singrauli in Sonbhadra district of Uttar Pradesh, BHEL said in a statement. Set up by BHEL in 1982, Singrauli TPS was NTPC's first power plant in the state. According to the statement, under International Competitive Bidding (ICB), Bharat Heavy Electricals Ltd (BHEL) has bagged an order from NTPC for setting up the 2x800 MW Singrauli Supercritical Thermal Power Plant (STPP) Stage-III on Engineering, Procurement \u0026 Construction (EPC) basis. Key equipment for the project will be supplied by BHEL's manufacturing units at Haridwar, Trichy, Bengaluru, Hyderabad, Ranipet, and Bhopal. ","cleaned_content":"state owned engineering firm bharat heavy electricals ltd bhel on tuesday said it has bagged an order for setting up \u003cONE_THOUSAND\u003e mw singrauli supercritical thermal power plant stpp stage iii from ntpc the plant will be set up adjacent to the existing \u003cTWO_THOUSAND\u003e mw thermal power station tps at singrauli in sonbhadra district of uttar pradesh bhel said in a statement set up by bhel in \u003cONE_THOUSAND\u003e singrauli tps was ntpcs first power plant in the state according to the statement under international competitive bidding icb bharat heavy electricals ltd bhel has bagged an order from ntpc for setting up the \u003cTWO_\u003e x800 mw singrauli supercritical thermal power plant stpp stage iii on engineering procurement construction epc basis key equipment for the project will be supplied by bhels manufacturing units at haridwar trichy bengaluru hyderabad ranipet and bhopal","timestamp":"2024-03-20T02:00:00+05:30","market_timestamp":"2024-03-20T09:15:00+05:30","off_market_hours":true}