{"url":"https://www.moneycontrol.com/news/business/pm-modi-inaugurates-indias-first-automobile-in-plant-railway-siding-project-of-maruti-suzuki-in-gujarat-12445131.html","title":"PM Modi inaugurates India's first automobile in-plant railway siding project of Maruti Suzuki in Gujarat","description":"PM Modi, who visited Gujarat on Tuesday, inaugurated and laid the foundation stone of Rs 85,000 crore railway projects, including the launch of 10 new Vande Bharat trains, from Sabarmati area of Ahmedabad in Gujarat after visiting the Dedicated Freight Corridor's (DFC) Operation Control Centre here.The project has been developed under the Centre's PM Gati Shakti mission in partnership with the Gujarat government, Indian Railways and MSIL at a cost of Rs 976 crore, MSIL's Executive Officer, Corporate Affairs, Rahul Bharti said.Related stories","content":"Prime Minister Narendra Modi on Tuesday inaugurated India's first automobile in-plant railway siding project of Maruti Suzuki (MSIL) at its plant at Hansalpur in Gujarat's Mehsana district virtually from a function here. PM Modi, who visited Gujarat on Tuesday, inaugurated and laid the foundation stone of Rs 85,000 crore railway projects, including the launch of 10 new Vande Bharat trains, from Sabarmati area of Ahmedabad in Gujarat after visiting the Dedicated Freight Corridor's (DFC) Operation Control Centre here. The MSIL's in-plant railway siding project was also inaugurated during the event. \"It is for the first time in India that an in-plant railway siding for any automobile company has happened. This is the excellence of the Gati Shakti programme,\" Bharti told media persons here. The project has been developed by a special purpose vehicle - Bahucharaji Rail Corporation Limited (BRCL) - set up with Gujarat Railway Infrastructure Development Corporation (GRIDE), Gujarat Industrial Development Corporation (GIDC) and MSIL as partners with 49 per cent, 29 per cent and 26 per cent equities each respectively. GRIDE is a joint venture between the Gujarat government and the Ministry of Railways. The railway line within the Bahucharaji plant is developed entirely by Maruti Suzuki at a cost of Rs 105 crore, Bharti said. The project eliminates an annual 50,000 truck trips for MSIL, with the automobile major planning to increase dispatches of finished cars by railway from 26 per cent currently to 40 per cent annually at its full capacity, he said. \"The project will save 50,000 truck trips, 35 million litres of fuel used in trucks per annum, and cut down on 1,650 tonnes per annum carbon emission. Logistics can be a good way of reducing our carbon emission, moving us towards carbon neutrality,\" Bharti said. \"Converting the dispatch from road to rail will benefit everyone as it reduces road congestion. A truck does an average trip of 1,600 km, and one train replaces 40 such trucks. One route of the train thereby helps us effectively eliminate 64,000 km of a truck running on the road,\" he said. The railway sliding has a capacity to dispatch 3,00,000 cars per annum with a present parking capacity of 800 cars expandable up to 3,000 cars, he said. Till February, Maruti Suzuki has dispatched around 18 lakh cars by railways. During the current fiscal till February, 4.09 lakh cars have been dispatched by the railways, he said. \"Our penetration of the railway as a mode of dispatch is the highest among all car manufacturers in the country. We have done more than 21 per cent of dispatches this year, and we want to keep increasing it further, the company's executive officer said. \"We want to keep increasing the share of railways in our finished goods dispatched from the factory to either the dealers in India or to ship for exports. Our exports are also growing, and the company now exports 42 per cent of cars from India. It will increase drastically in the future,\" he said. Giving details of the timeline of the project, Bharti said that G-RIDE gave its formal approval in March 2017, after which the company's internal board approved it in January 2019, and construction began in May 2020. ","cleaned_content":"prime minister narendra modi on tuesday inaugurated indias first automobile in plant railway siding project of maruti suzuki msil at its plant at hansalpur in gujarats mehsana district virtually from a function here pm modi who visited gujarat on tuesday inaugurated and laid the foundation stone of rs \u003cEIGHT_TEN_THOUSAND\u003e crore railway projects including the launch of \u003cONE_TEN\u003e new vande bharat trains from sabarmati area of ahmedabad in gujarat after visiting the dedicated freight corridors dfc operation control centre here the msils in plant railway siding project was also inaugurated during the event it is for the first time in india that an in plant railway siding for any automobile company has happened this is the excellence of the gati shakti programme bharti told media persons here the project has been developed by a special purpose vehicle bahucharaji rail corporation limited brcl set up with gujarat railway infrastructure development corporation gride gujarat industrial development corporation gidc and msil as partners with \u003cFOUR_TEN_PERCENT\u003e \u003cTWO_TEN_PERCENT\u003e and \u003cTWO_TEN_PERCENT\u003e equities each respectively gride is a joint venture between the gujarat government and the ministry of railways the railway line within the bahucharaji plant is developed entirely by maruti suzuki at a cost of rs \u003cONE_HUNDRED\u003e crore bharti said the project eliminates an annual \u003cFIVE_TEN_THOUSAND\u003e truck trips for msil with the automobile major planning to increase dispatches of finished cars by railway from \u003cTWO_TEN_PERCENT\u003e currently to \u003cFOUR_TEN_PERCENT\u003e annually at its full capacity he said the project will save \u003cFIVE_TEN_THOUSAND\u003e truck trips \u003cTHREE_TEN\u003e million litres of fuel used in trucks per annum and cut down on \u003cONE_THOUSAND\u003e tonnes per annum carbon emission logistics can be a good way of reducing our carbon emission moving us towards carbon neutrality bharti said converting the dispatch from road to rail will benefit everyone as it reduces road congestion a truck does an average trip of \u003cONE_THOUSAND\u003e km and one train replaces \u003cFOUR_TEN\u003e such trucks one route of the train thereby helps us effectively eliminate \u003cSIX_TEN_THOUSAND\u003e km of a truck running on the road he said the railway sliding has a capacity to dispatch \u003cTHREE_HUNDRED_THOUSAND\u003e cars per annum with a present parking capacity of \u003cEIGHT_HUNDRED\u003e cars expandable up to \u003cTHREE_THOUSAND\u003e cars he said till february maruti suzuki has dispatched around \u003cONE_TEN\u003e lakh cars by railways during the current fiscal till february \u003cFOUR_\u003e lakh cars have been dispatched by the railways he said our penetration of the railway as a mode of dispatch is the highest among all car manufacturers in the country we have done more than \u003cTWO_TEN_PERCENT\u003e of dispatches this year and we want to keep increasing it further the companys executive officer said we want to keep increasing the share of railways in our finished goods dispatched from the factory to either the dealers in india or to ship for exports our exports are also growing and the company now exports \u003cFOUR_TEN_PERCENT\u003e of cars from india it will increase drastically in the future he said giving details of the timeline of the project bharti said that g ride gave its formal approval in march \u003cTWO_THOUSAND\u003e after which the companys internal board approved it in january \u003cTWO_THOUSAND\u003e and construction began in may \u003cTWO_THOUSAND\u003e","timestamp":"2024-03-18T00:09:00+05:30","market_timestamp":"2024-03-18T09:15:00+05:30","off_market_hours":true}