{"url":"https://www.moneycontrol.com/news/business/inox-green-energy-services-arm-bags-rs-40-crore-order-to-restore-wind-turbine-generators-12486371.html","title":"Inox Green Energy Services arm bags Rs 40 crore order to restore wind turbine generators","description":"The scope of the contract comprises supplies of materials/spares and other activities for the restoration of 33 WTGs within a period of eight months, with a revenue realisation of Rs 39.5 crore (inclusive of taxes) during the contract period, a company statement said.Inox Green Energy Services arm bags Rs 40 crore order to restore wind turbine generatorsRelated stories","content":"Inox Green Energy Services on Tuesday said its subsidiary I-Fox Windtechnik India Pvt Ltd has bagged an order worth Rs 39.5 crore for restoration of 33 wind turbine generators (WTGs) of 1.5MW each from NLC India. The scope of the contract comprises supplies of materials/spares and other activities for the restoration of 33 WTGs within a period of eight months, with a revenue realisation of Rs 39.5 crore (inclusive of taxes) during the contract period, a company statement said. The order is for the restoration of 33 wind turbine generators (each 1.5 MW) of NLC India's wind power plant located at Tenkasi district in Tamil Nadu, the statement added. This is another important landmark in the growth journey of IGESL as well as of our subsidiary I-Fox Wind, and the company is progressing well on its targets on all fronts, he added. IGESL is one of the major wind power operations and maintenance (O\u0026M) service providers within India with a fleet size of 3.2 GW. The company is engaged in the business of providing long-term O\u0026M services for wind projects. It is a subsidiary of Inox Wind Ltd with whom it enjoys a synergistic relationship and is a part of the INOXGFL Group. It has a strong and diverse existing portfolio base and an established track record. It has reliable cashflows supported by long-term O\u0026M contracts. Its customers include some of the largest independent power producers (IPPs), Public Sector Undertakings (PSUs) and various retail customers. ","cleaned_content":"inox green energy services on tuesday said its subsidiary i fox windtechnik india pvt ltd has bagged an order worth rs \u003cTHREE_TEN\u003e crore for restoration of \u003cTHREE_TEN\u003e wind turbine generators wtgs of \u003cONE_\u003e mw each from nlc india the scope of the contract comprises supplies of materials spares and other activities for the restoration of \u003cTHREE_TEN\u003e wtgs within a period of eight months with a revenue realisation of rs \u003cTHREE_TEN\u003e crore inclusive of taxes during the contract period a company statement said the order is for the restoration of \u003cTHREE_TEN\u003e wind turbine generators each \u003cONE_\u003e mw of nlc indias wind power plant located at tenkasi district in tamil nadu the statement added this is another important landmark in the growth journey of igesl as well as of our subsidiary i fox wind and the company is progressing well on its targets on all fronts he added igesl is one of the major wind power operations and maintenance o m service providers within india with a fleet size of \u003cTHREE_\u003e gw the company is engaged in the business of providing long term o m services for wind projects it is a subsidiary of inox wind ltd with whom it enjoys a synergistic relationship and is a part of the inoxgfl group it has a strong and diverse existing portfolio base and an established track record it has reliable cashflows supported by long term o m contracts its customers include some of the largest independent power producers ipps public sector undertakings psus and various retail customers","timestamp":"2024-03-19T15:58:00+05:30","market_timestamp":"2024-03-20T09:15:00+05:30","off_market_hours":true}