{"url":"https://www.moneycontrol.com/news/business/gensol-engineering-sets-up-160-mw-solar-project-in-gujarat-at-rs-128-crore-12478991.html","title":"Gensol Engineering sets up 160 MW solar project in Gujarat at Rs 128 crore","description":"The company has set up the ground-mounted project for Continuum Green Energy on engineering, procurement, and construction (EPC) basis, it said in a regulatory filing.Gensol Engineering sets up 160 MW solar project in Gujarat at Rs 128 crore","content":"Gensol Engineering on Monday announced setting up a 160 megawatt solar power project at Bhavnagar in Gujarat at a cost of Rs 128 crore. The company has set up the ground-mounted project for Continuum Green Energy on engineering, procurement, and construction (EPC) basis, it said in a regulatory filing. \"Gensol announces the successful completion of 160 MW solar installation in Bhavnagar valued at Rs 128 crore. This is the sixth major ground-mount project, alongside ground-mount solar projects in Karnataka, Haryana, Gujarat, and Jharkhand,\" the filing said.Gensol Engineering said its EPC order book has exceeded Rs 1,000 crore. Over the years, Gensol has installed ground-mounted and rooftop solar power plants with a combined capacity of over 600 MW. The company has also established an electric vehicle (EV) manufacturing facility in Pune. ","cleaned_content":"gensol engineering on monday announced setting up a \u003cONE_HUNDRED\u003e megawatt solar power project at bhavnagar in gujarat at a cost of rs \u003cONE_HUNDRED\u003e crore the company has set up the ground mounted project for continuum green energy on engineering procurement and construction epc basis it said in a regulatory filing gensol announces the successful completion of \u003cONE_HUNDRED\u003e mw solar installation in bhavnagar valued at rs \u003cONE_HUNDRED\u003e crore this is the sixth major ground mount project alongside ground mount solar projects in karnataka haryana gujarat and jharkhand the filing said gensol engineering said its epc order book has exceeded rs \u003cONE_THOUSAND\u003e crore over the years gensol has installed ground mounted and rooftop solar power plants with a combined capacity of over \u003cSIX_HUNDRED\u003e mw the company has also established an electric vehicle ev manufacturing facility in pune","timestamp":"2024-03-18T15:13:00+05:30","market_timestamp":"2024-03-18T15:13:00+05:30","off_market_hours":false}