{"url":"https://www.moneycontrol.com/news/world/indian-infra-lender-considers-bond-sale-to-raise-up-to-4-8-billion-12490651.html","title":"Indian infra lender considers bond sale to raise up to $4.8 billion","description":"NaBFID, as the institution is called, is likely to sell bonds with tenors spanning from 10 to 20 years in the financial year starting April 1, the people said, asking not be identified because the details are private. Indian infra lender considers bond sale to raise up to $4.8 billion","content":"National Bank for Financing Infrastructure and Development plans to raise up to 400 billion rupees ($4.8 billion) in local currency bonds, according to people familiar with the matter, as the newly created Indian lender aims to more than double its loans disbursement. NaBFID, as the institution is called, is likely to sell bonds with tenors spanning from 10 to 20 years in the financial year starting April 1, the people said, asking not be identified because the details are private. The amount is expected to be in 300 billion rupees to 400 billion rupees range, they said. The state-backed financier, which started operations in 2022, raised 195.2 billion rupees in the current fiscal year in two issuances, joining other Indian institutions in selling bonds amid a massive increase in government spending on roads, ports and railways. NaBFID has disbursed loans of more than 250 billion rupees since April last year, one of the people said. Prime Minister Narendra Modi’s administration has doubled spending on roads, airports and urban infrastructure over the past three years, and allocated about 11 trillion rupees ($133 billion) to the sector for the coming fiscal year. ","cleaned_content":"national bank for financing infrastructure and development plans to raise up to \u003cFOUR_HUNDRED\u003e billion rupees \u003cFOUR_\u003e billion in local currency bonds according to people familiar with the matter as the newly created indian lender aims to more than double its loans disbursement nabfid as the institution is called is likely to sell bonds with tenors spanning from \u003cONE_TEN\u003e to \u003cTWO_TEN\u003e years in the financial year starting april \u003cONE_\u003e the people said asking not be identified because the details are private the amount is expected to be in \u003cTHREE_HUNDRED\u003e billion rupees to \u003cFOUR_HUNDRED\u003e billion rupees range they said the state backed financier which started operations in \u003cTWO_THOUSAND\u003e raised \u003cONE_HUNDRED\u003e billion rupees in the current fiscal year in two issuances joining other indian institutions in selling bonds amid a massive increase in government spending on roads ports and railways nabfid has disbursed loans of more than \u003cTWO_HUNDRED\u003e billion rupees since april last year one of the people said prime minister narendra modi s administration has doubled spending on roads airports and urban infrastructure over the past three years and allocated about \u003cONE_TEN\u003e trillion rupees \u003cONE_HUNDRED\u003e billion to the sector for the coming fiscal year","timestamp":"2024-03-20T07:31:00+05:30","market_timestamp":"2024-03-20T09:15:00+05:30","off_market_hours":true}