{"url":"https://www.moneycontrol.com/news/business/adani-green-energy-operanalizes-1000-mw-solar-energy-at-khavda-re-park-gujarat-12436351.html","title":"Adani Green Energy operanalizes 1,000 MW solar energy at Khavda RE Park, Gujarat","description":"With this, AGEL has achieved operational capacity of 9,478 MW and continues its journey to the stated goal of 45,000 MW by 2030, a company statement said.Adani Green Energy operanalizes 1,000 MW solar energy at Khavda RE Park, Gujarat","content":"Adani Green Energy (AGEL) on Monday said it has operationalized a cumulative capacity of 1,000 MW solar energy at Khavda, in Gujarat. With this, AGEL has achieved operational capacity of 9,478 MW and continues its journey to the stated goal of 45,000 MW by 2030, a company statement said. AGEL delivered 1,000 MW in less than 12 months of commencing work at Khavda, it stated. The world's largest renewable energy plant of 30 GW spans a staggering 538 sq km of barren land, five times the size of Paris. The project is expected to be completed in the next five years and will create over 15,200 green jobs. Leveraging the project execution capabilities of Adani Infra, technological expertise of Adani New Industries Limited (ANIL), operational excellence of AIMSL, robust supply chain, AGEL is set to replicate its success in building and operating India's first and the world's largest wind-solar hybrid cluster at Jaisalmer. Innovative solutions are being deployed at Khavda to integrate sustainable practices. AGEL has committed to deploy waterless cleaning robots for the entire solar capacity to address dust accumulation on panels to increase the energy output and help conserve water in the arid Kutch region. ","cleaned_content":"adani green energy agel on monday said it has operationalized a cumulative capacity of \u003cONE_THOUSAND\u003e mw solar energy at khavda in gujarat with this agel has achieved operational capacity of \u003cNINE_THOUSAND\u003e mw and continues its journey to the stated goal of \u003cFOUR_TEN_THOUSAND\u003e mw by \u003cTWO_THOUSAND\u003e a company statement said agel delivered \u003cONE_THOUSAND\u003e mw in less than \u003cONE_TEN\u003e months of commencing work at khavda it stated the worlds largest renewable energy plant of \u003cTHREE_TEN\u003e gw spans a staggering \u003cFIVE_HUNDRED\u003e sq km of barren land five times the size of paris the project is expected to be completed in the next five years and will create over \u003cONE_TEN_THOUSAND\u003e green jobs leveraging the project execution capabilities of adani infra technological expertise of adani new industries limited anil operational excellence of aimsl robust supply chain agel is set to replicate its success in building and operating indias first and the worlds largest wind solar hybrid cluster at jaisalmer innovative solutions are being deployed at khavda to integrate sustainable practices agel has committed to deploy waterless cleaning robots for the entire solar capacity to address dust accumulation on panels to increase the energy output and help conserve water in the arid kutch region","timestamp":"2024-03-11T13:18:00+05:30","market_timestamp":"2024-03-11T13:18:00+05:30","off_market_hours":false}