{"url":"https://www.moneycontrol.com/news/business/green-infra-wind-energy-bags-440-mw-wind-solar-hybrid-project-12436331.html","title":"Green Infra Wind Energy bags 440 MW wind-solar hybrid project","description":"The build-own-operate project is part of a 1.5GW bid issued by SJVN in September 2023, a company statement said.Green Infra Wind Energy bags 440 MW wind-solar hybrid project","content":"Sembcorp Industries on Monday said its arm Green Infra Wind Energy Ltd (GIWEL) has bagged a 440 MW wind-solar hybrid power project from SJVN Ltd. The build-own-operate project is part of a 1.5GW bid issued by SJVN in September 2023, a company statement said. According to the statement of Sembcorp Industries (Sembcorp), through its wholly-owned renewables subsidiary, Green Infra Wind Energy Ltd (GIWEL), has received the Letter of Award (LOA) for a 440MW (Megawatt) Inter-state Transmission System (ISTS) connected wind-solar hybrid power project (the Project) from SJVN Ltd (SJVN). The Project is expected to be ready for commercial operation within 24 months from the date of signing the PPA and will be funded through a mixture of internal funds and debt. With this latest award, Sembcorp's gross renewables capacity globally is now at 14.3GW, including a 245MW acquisition pending completion. ","cleaned_content":"sembcorp industries on monday said its arm green infra wind energy ltd giwel has bagged a \u003cFOUR_HUNDRED\u003e mw wind solar hybrid power project from sjvn ltd the build own operate project is part of a \u003cONE_\u003e gw bid issued by sjvn in september \u003cTWO_THOUSAND\u003e a company statement said according to the statement of sembcorp industries sembcorp through its wholly owned renewables subsidiary green infra wind energy ltd giwel has received the letter of award loa for a \u003cFOUR_HUNDRED\u003e mw megawatt inter state transmission system ists connected wind solar hybrid power project the project from sjvn ltd sjvn the project is expected to be ready for commercial operation within \u003cTWO_TEN\u003e months from the date of signing the ppa and will be funded through a mixture of internal funds and debt with this latest award sembcorps gross renewables capacity globally is now at \u003cONE_TEN\u003e gw including a \u003cTWO_HUNDRED\u003e mw acquisition pending completion","timestamp":"2024-03-11T13:18:00+05:30","market_timestamp":"2024-03-11T13:18:00+05:30","off_market_hours":false}