{"url":"https://www.moneycontrol.com/news/business/spicejet-promoter-ajay-singh-raises-bid-for-go-first-following-banks-nudge-report-12485671.html","title":"SpiceJet promoter Ajay Singh raises bid for Go First following banks' nudge: Report","description":"The consortium, which includes budget carrier SpiceJet's managing director Ajay Singh and Busy Bee Airways, increased the bid amount between 1 billion rupees ($12.06 million) and 1.5 billion rupees, one of the sources said. The original bid amount stood at 16 billion rupees.SpiceJet promoter, Busy Bee Airways raise bid for Go First following banks' nudge: ReportRelated stories","content":"One of the two bidders for bankrupt Indian airline Go First has raised its offer following a nudge from lenders, two banking sources and a person aware of the development said on Tuesday. The consortium, which includes budget carrier SpiceJet's managing director Ajay Singh and Busy Bee Airways, increased the bid amount between 1 billion rupees ($12.06 million) and 1.5 billion rupees, one of the sources said. The original bid amount stood at 16 billion rupees. The sources did not wish to be identified as they were not authorised to speak to the media. Pitti is the CEO of online travel platform EaseMyTrip. Go First, which filed for bankruptcy in May last year, received two financial bids as part of its bankruptcy process, the second being Sharjah-based Sky One Airways, Reuters had reported. \"The bid amount in both the offers was far below the expectations of the Committee of Creditors (CoC) and would involve a deep haircut, which is why both the bidders were asked to revise their offer upwards,\" a banker with a state-run bank that has exposure to Go First said. Its bankruptcy filing lists Central Bank of India, Bank of Baroda, IDBI Bank and Deutsche Bank among creditors to which it owes a total of 65.21 billion rupees. The CoC, through the resolution professional, are in talks with Sky One, the banker added. Sky One Airways did not immediately respond to a request for comment. Singh and Busy Bee's joint bid will be discussed in the next CoC meeting that is likely to be held early next week, the second banker said. Lenders are expected to revert to the bidders by March 28, this banker added. ","cleaned_content":"one of the two bidders for bankrupt indian airline go first has raised its offer following a nudge from lenders two banking sources and a person aware of the development said on tuesday the consortium which includes budget carrier spicejets managing director ajay singh and busy bee airways increased the bid amount between \u003cONE_\u003e billion rupees \u003cONE_TEN\u003e million and \u003cONE_\u003e billion rupees one of the sources said the original bid amount stood at \u003cONE_TEN\u003e billion rupees the sources did not wish to be identified as they were not authorised to speak to the media pitti is the ceo of online travel platform easemytrip go first which filed for bankruptcy in may last year received two financial bids as part of its bankruptcy process the second being sharjah based sky one airways reuters had reported the bid amount in both the offers was far below the expectations of the committee of creditors coc and would involve a deep haircut which is why both the bidders were asked to revise their offer upwards a banker with a state run bank that has exposure to go first said its bankruptcy filing lists central bank of india bank of baroda idbi bank and deutsche bank among creditors to which it owes a total of \u003cSIX_TEN\u003e billion rupees the coc through the resolution professional are in talks with sky one the banker added sky one airways did not immediately respond to a request for comment singh and busy bees joint bid will be discussed in the next coc meeting that is likely to be held early next week the second banker said lenders are expected to revert to the bidders by march \u003cTWO_TEN\u003e this banker added","timestamp":"2024-03-19T15:58:00+05:30","market_timestamp":"2024-03-20T09:15:00+05:30","off_market_hours":true}