{"url":"https://www.moneycontrol.com/news/business/ihcl-set-to-accelerate-supply-with-over-90-new-properties-in-pipeline-12537251.html","title":"IHCL set to accelerate supply with over 90 new properties in pipeline","description":"In FY24, the company had another year of accelerated portfolio expansion with 52 signings and 34 openings and achieved a portfolio of over 300 hotels, ahead of its market guidance under Ahvaan 2025, Indian Hotels Company Ltd (IHCL) said in a statement.IHCL set to accelerate supply with over 90 new properties in pipelineRelated stories","content":"Tata group hospitality firm Indian Hotels Company Ltd on Thursday said its addition of hotels is set to accelerate over the next few years with over 90 new properties in the pipeline. In FY24, the company had another year of accelerated portfolio expansion with 52 signings and 34 openings and achieved a portfolio of over 300 hotels, ahead of its market guidance under Ahvaan 2025, Indian Hotels Company Ltd (IHCL) said in a statement. The company had in 2022 announced 'Ahvaan 2025', under which it looked to re-engineer its margins, re-imagine its brandscape and restructure its portfolio. It had set a target to build a portfolio of 300 hotels, clock 33 per cent EBITDA margin with 35 per cent EBITDA share contribution from new businesses and management fees by FY 2025-26. With India's rising affluence and growing appetite for travel, IHCL will tap into emerging segments with newer offerings like upscale full-service hotels, IHCL Executive Vice President, Real Estate \u0026 Development, Suma Venkatesh said. \"Our next phase of growth will also be marked by harnessing our existing partnerships for multi-hotel projects,\" Venkatesh added. She further said, \"With the pace of growth increasing year on year, FY 2024 set new benchmarks with 52 signings, one contract a week. Of this, our recent strategic alliance with 'Tree of Life' resorts contributed 14 new hotels to the portfolio.\" This year IHCL had signed new projects in international locations like Dhaka, Bhutan, Nepal, and Frankfurt. In the domestic market, its signings included large format hotels at International airports in New Delhi, Cochin, and MOPA Goa besides leisure and spiritual portfolio across locations like Alibaug, Bekal, Naukuchiatal, Ayodhya, and Haridwar, Venkatesh said. IHCL and its subsidiaries operate a group of hospitality brands including the Taj, SeleQtions, Vivanta, and Ginger. ","cleaned_content":"tata group hospitality firm indian hotels company ltd on thursday said its addition of hotels is set to accelerate over the next few years with over \u003cNINE_TEN\u003e new properties in the pipeline in fy24 the company had another year of accelerated portfolio expansion with \u003cFIVE_TEN\u003e signings and \u003cTHREE_TEN\u003e openings and achieved a portfolio of over \u003cTHREE_HUNDRED\u003e hotels ahead of its market guidance under ahvaan \u003cTWO_THOUSAND\u003e indian hotels company ltd ihcl said in a statement the company had in \u003cTWO_THOUSAND\u003e announced ahvaan \u003cTWO_THOUSAND\u003e under which it looked to re engineer its margins re imagine its brandscape and restructure its portfolio it had set a target to build a portfolio of \u003cTHREE_HUNDRED\u003e hotels clock \u003cTHREE_TEN_PERCENT\u003e ebitda margin with \u003cTHREE_TEN_PERCENT\u003e ebitda share contribution from new businesses and management fees by fy \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e with indias rising affluence and growing appetite for travel ihcl will tap into emerging segments with newer offerings like upscale full service hotels ihcl executive vice president real estate development suma venkatesh said our next phase of growth will also be marked by harnessing our existing partnerships for multi hotel projects venkatesh added she further said with the pace of growth increasing year on year fy \u003cTWO_THOUSAND\u003e set new benchmarks with \u003cFIVE_TEN\u003e signings one contract a week of this our recent strategic alliance with tree of life resorts contributed \u003cONE_TEN\u003e new hotels to the portfolio this year ihcl had signed new projects in international locations like dhaka bhutan nepal and frankfurt in the domestic market its signings included large format hotels at international airports in new delhi cochin and mopa goa besides leisure and spiritual portfolio across locations like alibaug bekal naukuchiatal ayodhya and haridwar venkatesh said ihcl and its subsidiaries operate a group of hospitality brands including the taj seleqtions vivanta and ginger","timestamp":"2024-03-28T17:12:00+05:30","market_timestamp":"2024-03-29T09:15:00+05:30","off_market_hours":true}