{"url":"https://www.moneycontrol.com/news/business/hyundai-sales-up-7-in-march-reports-highest-ever-sales-at-777876-units-in-fy-24-12554441.html","title":"Hyundai sales up 7% in March; reports highest-ever sales at 7,77,876 units in FY '24","description":"The company sold a total of 61,500 units in March 2023, Hyundai Motor India said in a statement.Hyundai sales up 7% in March; reports highest-ever sales at 7,77,876 units in FY '24","content":"Hyundai Motor India on Monday reported a 7 per cent year-on-year increase in total sales at 65,601 units in March. The company sold a total of 61,500 units in March 2023, Hyundai Motor India said in a statement. Domestic dispatch of vehicles to dealers saw an increase of 5 per cent to 53,001 units last month, from 50,600 units in the year-ago period, according to the statement. For 2023-24 fiscal, the company recorded its best-ever sales at 7,77,876 units, an increase of 8 per cent, over 7,20,565 units in the 2022-23 financial year. In the domestic market, the auto major dispatched 6,14,721 units to its dealers, an increase of 8 per cent, as against 5,67,546 units in FY 2022-23. Exports rose 7 per cent to 1,63,155 units, as compared to 1,53, 019 units in the 2022-23 fiscal. Hyundai Motor India COO Tarun Garg said FY 23-24 sales number of 7.77 lakh units is a testimony to the great acceptance of the company's diverse product line-up. \"In the domestic market, company sales surged by 8.3 per cent in 2023-24, against the previous year. These are the highest sales reported by the automaker since inception,\" he added. ","cleaned_content":"hyundai motor india on monday reported a \u003cSEVEN_PERCENT\u003e year on year increase in total sales at \u003cSIX_TEN_THOUSAND\u003e units in march the company sold a total of \u003cSIX_TEN_THOUSAND\u003e units in march \u003cTWO_THOUSAND\u003e hyundai motor india said in a statement domestic dispatch of vehicles to dealers saw an increase of \u003cFIVE_PERCENT\u003e to \u003cFIVE_TEN_THOUSAND\u003e units last month from \u003cFIVE_TEN_THOUSAND\u003e units in the year ago period according to the statement for \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fiscal the company recorded its best ever sales at \u003cSEVEN_HUNDRED_THOUSAND\u003e units an increase of \u003cEIGHT_PERCENT\u003e over \u003cSEVEN_HUNDRED_THOUSAND\u003e units in the \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e financial year in the domestic market the auto major dispatched \u003cSIX_HUNDRED_THOUSAND\u003e units to its dealers an increase of \u003cEIGHT_PERCENT\u003e as against \u003cFIVE_HUNDRED_THOUSAND\u003e units in fy \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e exports rose \u003cSEVEN_PERCENT\u003e to \u003cONE_HUNDRED_THOUSAND\u003e units as compared to \u003cONE_HUNDRED\u003e \u003cONE_TEN\u003e units in the \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fiscal hyundai motor india coo tarun garg said fy \u003cTWO_TEN\u003e \u003cTWO_TEN\u003e sales number of \u003cSEVEN_\u003e lakh units is a testimony to the great acceptance of the companys diverse product line up in the domestic market company sales surged by \u003cEIGHT_PERCENT\u003e in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e against the previous year these are the highest sales reported by the automaker since inception he added","timestamp":"2024-04-01T19:54:00+05:30","market_timestamp":"2024-04-02T09:15:00+05:30","off_market_hours":true}