{"url":"https://www.moneycontrol.com/news/business/volkswagen-to-kick-off-electrification-journey-in-india-later-this-year-with-id-4-launch-12501361.html","title":"Volkswagen to kick off electrification journey in India later this year with ID.4 launch","description":"The company, which unveiled the ID.4, expects the Indian passenger vehicles market to grow 5-7 per cent this year while it is targeting 10-15 per cent growth for itself.Volkswagen ID.4Related stories","content":"German automaker Volkswagen has unveiled the maiden electric vehicle (EV) in India, the Volkswagen ID.4, which is expected to be launched in the fourth quarter of the calendar year (CY) 2024. The Volkswagen ID.4 will be brought into the Indian market as a completely built-up (CBU) model and will be initially available in a single configuration. Globally, the Volkswagen ID.4 gets multiple powertrain options, including single-motor rear-wheel-drive and dual-motor all-wheel-drive, in the international markets. The EV has a claimed range of up to 480km on a single full charge. \"Our first step to the electrification journey in India begins with the ID.4...,\" executive director sales international operations, Volkswagen Passenger Cars Michael Mayer said at the Volkswagen annual brand conference. He said the ID.4 is being brought in as part of the company's global efforts of mass electrification. At present, the German carmaker offers Internal Combustion Engine (ICE) models like the Virtus mid-size sedan, Taigun mid-size SUV and the Tiguan premium SUV in India. Globally, VW is leading in the electrification journey, Mayer said, adding, as part of the company's commitment to the Paris Climate Agreement 2030, it is continuing efforts in various spheres, including the development of charging infrastructure that's key to acceptance of EVs, recycling ofbatteries, digitalisation and connectivity solutions. The company is offering different products from ID.2 to ID. Buzz globally targeting several segments of customers, Mayer said, adding that globally, VW's electric vehicle (EV) sales grew 21% at around 4 lakh units in 2023. One of the brand’s most popular EVs in the global market, the ID.4 is offered in multiple trims worldwide and sits below the ID.3 hatchback in the brand’s global portfolio. The car will be Volkswagen’s first BEV to be offered for sale in India. Volkswagen previously showcased the ID.4 GTX in India at their annual brand conference in 2023. \"This is not the end of the story. It is our goal to take this success to other markets,\" Mayer said. However, he added, \"This would be a phased approach, wherein we will strengthen our current portfolio on the basis of brand positioning for the market.\" \"India, needless to say, continues to be a key market for Volkswagen. India is a 4 million car market now and is expected to grow 5-7% this year,\" he asserted. The Indian automotive industry is now ranked third in the world even surpassing Japan, Mayer said, adding, \"Who would have thought it ten years back?\" He said VW is committed to the Indian market and the company will continue to introduce its premium products over the next few years. Volkswagen Passenger Cars India brand director Ashish Gupta said the company's sales grew 8% in 2023. The company had sold around 44,000 units. \"Our target this year in 2024 is to increase it by 10-15%,\" he added. The company will continue to expand its sales and service network to tap opportunities coming from Tier II and Tier III cities. He said the company is targeting to have a presence in 170 cities with 230 sales and pre-owned car touch points along with 150 service centres in 2024. Last year, it had set up 45 sales and service touch points, he said, adding that at present, the company has 193 sales and pre-owned car sales touch points and 145 service centres in 145 cities. (With inputs from Reuters) ","cleaned_content":"german automaker volkswagen has unveiled the maiden electric vehicle ev in india the volkswagen id 4 which is expected to be launched in the fourth quarter of the calendar year cy \u003cTWO_THOUSAND\u003e the volkswagen id 4 will be brought into the indian market as a completely built up cbu model and will be initially available in a single configuration globally the volkswagen id 4 gets multiple powertrain options including single motor rear wheel drive and dual motor all wheel drive in the international markets the ev has a claimed range of up to \u003cFOUR_HUNDRED\u003e km on a single full charge our first step to the electrification journey in india begins with the id 4 executive director sales international operations volkswagen passenger cars michael mayer said at the volkswagen annual brand conference he said the id 4 is being brought in as part of the companys global efforts of mass electrification at present the german carmaker offers internal combustion engine ice models like the virtus mid size sedan taigun mid size suv and the tiguan premium suv in india globally vw is leading in the electrification journey mayer said adding as part of the companys commitment to the paris climate agreement \u003cTWO_THOUSAND\u003e it is continuing efforts in various spheres including the development of charging infrastructure thats key to acceptance of evs recycling ofbatteries digitalisation and connectivity solutions the company is offering different products from id 2 to id buzz globally targeting several segments of customers mayer said adding that globally vws electric vehicle ev sales grew \u003cTWO_TEN_PERCENT\u003e at around \u003cFOUR_\u003e lakh units in \u003cTWO_THOUSAND\u003e one of the brand s most popular evs in the global market the id 4 is offered in multiple trims worldwide and sits below the id 3 hatchback in the brand s global portfolio the car will be volkswagen s first bev to be offered for sale in india volkswagen previously showcased the id 4 gtx in india at their annual brand conference in \u003cTWO_THOUSAND\u003e this is not the end of the story it is our goal to take this success to other markets mayer said however he added this would be a phased approach wherein we will strengthen our current portfolio on the basis of brand positioning for the market india needless to say continues to be a key market for volkswagen india is a \u003cFOUR_\u003e million car market now and is expected to grow \u003cFIVE_\u003e \u003cSEVEN_PERCENT\u003e this year he asserted the indian automotive industry is now ranked third in the world even surpassing japan mayer said adding who would have thought it ten years back he said vw is committed to the indian market and the company will continue to introduce its premium products over the next few years volkswagen passenger cars india brand director ashish gupta said the companys sales grew \u003cEIGHT_PERCENT\u003e in \u003cTWO_THOUSAND\u003e the company had sold around \u003cFOUR_TEN_THOUSAND\u003e units our target this year in \u003cTWO_THOUSAND\u003e is to increase it by \u003cONE_TEN\u003e \u003cONE_TEN_PERCENT\u003e he added the company will continue to expand its sales and service network to tap opportunities coming from tier ii and tier iii cities he said the company is targeting to have a presence in \u003cONE_HUNDRED\u003e cities with \u003cTWO_HUNDRED\u003e sales and pre owned car touch points along with \u003cONE_HUNDRED\u003e service centres in \u003cTWO_THOUSAND\u003e last year it had set up \u003cFOUR_TEN\u003e sales and service touch points he said adding that at present the company has \u003cONE_HUNDRED\u003e sales and pre owned car sales touch points and \u003cONE_HUNDRED\u003e service centres in \u003cONE_HUNDRED\u003e cities with inputs from reuters","timestamp":"2024-03-21T23:39:00+05:30","market_timestamp":"2024-03-22T09:15:00+05:30","off_market_hours":true}