{"url":"https://www.moneycontrol.com/news/business/aurobindo-pharma-commissions-four-plants-in-andhra-pradesh-including-pen-g-facility-12553371.html","title":"Aurobindo Pharma commissions four plants in Andhra Pradesh including Pen-G facility","description":"Penicillin-G (Pen-G) facility, located in a SEZ at Kakinada in Andhra Pradesh, has a production capacity of 15,000 tonne per annum and also 1.8 lakh tonne of gulcose, while 6-Amino Penicillanic Acid plant has a capacity to produce 3,600 tonne annually, the drug maker said in a press release.Aurobindo Pharma commissions four plants in Andhra Pradesh including Pen-G facility","content":"Aurobindo Pharma on Monday said it has commissioned four state-of-the-art manufacturing facilities for Penicillin-G, 6-Amino Penicillanic Acid (6-APA), Injectable products and Granulation, through its wholly owned subsidiaries. Penicillin-G (Pen-G) facility, located in a SEZ at Kakinada in Andhra Pradesh, has a production capacity of 15,000 tonne per annum and also 1.8 lakh tonne of gulcose, while 6-Amino Penicillanic Acid plant has a capacity to produce 3,600 tonne annually, the drug maker said in a press release. The Rs 2,400 crore Pen-G plant is expected to start trial production in April and commercial production in a couple of months and the ramping up of the production will happen during the second quarter of the current fiscal, a senior official of the city-based drug maker had earlier said. The injectable plant has the capacity to produce 285 millions of Vials/Ampoules annually and the Granulated products plant will produce 13,200 tonne annually, Aurobindo said. ","cleaned_content":"aurobindo pharma on monday said it has commissioned four state of the art manufacturing facilities for penicillin g \u003cSIX_\u003e amino penicillanic acid \u003cSIX_\u003e apa injectable products and granulation through its wholly owned subsidiaries penicillin g pen g facility located in a sez at kakinada in andhra pradesh has a production capacity of \u003cONE_TEN_THOUSAND\u003e tonne per annum and also \u003cONE_\u003e lakh tonne of gulcose while \u003cSIX_\u003e amino penicillanic acid plant has a capacity to produce \u003cTHREE_THOUSAND\u003e tonne annually the drug maker said in a press release the rs \u003cTWO_THOUSAND\u003e crore pen g plant is expected to start trial production in april and commercial production in a couple of months and the ramping up of the production will happen during the second quarter of the current fiscal a senior official of the city based drug maker had earlier said the injectable plant has the capacity to produce \u003cTWO_HUNDRED\u003e millions of vials ampoules annually and the granulated products plant will produce \u003cONE_TEN_THOUSAND\u003e tonne annually aurobindo said","timestamp":"2024-04-01T11:02:00+05:30","market_timestamp":"2024-04-01T11:02:00+05:30","off_market_hours":false}