{"url":"https://www.moneycontrol.com/news/business/indian-government-rejects-hindustan-zincs-plan-to-split-company-report-12507431.html","title":"Indian government rejects Hindustan Zinc's plan to split company: Report","description":"The Indian government is the largest minority shareholder in Hindustan Zinc, owning a 29.54% stake, but was not consulted by the company when it decided to split the firm to create separate entities for its zinc, lead, silver and recycling business, the government source said requesting anonymity.Indian government rejects Hindustan Zinc's plan to split company: Report","content":"India has rejected a proposal by miner Hindustan Zinc to split the company into different units, a government source aware of the matter said on Friday. The Indian government is the largest minority shareholder in Hindustan Zinc, owning a 29.54% stake, but was not consulted by the company when it decided to split the firm to create separate entities for its zinc, lead, silver and recycling business, the government source said requesting anonymity. Hindustan Zinc had said the plan would unlock \"potential value\" of the company, but the government official said it was unlikely to create value for shareholders. The government's mines ministry, finance ministry and Hindustan Zinc did not immediately respond to requests for comment. In March, the government had opposed another proposal of Hindustan Zinc to buy two Vedanta entities. It had written to the market regulator underscoring its opposition, and the company dropped the plan. Vedanta has a 64.9% stake in Hindustan Zinc. ","cleaned_content":"india has rejected a proposal by miner hindustan zinc to split the company into different units a government source aware of the matter said on friday the indian government is the largest minority shareholder in hindustan zinc owning a \u003cTWO_TEN_PERCENT\u003e stake but was not consulted by the company when it decided to split the firm to create separate entities for its zinc lead silver and recycling business the government source said requesting anonymity hindustan zinc had said the plan would unlock potential value of the company but the government official said it was unlikely to create value for shareholders the governments mines ministry finance ministry and hindustan zinc did not immediately respond to requests for comment in march the government had opposed another proposal of hindustan zinc to buy two vedanta entities it had written to the market regulator underscoring its opposition and the company dropped the plan vedanta has a \u003cSIX_TEN_PERCENT\u003e stake in hindustan zinc","timestamp":"2024-03-22T11:10:00+05:30","market_timestamp":"2024-03-22T11:10:00+05:30","off_market_hours":false}