{"url":"https://www.moneycontrol.com/news/business/markets/mc-inside-edge-bse-bulls-try-to-spin-nse-ipo-story-no-smooth-sailing-street-piggybacks-big-boys-in-wockhardt-operators-turn-wary-of-psus-12551981.html","title":"MC Inside Edge: BSE bulls try to spin NSE IPO story, no smooth SAILing, Street piggybacks big boys in Wockhardt, operators turn wary of PSUs","description":"Know what stocks veteran bulls are eyeing, what the bears are ganging up against, major deals and all the inner goings-on from Dalal StreetOperators are said to be creating a positive buzz around steel stocks.Related stories","content":"Renewed interest The big boys of the HNI club on Dalal Street are back at work in the BSE stock. After a stellar run between June and December last year, BSE's shares had been struggling for direction till a couple of weeks back. The story that BSE will wrest market share from NSE in the F\u0026O segment has already been bought into. The theory being floated now is that the NSE’s IPO is likely to happen this year, and that could trigger another round of re-rating. Institutional holdings have already trebled between March end and December end last year. Bulls among HNIs may be wary of pushing the story too hard unless there are new believers at fund houses. Given the steep appreciation in the stock price, there are enough fund managers looking to take some money off the table.  Operators are said to be creating a positive buzz around steel stocks. It has worked in the case of Tata Steel, but the efforts in SAIL have not paid off so far. Two previous attempts have come a cropper, and a third one is underway. Many are viewing steel as a hope trade, as much depends on which way China’s economy turns. But operators appear to be betting that under ownership of the stock by fund managers may work to their advantage. Booster shot Wockhardt's shares are on a tear after some of the big names of D-Street subscribed to the company’s Rs 480-crore QIP issue. But quite a few reputed investors also stayed away from the issue, saying risk-reward no longer seemed attractive after a near fourfold rise in the stock price in less than a year. That could partly explain why the QIP size was smaller than the figure doing the rounds till last month. Also, skeptics point to the dwindling trading volumes in the stock over the last month. Go slow Operators are said to be cautious of going overboard on PSU stocks, and in fact have been steadily trimming positions which are still hugely profitable. They had anticipated correctly that no major divestments would be announced in the interim Budget. But the Budget coming up in July could well turn out to be a different ball game. Chatter is that the government will most likely increase the size of its divestment target. Good for the government’s book of accounts, but bad news for those holding a lot of PSU stock. ","cleaned_content":"renewed interest the big boys of the hni club on dalal street are back at work in the bse stock after a stellar run between june and december last year bses shares had been struggling for direction till a couple of weeks back the story that bse will wrest market share from nse in the f o segment has already been bought into the theory being floated now is that the nse s ipo is likely to happen this year and that could trigger another round of re rating institutional holdings have already trebled between march end and december end last year bulls among hnis may be wary of pushing the story too hard unless there are new believers at fund houses given the steep appreciation in the stock price there are enough fund managers looking to take some money off the table operators are said to be creating a positive buzz around steel stocks it has worked in the case of tata steel but the efforts in sail have not paid off so far two previous attempts have come a cropper and a third one is underway many are viewing steel as a hope trade as much depends on which way china s economy turns but operators appear to be betting that under ownership of the stock by fund managers may work to their advantage booster shot wockhardts shares are on a tear after some of the big names of d street subscribed to the company s rs \u003cFOUR_HUNDRED\u003e crore qip issue but quite a few reputed investors also stayed away from the issue saying risk reward no longer seemed attractive after a near fourfold rise in the stock price in less than a year that could partly explain why the qip size was smaller than the figure doing the rounds till last month also skeptics point to the dwindling trading volumes in the stock over the last month go slow operators are said to be cautious of going overboard on psu stocks and in fact have been steadily trimming positions which are still hugely profitable they had anticipated correctly that no major divestments would be announced in the interim budget but the budget coming up in july could well turn out to be a different ball game chatter is that the government will most likely increase the size of its divestment target good for the government s book of accounts but bad news for those holding a lot of psu stock","timestamp":"2024-04-01T08:12:00+05:30","market_timestamp":"2024-04-01T09:15:00+05:30","off_market_hours":true}