{"url":"https://www.moneycontrol.com/news/business/wipro-ge-healthcare-to-invest-rs-8000-crore-in-5-years-on-medical-devices-manufacturing-local-rd-12522661.html","title":"Wipro GE Healthcare to invest Rs 8,000 crore in 5 years on medical devices manufacturing, local R\u0026D","description":"The company, a leading global medical technology, pharmaceutical diagnostics, and digital solutions provider, said as a part of the investment, its 'Made in India' PET CT Discovery IQ scanner will be exported to 15 countries.Wipro GE Healthcare to invest Rs 8,000 crore in 5 years on medical devices manufacturing, local R\u0026DRelated stories","content":"Wipro GE Healthcare on Tuesday said it will invest over Rs 8,000 crore in India over the next five years to increase local manufacturing and research and development (R\u0026D) initiatives. The company, a leading global medical technology, pharmaceutical diagnostics, and digital solutions provider, said as a part of the investment, its 'Made in India' PET CT Discovery IQ scanner will be exported to 15 countries. Additionally, locally produced Revolution Aspire CT, Revolution ACT and MR breast coils will be manufactured 'In India for the World', the company said in a statement. Wipro GE Healthcare Chairman Azim Premji said India is riding the resurgent growth in the healthcare industry and rapidly expanding MedTech sector. \"With 'Make in India', we are witnessing an exponential expansion of manufacturing footprint in the country, strengthening India's capability as the MedTech hub of the world. \"Wipro GE Healthcare has been committed to this localisation journey for over three decades and this strategic investment is testament to our vision for this sector,\" added Premji, who is also the Chairman of Wipro Enterprises and the Azim Premji Foundation. GE HealthCare President and CEO Peter J Arduini said India is a high potential, high priority market for GE HealthCare globally. \"In fact, we are among the first MedTech companies to 'Make in India - for India and the World'. We will continue to invest in expanding India's domestic capabilities and its global footprint in MedTech manufacturing and R\u0026D,\" he said. Further, Arduini said, \"Today's announcement is aligned with our strategic vision to deliver precision innovation globally and accelerate India's position as 'MedTech innovation and manufacturing hub for India and for world markets.\" Wipro GE Healthcare Managing Director and President \u0026 CEO, GE HealthCare South Asia Chaitanya Sarawate said, \"As a local partner we are bullish about India's potential and its journey to be 'Atmanirbhar' and a key cog in the resilient global supply chain. \"As India envisions to be among top five global manufacturing hubs in terms of value and technology for medical devices in the coming years, we are committed to the national healthcare agenda.\" At present, Wipro GE Healthcare has four manufacturing plants in Bengaluru. All these plants are export plants and the latest one was established in March 2022, with an investment of a little over Rs 100 crore, under the Indian government's production-linked investment (PLI) Scheme, the company said. Wipro GE Healthcare is a joint venture between GE Precision Healthcare LLC, USA, and Wipro Enterprises Ltd established in 1990. Its operations spread across India, Bangladesh, Sri Lanka, Nepal, Maldives, and Bhutan. ","cleaned_content":"wipro ge healthcare on tuesday said it will invest over rs \u003cEIGHT_THOUSAND\u003e crore in india over the next five years to increase local manufacturing and research and development r d initiatives the company a leading global medical technology pharmaceutical diagnostics and digital solutions provider said as a part of the investment its made in india pet ct discovery iq scanner will be exported to \u003cONE_TEN\u003e countries additionally locally produced revolution aspire ct revolution act and mr breast coils will be manufactured in india for the world the company said in a statement wipro ge healthcare chairman azim premji said india is riding the resurgent growth in the healthcare industry and rapidly expanding medtech sector with make in india we are witnessing an exponential expansion of manufacturing footprint in the country strengthening indias capability as the medtech hub of the world wipro ge healthcare has been committed to this localisation journey for over three decades and this strategic investment is testament to our vision for this sector added premji who is also the chairman of wipro enterprises and the azim premji foundation ge healthcare president and ceo peter j arduini said india is a high potential high priority market for ge healthcare globally in fact we are among the first medtech companies to make in india for india and the world we will continue to invest in expanding indias domestic capabilities and its global footprint in medtech manufacturing and r d he said further arduini said todays announcement is aligned with our strategic vision to deliver precision innovation globally and accelerate indias position as medtech innovation and manufacturing hub for india and for world markets wipro ge healthcare managing director and president ceo ge healthcare south asia chaitanya sarawate said as a local partner we are bullish about indias potential and its journey to be atmanirbhar and a key cog in the resilient global supply chain as india envisions to be among top five global manufacturing hubs in terms of value and technology for medical devices in the coming years we are committed to the national healthcare agenda at present wipro ge healthcare has four manufacturing plants in bengaluru all these plants are export plants and the latest one was established in march \u003cTWO_THOUSAND\u003e with an investment of a little over rs \u003cONE_HUNDRED\u003e crore under the indian governments production linked investment pli scheme the company said wipro ge healthcare is a joint venture between ge precision healthcare llc usa and wipro enterprises ltd established in \u003cONE_THOUSAND\u003e its operations spread across india bangladesh sri lanka nepal maldives and bhutan","timestamp":"2024-03-26T15:03:00+05:30","market_timestamp":"2024-03-26T15:03:00+05:30","off_market_hours":false}