{"url":"https://www.moneycontrol.com/news/business/adani-green-commissions-180-mw-solar-plant-at-devikot-in-rajasthan-12529051.html","title":"Adani Green commissions 180-MW solar plant at Devikot, in Rajasthan","description":"The plant has a 25-year power purchase agreement (PPA) with the Solar Energy Corporation of India (SECI), Adani Green Energy Ltd (AGEL), India's largest renewable energy company, said in a statement.Adani Green commissions 180-MW solar plant at Devikot, in Rajasthan","content":"Adani Green Energy on Wednesday said it has operationalized a 180-MW solar power plant at Devikot in Jaisalmer, Rajasthan. The plant has a 25-year power purchase agreement (PPA) with the Solar Energy Corporation of India (SECI), Adani Green Energy Ltd (AGEL), India's largest renewable energy company, said in a statement. With the successful commissioning of this plant, AGEL's operational solar portfolio has increased to 6,243 MW, and the total operational renewable generation capacity to 9,784 MW, the largest in India, the statement added. Next-generation bifacial solar PV modules and horizontal single-axis solar trackers (HSAT) have been deployed to maximise generation through better efficiency of modules and tracking the sun throughout the day. The plant is equipped with waterless robotic module cleaning systems, enabling water conservation in the barren region of Jaisalmer. The Energy Network Operation Centre (ENOC), anchored in the secured digital cloud platform, enables real-time monitoring of AGEL's renewable energy assets, leading to enhanced operational performance. ","cleaned_content":"adani green energy on wednesday said it has operationalized a \u003cONE_HUNDRED\u003e mw solar power plant at devikot in jaisalmer rajasthan the plant has a \u003cTWO_TEN\u003e year power purchase agreement ppa with the solar energy corporation of india seci adani green energy ltd agel indias largest renewable energy company said in a statement with the successful commissioning of this plant agels operational solar portfolio has increased to \u003cSIX_THOUSAND\u003e mw and the total operational renewable generation capacity to \u003cNINE_THOUSAND\u003e mw the largest in india the statement added next generation bifacial solar pv modules and horizontal single axis solar trackers hsat have been deployed to maximise generation through better efficiency of modules and tracking the sun throughout the day the plant is equipped with waterless robotic module cleaning systems enabling water conservation in the barren region of jaisalmer the energy network operation centre enoc anchored in the secured digital cloud platform enables real time monitoring of agels renewable energy assets leading to enhanced operational performance","timestamp":"2024-03-27T22:12:00+05:30","market_timestamp":"2024-03-28T09:15:00+05:30","off_market_hours":true}