{"url":"https://www.moneycontrol.com/news/business/sony-pictures-networks-india-seeks-to-increase-subscriber-base-revenue-in-fy25-md-ceo-n-p-singh-12566591.html","title":"Sony Pictures Networks India seeks to increase subscriber base, revenue in FY25: MD \u0026 CEO N P Singh","description":"The company will be taking experiences and lessons from FY24, as stepping stones for what lies ahead, he wrote to employees in an internal newsletter.Sony Pictures Networks India seeks to increase subscriber base, revenue in FY25: MD \u0026 CEO N P SinghRelated stories","content":"Sony Pictures Networks India is looking to boost its subscriber base and revenue through impactful content, while looking at strategic partnerships as it gears up to face a challenging fiscal year 2024-25, according to its Managing Director \u0026 CEO N P Singh. The company will be taking experiences and lessons from FY24, as stepping stones for what lies ahead, he wrote to employees in an internal newsletter. \"Heading into FY25, we are gearing up for a challenging year but are ready with creative spirit and strong resolve,\" he said. \"Our strategy emphasises driving organic growth and ramping our market presence through strategic partnerships,\" he said. Reflecting on the fiscal gone by, he said FY24 \"showed our true resilience and teamwork\". \"Tackling challenges head-on made us even stronger, thanks to our solid commitment to leadership and core values,\" he wrote. The experiences and lessons from FY24 are stepping stones for what lies ahead, Singh said. In January this year, Sony had pulled out from the proposed USD 10 billion merger with ZEE Entertainment Enterprises Ltd citing failure to meet certain \"closing conditions\" by the Indian firm. The deal collapsed after over two years of announcing it. Subsequently, the two parties are now locked in legal battles. ","cleaned_content":"sony pictures networks india is looking to boost its subscriber base and revenue through impactful content while looking at strategic partnerships as it gears up to face a challenging fiscal year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e according to its managing director ceo n p singh the company will be taking experiences and lessons from fy24 as stepping stones for what lies ahead he wrote to employees in an internal newsletter heading into fy25 we are gearing up for a challenging year but are ready with creative spirit and strong resolve he said our strategy emphasises driving organic growth and ramping our market presence through strategic partnerships he said reflecting on the fiscal gone by he said fy24 showed our true resilience and teamwork tackling challenges head on made us even stronger thanks to our solid commitment to leadership and core values he wrote the experiences and lessons from fy24 are stepping stones for what lies ahead singh said in january this year sony had pulled out from the proposed usd \u003cONE_TEN\u003e billion merger with zee entertainment enterprises ltd citing failure to meet certain closing conditions by the indian firm the deal collapsed after over two years of announcing it subsequently the two parties are now locked in legal battles","timestamp":"2024-04-03T13:57:00+05:30","market_timestamp":"2024-04-03T13:57:00+05:30","off_market_hours":false}