{"url":"https://www.moneycontrol.com/news/business/voltas-ac-crosses-2-million-unit-sales-mark-in-fy24-12594231.html","title":"Voltas AC crosses 2 million unit sales mark in FY24","description":"The performance was attributed to a consistent demand for cooling products during the year, coupled with a strong offline and online distribution network, and new innovative launches, the Tata Group firm said in a statement.Voltas AC crosses 2 million unit sales mark in FY24Related stories","content":"Leading residential air conditioner maker Voltas said it has recorded a 35 per cent sales growth to over two million units in FY24, becoming the first company in the domestic market to cross this mark. The performance was attributed to a consistent demand for cooling products during the year, coupled with a strong offline and online distribution network, and new innovative launches, the Tata Group firm said in a statement. \"The company achieved over 2 million AC units during this fiscal 2023-24, the highest ever sale of ACs by any brand in a financial year in India, with a volume growth of 35 per cent,\" it added. The Indian residential AC market is estimated to be around 10 million units in FY24 and is expected to grow to 11.5 million units this year. Even during the March quarter, when sales of compressor-based cooling products are low due to convenient temperatures: \"Voltas registered a significant volume growth of 72 per cent in AC sales during Q4 FY24\". The company claimed that with these sales numbers, \"Voltas is the undisputed market leader and has maintained its number one position in the Room Air Conditioner category\". Its MD and CEO Pradeep Bakshi said: \"We believe that our wide presence, focus on the emerging retail channels, excellent distribution network, strong brand equity and attractive consumer offers have helped us to achieve this significant milestone\". Voltas is now further expanding its retail and distribution network to cater to its growing product portfolio. \"The company registered a significant growth in volume in other cooling products, including air cooler and commercial refrigeration products,\" said Voltas. Besides, its home appliances brand Voltas Beko, a JV with Turkish appliances maker Arcelik, also achieved the milestone of selling close to 2 million units in FY24. \"Overall, 5 million consumer products got sold to happy customers across the country by Voltas in FY24,\" it said. ","cleaned_content":"leading residential air conditioner maker voltas said it has recorded a \u003cTHREE_TEN_PERCENT\u003e sales growth to over two million units in fy24 becoming the first company in the domestic market to cross this mark the performance was attributed to a consistent demand for cooling products during the year coupled with a strong offline and online distribution network and new innovative launches the tata group firm said in a statement the company achieved over \u003cTWO_\u003e million ac units during this fiscal \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e the highest ever sale of acs by any brand in a financial year in india with a volume growth of \u003cTHREE_TEN_PERCENT\u003e it added the indian residential ac market is estimated to be around \u003cONE_TEN\u003e million units in fy24 and is expected to grow to \u003cONE_TEN\u003e million units this year even during the march quarter when sales of compressor based cooling products are low due to convenient temperatures voltas registered a significant volume growth of \u003cSEVEN_TEN_PERCENT\u003e in ac sales during q4 fy24 the company claimed that with these sales numbers voltas is the undisputed market leader and has maintained its number one position in the room air conditioner category its md and ceo pradeep bakshi said we believe that our wide presence focus on the emerging retail channels excellent distribution network strong brand equity and attractive consumer offers have helped us to achieve this significant milestone voltas is now further expanding its retail and distribution network to cater to its growing product portfolio the company registered a significant growth in volume in other cooling products including air cooler and commercial refrigeration products said voltas besides its home appliances brand voltas beko a jv with turkish appliances maker arcelik also achieved the milestone of selling close to \u003cTWO_\u003e million units in fy24 overall \u003cFIVE_\u003e million consumer products got sold to happy customers across the country by voltas in fy24 it said","timestamp":"2024-04-08T07:15:00+05:30","market_timestamp":"2024-04-08T09:15:00+05:30","off_market_hours":true}