{"url":"https://www.moneycontrol.com/news/business/natco-pharma-gets-warning-letter-from-usfda-for-telangana-plant-12604881.html","title":"Natco Pharma gets warning letter from USFDA for Telangana plant","description":"The US Food and Drug Administration (USFDA) had issued eight observations under Form 483 after inspecting the company's Kothur-based formulation facility.Natco Pharma gets warning letter from USFDA for Telangana plant","content":"Natco Pharma on Tuesday said it has received a warning letter from the US health regulator for its Telangana-based manufacturing plant. The US Food and Drug Administration (USFDA) had issued eight observations under Form 483 after inspecting the company's Kothur-based formulation facility. The inspection was conducted by USFDA from October 9 to October 18, 2023. The company does not believe that the warning letter will have an impact on supplies or the existing revenues from this facility, it added. \"It may cause delay/withholding of pending product approvals from this site,\" Natco Pharma said. The drug firm will respond to the letter within the stipulated timelines and work closely with the USFDA to address the concerns in a holistic and timely manner to ensure sustained compliance, it said. A warning letter is issued when the US health regulator finds that a manufacturer has significantly violated its regulations. Shares of Natco Pharma were trading 0.5 per cent up at Rs 1,004 a piece on BSE. ","cleaned_content":"natco pharma on tuesday said it has received a warning letter from the us health regulator for its telangana based manufacturing plant the us food and drug administration usfda had issued eight observations under form \u003cFOUR_HUNDRED\u003e after inspecting the companys kothur based formulation facility the inspection was conducted by usfda from october \u003cNINE_\u003e to october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e the company does not believe that the warning letter will have an impact on supplies or the existing revenues from this facility it added it may cause delay withholding of pending product approvals from this site natco pharma said the drug firm will respond to the letter within the stipulated timelines and work closely with the usfda to address the concerns in a holistic and timely manner to ensure sustained compliance it said a warning letter is issued when the us health regulator finds that a manufacturer has significantly violated its regulations shares of natco pharma were trading \u003cZERO_PERCENT\u003e up at rs \u003cONE_THOUSAND\u003e a piece on bse","timestamp":"2024-04-09T12:06:00+05:30","market_timestamp":"2024-04-09T12:06:00+05:30","off_market_hours":false}