{"url":"https://www.moneycontrol.com/news/business/ipo/vishal-mega-mart-said-to-pick-kotak-icici-for-mega-ipo-12594041.html","title":"Vishal Mega Mart said to pick Kotak, ICICI for mega IPO","description":"Vishal Mega Mart chose Kotak Mahindra Bank Ltd. and ICICI Bank Ltd to help arrange a share sale as early as in the fourth quarter of this year, the people said, asking not to be identified because the deliberations are private. Vishal Mega Mart said to pick Kotak, ICICI for mega IPO","content":"Indian supermarket chain Vishal Mega Mart Pvt. has picked banks as it presses ahead with a planned initial public offering in Mumbai this year, according to people familiar with the matter. Vishal Mega Mart chose Kotak Mahindra Bank Ltd. and ICICI Bank Ltd to help arrange a share sale as early as in the fourth quarter of this year, the people said, asking not to be identified because the deliberations are private. It is owned by private equity firms Partners Group Holding AG and Kedaara Capital, and the IPO would allow them to pare their stakes, the people said. Other banks are likely to be added to work on the IPO, the people said. The Gurugram-based company could raise between $850 million to $1 billion in the offering, they said. Partners Group, based in Switzerland, and India-focused private equity firm Kedaara bought Vishal Mega Mart from investment firm TPG Capital in 2018 for an undisclosed amount. Vishal Mega Mart offers a private label, fashion and general merchandise, and food and groceries. India has turned into a booming market for deals including IPOs as global investors seek to tap its growth potential. Automakers, electric-scooter makers and information technology companies are among those considering IPOs this year. ","cleaned_content":"indian supermarket chain vishal mega mart pvt has picked banks as it presses ahead with a planned initial public offering in mumbai this year according to people familiar with the matter vishal mega mart chose kotak mahindra bank ltd and icici bank ltd to help arrange a share sale as early as in the fourth quarter of this year the people said asking not to be identified because the deliberations are private it is owned by private equity firms partners group holding ag and kedaara capital and the ipo would allow them to pare their stakes the people said other banks are likely to be added to work on the ipo the people said the gurugram based company could raise between \u003cEIGHT_HUNDRED\u003e million to \u003cONE_\u003e billion in the offering they said partners group based in switzerland and india focused private equity firm kedaara bought vishal mega mart from investment firm tpg capital in \u003cTWO_THOUSAND\u003e for an undisclosed amount vishal mega mart offers a private label fashion and general merchandise and food and groceries india has turned into a booming market for deals including ipos as global investors seek to tap its growth potential automakers electric scooter makers and information technology companies are among those considering ipos this year","timestamp":"2024-04-08T06:39:00+05:30","market_timestamp":"2024-04-08T09:15:00+05:30","off_market_hours":true}