{"url":"https://www.moneycontrol.com/news/business/markets/four-of-top-10-valued-firms-add-rs-1-71-lakh-crore-to-mcap-hdfc-bank-lic-lead-gainers-12590481.html","title":"Four of top 10 valued firms add Rs 1.71 lakh crore to mcap; HDFC Bank, LIC lead gainers","description":"Reliance Industries remained the most valued domestic firm by market valuation followed by TCS, HDFC Bank, ICICI Bank, State Bank of India, Bharti Airtel, LIC, Infosys, ITC and Hindustan Unilever.Last week, the BSE benchmark climbed 596.87 or 0.81 per cent. It hit an all-time high of 74,501.73 on April 4.Related stories","content":"Four of the top 10 valued firms added Rs 1,71,309.28 crore to their market valuation last week with HDFC Bank and Life Insurance Corporation of India (LIC) emerging as the biggest gainers in line with an overall positive trend in equities. On the other hand, six companies from the top 10 pack took a Rs 78,127.48 crore hit to their market valuation with index major Reliance Industries accounting for the majority of the losses. Last week, the BSE benchmark climbed 596.87 or 0.81 per cent. It hit an all-time high of 74,501.73 on April 4. While Tata Consultancy Services (TCS), HDFC Bank, State Bank of India and LIC were the gainers from the top 10 pack, Reliance Industries, ICICI Bank, Bharti Airtel, Infosys, ITC and Hindustan Unilever faced losses in their valuation. The market valuation of HDFC Bank jumped Rs 76,880.74 crore to reach Rs 11,77,065.34 crore. LIC added Rs 49,208.48 crore, taking its valuation to Rs 6,27,692.77 crore. The mcap of Bharti Airtel eroded by Rs 21,206.58 crore to Rs 6,73,831.90 crore and that of ICICI Bank dived Rs 9,458.25 crore to Rs 7,60,084.40 crore. The market valuation of Infosys declined by Rs 7,996.54 crore to Rs 6,14,120.84 crore and that of ITC dipped by Rs 873.93 crore to Rs 5,34,158.81 crore. The mcap of Hindustan Unilever went lower by Rs 129.23 crore to Rs 5,32,816.81 crore. Reliance Industries remained the most valued domestic firm by market valuation followed by TCS, HDFC Bank, ICICI Bank, State Bank of India, Bharti Airtel, LIC, Infosys, ITC and Hindustan Unilever. ","cleaned_content":"four of the top \u003cONE_TEN\u003e valued firms added rs \u003cONE_HUNDRED_THOUSAND\u003e crore to their market valuation last week with hdfc bank and life insurance corporation of india lic emerging as the biggest gainers in line with an overall positive trend in equities on the other hand six companies from the top \u003cONE_TEN\u003e pack took a rs \u003cSEVEN_TEN_THOUSAND\u003e crore hit to their market valuation with index major reliance industries accounting for the majority of the losses last week the bse benchmark climbed \u003cFIVE_HUNDRED\u003e or \u003cZERO_PERCENT\u003e it hit an all time high of \u003cSEVEN_TEN_THOUSAND\u003e on april \u003cFOUR_\u003e while tata consultancy services tcs hdfc bank state bank of india and lic were the gainers from the top \u003cONE_TEN\u003e pack reliance industries icici bank bharti airtel infosys itc and hindustan unilever faced losses in their valuation the market valuation of hdfc bank jumped rs \u003cSEVEN_TEN_THOUSAND\u003e crore to reach rs \u003cONE_MILLION\u003e crore lic added rs \u003cFOUR_TEN_THOUSAND\u003e crore taking its valuation to rs \u003cSIX_HUNDRED_THOUSAND\u003e crore the mcap of bharti airtel eroded by rs \u003cTWO_TEN_THOUSAND\u003e crore to rs \u003cSIX_HUNDRED_THOUSAND\u003e crore and that of icici bank dived rs \u003cNINE_THOUSAND\u003e crore to rs \u003cSEVEN_HUNDRED_THOUSAND\u003e crore the market valuation of infosys declined by rs \u003cSEVEN_THOUSAND\u003e crore to rs \u003cSIX_HUNDRED_THOUSAND\u003e crore and that of itc dipped by rs \u003cEIGHT_HUNDRED\u003e crore to rs \u003cFIVE_HUNDRED_THOUSAND\u003e crore the mcap of hindustan unilever went lower by rs \u003cONE_HUNDRED\u003e crore to rs \u003cFIVE_HUNDRED_THOUSAND\u003e crore reliance industries remained the most valued domestic firm by market valuation followed by tcs hdfc bank icici bank state bank of india bharti airtel lic infosys itc and hindustan unilever","timestamp":"2024-04-07T10:58:00+05:30","market_timestamp":"2024-04-08T09:15:00+05:30","off_market_hours":true}