{"url":"https://www.moneycontrol.com/news/business/investor-funding-in-edtech-drives-behaviour-which-is-not-good-for-industry-byjus-aakash-ceo-12605501.html","title":"Investor funding in edtech drives behaviour which is not good for industry: Byju's Aakash CEO","description":"Speaking to PTI, Mehrotra also said that digital alone can't meet aspirations of medical and engineering students looking to get into premium institutions, and it is important to address requirement of new learners.Investor funding in edtech drives behaviour which is not good for industry: Byju's Aakash CEORelated stories","content":"Investors' funding in the edtech space is driving an unwarranted behaviour which is not good for the industry, Byju's Aakash Education Services Ltd (AESL) Managing Director and CEO Deepak Mehrotra has said. Speaking to PTI, Mehrotra also said that digital alone can't meet aspirations of medical and engineering students looking to get into premium institutions, and it is important to address requirement of new learners. \"Investors' funding is very clearly driving behaviours which are not good for anyone, I only hope sanity prevails,\" said Mehrotra who was appointed AESL's CEO on Monday. During the edtech's growth stage, several brick-and-mortar test preparatory firms entered the online space, while online education firms added brick-and-mortar centres. Mehrotra said digital alone is not enough to address the requirement of students preparing for high stake examinations. \"If a learner that you are talking to is preparing to pick up premier Indian institution, be it medical or engineering, it needs long learning. I am completely convinced it cannot be done digitally alone,\" he said. He, however, said that the digital medium is required to address the need of new learners who are more of digital natives. Mehrotra said that his company will look at reaching out to digital natives in the language of their choice by increasing the component of digital in the system at AESL. Referring to Manipal Group's Ranjan Pai's investment in AESL, Mehrotra said he has joined the company at a time when entrepreneurs with solid credentials of having built institutions that have been delivering core higher education for decades, have put their might behind the company. The position of CEO at Aakash had been vacant after Abhishek Maheshwari resigned from the company in September 2023. With over 35 years of experience in executive roles, Mehrotra has worked across FMCG, telecom, and education industries. Prior to joining AESL, he was the managing director at Ashirvad Pipes. He has also worked at Pearson India, Bharti Airtel, Coca-Cola, and Asian Paints. An electrical engineering graduate from IIT Roorkee, Mehrotra has also completed an executive programme from The Wharton School, Philadelphia (USA). ","cleaned_content":"investors funding in the edtech space is driving an unwarranted behaviour which is not good for the industry byjus aakash education services ltd aesl managing director and ceo deepak mehrotra has said speaking to pti mehrotra also said that digital alone cant meet aspirations of medical and engineering students looking to get into premium institutions and it is important to address requirement of new learners investors funding is very clearly driving behaviours which are not good for anyone i only hope sanity prevails said mehrotra who was appointed aesls ceo on monday during the edtechs growth stage several brick and mortar test preparatory firms entered the online space while online education firms added brick and mortar centres mehrotra said digital alone is not enough to address the requirement of students preparing for high stake examinations if a learner that you are talking to is preparing to pick up premier indian institution be it medical or engineering it needs long learning i am completely convinced it cannot be done digitally alone he said he however said that the digital medium is required to address the need of new learners who are more of digital natives mehrotra said that his company will look at reaching out to digital natives in the language of their choice by increasing the component of digital in the system at aesl referring to manipal groups ranjan pais investment in aesl mehrotra said he has joined the company at a time when entrepreneurs with solid credentials of having built institutions that have been delivering core higher education for decades have put their might behind the company the position of ceo at aakash had been vacant after abhishek maheshwari resigned from the company in september \u003cTWO_THOUSAND\u003e with over \u003cTHREE_TEN\u003e years of experience in executive roles mehrotra has worked across fmcg telecom and education industries prior to joining aesl he was the managing director at ashirvad pipes he has also worked at pearson india bharti airtel coca cola and asian paints an electrical engineering graduate from iit roorkee mehrotra has also completed an executive programme from the wharton school philadelphia usa","timestamp":"2024-04-09T12:29:00+05:30","market_timestamp":"2024-04-09T12:29:00+05:30","off_market_hours":false}