{"url":"https://www.moneycontrol.com/news/business/hsbc-helps-funds-navigate-indias-bond-market-as-inclusion-nears-12594831.html","title":"HSBC helps funds navigate India’s bond market as inclusion nears","description":"The bank is among custodians helping global investors with registration and other formalities as they gear up for the nation’s sovereign debt to be added to JPMorgan Chase \u0026 Co.’s emerging-market gauge from June.HSBC helps funds navigate India’s bond market as inclusion nearsRelated stories","content":"HSBC Holdings Plc is engaging with over 200 overseas funds to help establish their presence in India ahead of the nation’s entry into global debt indexes. The bank is among custodians helping global investors with registration and other formalities as they gear up for the nation’s sovereign debt to be added to JPMorgan Chase \u0026 Co.’s emerging-market gauge from June. “Getting the bond index inclusion is starting of the journey,” Anita Mishra, head of markets and securities services for HSBC India, said in an interview last week. The bank is holding road shows, meeting funds in London, Hong Kong and the US, to “get the India story out there”.  As passive money starts to flow in most investors will need help with “onboarding onshore”, making it a “single biggest focus” for the bank, Mishra said. Foreigners have poured in nearly $10 billion into the nation’s index-eligible bonds since the JPMorgan’s announcement in September. The purchases have helped make the securities the best performers in local currency emerging Asia debt so far in 2024, according to data compiled by Bloomberg. Market AccessibilityInvestors have cited several obstacles to obtaining an onshore permit in India, including heavy documentation process, margin requirements for trading, barriers to freely move money out of the country. FTSE Russell recently held off from adding India to its emerging market index, but acknowledged progress in “the accessibility” of the market. The regulator has introduced a common application form for foreign investors and allowed use of digital signatures among others. Bloomberg Index Services Ltd. will also start including India to its emerging markets index from January. Bloomberg LP is the parent company of Bloomberg Index Services, which administers indexes that compete with those from other providers. ","cleaned_content":"hsbc holdings plc is engaging with over \u003cTWO_HUNDRED\u003e overseas funds to help establish their presence in india ahead of the nation s entry into global debt indexes the bank is among custodians helping global investors with registration and other formalities as they gear up for the nation s sovereign debt to be added to jpmorgan chase co s emerging market gauge from june getting the bond index inclusion is starting of the journey anita mishra head of markets and securities services for hsbc india said in an interview last week the bank is holding road shows meeting funds in london hong kong and the us to get the india story out there as passive money starts to flow in most investors will need help with onboarding onshore making it a single biggest focus for the bank mishra said foreigners have poured in nearly \u003cONE_TEN\u003e billion into the nation s index eligible bonds since the jpmorgan s announcement in september the purchases have helped make the securities the best performers in local currency emerging asia debt so far in \u003cTWO_THOUSAND\u003e according to data compiled by bloomberg market accessibilityinvestors have cited several obstacles to obtaining an onshore permit in india including heavy documentation process margin requirements for trading barriers to freely move money out of the country ftse russell recently held off from adding india to its emerging market index but acknowledged progress in the accessibility of the market the regulator has introduced a common application form for foreign investors and allowed use of digital signatures among others bloomberg index services ltd will also start including india to its emerging markets index from january bloomberg lp is the parent company of bloomberg index services which administers indexes that compete with those from other providers","timestamp":"2024-04-08T09:15:00+05:30","market_timestamp":"2024-04-08T09:15:00+05:30","off_market_hours":false}