{"url":"https://www.moneycontrol.com/news/business/indosol-solar-aims-to-complete-rs-15000-crore-ingot-to-module-unit-by-2025-12574401.html","title":"Indosol Solar aims to complete Rs 15,000 crore ingot to module unit by 2025","description":"Under the phase-1, Indosol Solar is investing Rs 15,000 crore to set up 5 gigawatts (GW) of modules, 5 GW wafers, 5 GW ingot, and 5 GW of glass capacities at the upcoming plant at Nellore, near Ramayapatnam port in Andhra Pradesh, he said.Indosol Solar aims to complete Rs 15,000 crore ingot to module unit by 2025Related stories","content":"Indosol Solar aims to complete phase-1 of its multi-crore integrated solar module project in Andhra Pradesh by 2025, said Sharat Chandra, CEO of parent SSEL Group, on Thursday. Under the phase-1, Indosol Solar is investing Rs 15,000 crore to set up 5 gigawatts (GW) of modules, 5 GW wafers, 5 GW ingot, and 5 GW of glass capacities at the upcoming plant at Nellore, near Ramayapatnam port in Andhra Pradesh, he said. On the timeline of phase-1, Chandra said it will be completed by 2025. The project is part of the government of India's PLI Scheme for the solar sector. The entire project is of 30 GW upstream capacity along with a 20 GW downstream capacity. It is part of the government's PLI scheme for the solar industry, Chandra said without sharing the entire project cost. Once completed, it will be the world's first fully integrated quartz-to-module manufacturing plant which will produce TOPCon (Tunnel Oxide Passivated Contact) and HJT (Heterojunction Technology) modules. The entire project is expected to be completed by 2028, and aims to create 32,000 direct and indirect direct employment opportunities, Chandra added. Established in 1994 as a transformer repairing company, SSEL Group has over the years grown to become India's largest transformer manufacturing company. It is also into setting up of transmission projects on an EPC basis, besides hydro and green energy projects. It employs around 5,000 people and reported a revenue of Rs 2,680 crore in FY 2022-23. ","cleaned_content":"indosol solar aims to complete phase \u003cONE_\u003e of its multi crore integrated solar module project in andhra pradesh by \u003cTWO_THOUSAND\u003e said sharat chandra ceo of parent ssel group on thursday under the phase \u003cONE_\u003e indosol solar is investing rs \u003cONE_TEN_THOUSAND\u003e crore to set up \u003cFIVE_\u003e gigawatts gw of modules \u003cFIVE_\u003e gw wafers \u003cFIVE_\u003e gw ingot and \u003cFIVE_\u003e gw of glass capacities at the upcoming plant at nellore near ramayapatnam port in andhra pradesh he said on the timeline of phase \u003cONE_\u003e chandra said it will be completed by \u003cTWO_THOUSAND\u003e the project is part of the government of indias pli scheme for the solar sector the entire project is of \u003cTHREE_TEN\u003e gw upstream capacity along with a \u003cTWO_TEN\u003e gw downstream capacity it is part of the governments pli scheme for the solar industry chandra said without sharing the entire project cost once completed it will be the worlds first fully integrated quartz to module manufacturing plant which will produce topcon tunnel oxide passivated contact and hjt heterojunction technology modules the entire project is expected to be completed by \u003cTWO_THOUSAND\u003e and aims to create \u003cTHREE_TEN_THOUSAND\u003e direct and indirect direct employment opportunities chandra added established in \u003cONE_THOUSAND\u003e as a transformer repairing company ssel group has over the years grown to become indias largest transformer manufacturing company it is also into setting up of transmission projects on an epc basis besides hydro and green energy projects it employs around \u003cFIVE_THOUSAND\u003e people and reported a revenue of rs \u003cTWO_THOUSAND\u003e crore in fy \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e","timestamp":"2024-04-04T13:03:00+05:30","market_timestamp":"2024-04-04T13:03:00+05:30","off_market_hours":false}