{"url":"https://www.moneycontrol.com/news/business/astrazeneca-daiichi-drug-gets-broad-tumor-approval-in-us-12599311.html","title":"AstraZeneca, Daiichi drug gets broad tumor approval in US","description":"The US Food and Drug Administration cleared the medicine for patients who have HER2-positive solid tumors that have spread or can’t be removed with surgery, the company said. These patients have already received prior treatment and don’t have any good alternatives. AstraZeneca, Daiichi drug gets broad tumor approval in US","content":"AstraZeneca Plc and Daiichi Sankyo’s Enhertu has become the first drug of its kind to be granted approval to treat tumors anywhere in the body if patients test positive for a protein known to speed up cancer growth. The US Food and Drug Administration cleared the medicine for patients who have HER2-positive solid tumors that have spread or can’t be removed with surgery, the company said. These patients have already received prior treatment and don’t have any good alternatives. Enhertu is the first in a promising new class of drugs called antibody drug conjugates to win such a broad clearance. These therapies deliver high medicine doses directly to tumors while minimizing damage to surrounding tissues. The field has attracted drugmakers including Pfizer Inc. and Johnson \u0026 Johnson. “This approval also elevates the importance of testing for biomarkers,” Dave Fredrickson, executive vice president of Astra’s oncology unit, said in a statement. Enhertu, a joint effort between Astra and Japan’s Daiichi, is already approved for multiple other indications including breast, lung and gastric cancers. Speaking at the company’s earnings in February, Fredrickson pointed to further opportunities for Enhertu sales to grow both in the US and Europe. ","cleaned_content":"astrazeneca plc and daiichi sankyo s enhertu has become the first drug of its kind to be granted approval to treat tumors anywhere in the body if patients test positive for a protein known to speed up cancer growth the us food and drug administration cleared the medicine for patients who have her2 positive solid tumors that have spread or can t be removed with surgery the company said these patients have already received prior treatment and don t have any good alternatives enhertu is the first in a promising new class of drugs called antibody drug conjugates to win such a broad clearance these therapies deliver high medicine doses directly to tumors while minimizing damage to surrounding tissues the field has attracted drugmakers including pfizer inc and johnson johnson this approval also elevates the importance of testing for biomarkers dave fredrickson executive vice president of astra s oncology unit said in a statement enhertu a joint effort between astra and japan s daiichi is already approved for multiple other indications including breast lung and gastric cancers speaking at the company s earnings in february fredrickson pointed to further opportunities for enhertu sales to grow both in the us and europe","timestamp":"2024-04-08T14:57:00+05:30","market_timestamp":"2024-04-08T14:57:00+05:30","off_market_hours":false}