{"url":"https://www.moneycontrol.com/news/business/tech-mahindra-aveva-centre-of-excellence-in-pune-to-spur-digital-adoption-12567851.html","title":"Tech Mahindra-AVEVA centre of excellence in Pune to spur digital adoption","description":"The CoE was inaugurated on Wednesday in the presence of Emon Zaman, Senior Vice President, Asia Pacific, AVEVA, and Narasimham RV, President, Engineering Services, Tech Mahindra.Tech Mahindra-AVEVA centre of excellence in Pune to spur digital adoptionRelated stories","content":"Tech Mahindra in collaboration with British IT consulting company AVEVA has established a Centre of Excellence (CoE) at its Pune campus to help industries accelerate their digital adoption process and enhance performance. The CoE was inaugurated on Wednesday in the presence of Emon Zaman, Senior Vice President, Asia Pacific, AVEVA, and Narasimham RV, President, Engineering Services, Tech Mahindra. The centre will create digital transformation solutions for industry-specific use cases, Tech Mahindra said in a statement. It further said the solutions will help industries such as oil and gas, energy, power and utilities, infrastructure, mining, metal minerals, and manufacturing to accelerate the digital adoption process and enhance performance. \"It is estimated that the worldwide digital transformation spending will reach nearly USD 3.9 trillion in 2027. However, industries like oil \u0026 gas, mining, and manufacturing continue to face legacy infrastructure challenges resulting in the slow adoption of new digital solutions that can help improve their efficiency and quality. In this direction, our CoE will develop next-gen solutions to accelerate digital adoption within these sectors, offering relevant analytics and business outcomes,\" Narasimham RV said. The CoE will leverage technologies like industrial internet of things (IIoT), digital twin technology, cloud infrastructure, and connected worker platforms to enable efficient plant engineering through data management, asset performance management, and smart factory processes for enterprises. Part of the Mahindra Group, Tech Mahindra is a Pune-based IT services and consultation firm. ","cleaned_content":"tech mahindra in collaboration with british it consulting company aveva has established a centre of excellence coe at its pune campus to help industries accelerate their digital adoption process and enhance performance the coe was inaugurated on wednesday in the presence of emon zaman senior vice president asia pacific aveva and narasimham rv president engineering services tech mahindra the centre will create digital transformation solutions for industry specific use cases tech mahindra said in a statement it further said the solutions will help industries such as oil and gas energy power and utilities infrastructure mining metal minerals and manufacturing to accelerate the digital adoption process and enhance performance it is estimated that the worldwide digital transformation spending will reach nearly usd \u003cTHREE_\u003e trillion in \u003cTWO_THOUSAND\u003e however industries like oil gas mining and manufacturing continue to face legacy infrastructure challenges resulting in the slow adoption of new digital solutions that can help improve their efficiency and quality in this direction our coe will develop next gen solutions to accelerate digital adoption within these sectors offering relevant analytics and business outcomes narasimham rv said the coe will leverage technologies like industrial internet of things iiot digital twin technology cloud infrastructure and connected worker platforms to enable efficient plant engineering through data management asset performance management and smart factory processes for enterprises part of the mahindra group tech mahindra is a pune based it services and consultation firm","timestamp":"2024-04-03T14:38:00+05:30","market_timestamp":"2024-04-03T14:38:00+05:30","off_market_hours":false}