{"url":"https://www.moneycontrol.com/news/business/maruti-suzuki-expands-manesar-plant-capacity-by-1-lakh-units-per-year-12605611.html","title":"Maruti Suzuki expands Manesar plant capacity by 1 lakh units per year","description":"The auto major has added a vehicle assembly line to the existing Plant-A of the three manufacturing plants functioning at Manesar, in Haryana.Maruti Suzuki expands Manesar plant capacity by 1 lakh units per year","content":"Maruti Suzuki India on Tuesday said it has expanded the production capacity of its Manesar facility by one lakh units per annum. The auto major has added a vehicle assembly line to the existing Plant-A of the three manufacturing plants functioning at Manesar, in Haryana. \"The new vehicle assembly line has the capability to manufacture 1 lakh units per annum,\" Maruti Suzuki India (MSI) said in a statement. \"We aim to nearly double our capacity to 4 million vehicles per annum over the next 7-8 years and this capacity addition of 1 lakh vehicles per year is a step towards this goal,\" MSI Managing Director \u0026 CEO Hisashi Takeuchi said. It will help the company serve its customers faster and enhance overall capability to manufacture up to 23.5 lakh units per annum, he added. The company had inaugurated the Manesar facility in February 2007 with the start of Plant A. As customer demand increased, the automaker added Plant-B in 2011 and Plant-C in 2013. MSI rolls out models like Brezza, Ertiga, XL6, Wagon R, Dzire, S-Presso, Ciaz and Celerio from the Manesar plant. ","cleaned_content":"maruti suzuki india on tuesday said it has expanded the production capacity of its manesar facility by one lakh units per annum the auto major has added a vehicle assembly line to the existing plant a of the three manufacturing plants functioning at manesar in haryana the new vehicle assembly line has the capability to manufacture \u003cONE_\u003e lakh units per annum maruti suzuki india msi said in a statement we aim to nearly double our capacity to \u003cFOUR_\u003e million vehicles per annum over the next \u003cSEVEN_\u003e \u003cEIGHT_\u003e years and this capacity addition of \u003cONE_\u003e lakh vehicles per year is a step towards this goal msi managing director ceo hisashi takeuchi said it will help the company serve its customers faster and enhance overall capability to manufacture up to \u003cTWO_TEN\u003e lakh units per annum he added the company had inaugurated the manesar facility in february \u003cTWO_THOUSAND\u003e with the start of plant a as customer demand increased the automaker added plant b in \u003cTWO_THOUSAND\u003e and plant c in \u003cTWO_THOUSAND\u003e msi rolls out models like brezza ertiga xl6 wagon r dzire s presso ciaz and celerio from the manesar plant","timestamp":"2024-04-09T13:42:00+05:30","market_timestamp":"2024-04-09T13:42:00+05:30","off_market_hours":false}