{"url":"https://www.moneycontrol.com/news/business/senior-level-job-roles-to-see-average-20-pay-hike-on-buoyant-economic-sentiments-report-12573911.html","title":"Senior level job roles to see average 20% pay hike on buoyant economic sentiments: Report","description":"According to the Michael Page India Salary Guide 2024, there is a resurgence in hiring within traditional industries, particularly evident in the continued high demand for manufacturing and operations roles.Senior level job roles to see average 20% pay hike on buoyant economic sentiments: ReportRelated stories","content":"Salary hike in senior level job roles is expected to reach an average of 20 per cent this year, as nurturing talent and fostering innovation remains a key focus area for companies amid the country's buoyant economic conditions, says a report. According to the Michael Page India Salary Guide 2024, there is a resurgence in hiring within traditional industries, particularly evident in the continued high demand for manufacturing and operations roles. Additionally, there's a notable surge in the need for professionals skilled in data analytics, generative AI, and machine learning across various sectors. According to the report, India's 6 per cent GDP growth coupled with significant domestic investments and independence from external factors, positions India uniquely in the region, even amidst global challenges. \"With India's economy displaying such resilience and optimism, and surpassing its pre-COVID performance, the focus is now on harnessing this potential. Nurturing talent and fostering innovation thus remains a key,\" said Ankit Agarwala, Managing Director at PageGroup. Agarwala further noted that the IT services industry, a cornerstone of the Indian economy, is witnessing a phase of recalibration. Companies are moderating their approach to salary increments, with expected hikes around 8 per cent-10 per cent. \"Industries like consumer, renewables, finance, and healthcare are flourishing, bolstered by investments from local and domestic companies,\" Agarwala said. Sector-wise analysis showed that in IT \u0026 Technology, the hike range varies from 35-45 per cent for junior employees, 30-40 per cent hike for mid-level executives, and 20-30 per cent increment for senior management. The property and construction sector is offering 20-40 per cent hike to juniors, 25-45 per cent hike to middle-level executives and a 20-40 per cent salary appraisal to seniors. \"As we delve deeper into 2024, the employment narrative in India is about more than just salaries. Flexibility, work culture, and professional growth opportunities are increasingly pivotal in job transitions, reflecting a maturing and holistic employment ecosystem,\" said Anshul Lodha, Managing Director at Page Group. Michael Page is a leading global recruitment firm specialising in permanent, contract, and temporary recruitment. Michael Page operates in 37 countries worldwide and has a strong presence in India. ","cleaned_content":"salary hike in senior level job roles is expected to reach an average of \u003cTWO_TEN_PERCENT\u003e this year as nurturing talent and fostering innovation remains a key focus area for companies amid the countrys buoyant economic conditions says a report according to the michael page india salary guide \u003cTWO_THOUSAND\u003e there is a resurgence in hiring within traditional industries particularly evident in the continued high demand for manufacturing and operations roles additionally theres a notable surge in the need for professionals skilled in data analytics generative ai and machine learning across various sectors according to the report indias \u003cSIX_PERCENT\u003e gdp growth coupled with significant domestic investments and independence from external factors positions india uniquely in the region even amidst global challenges with indias economy displaying such resilience and optimism and surpassing its pre covid performance the focus is now on harnessing this potential nurturing talent and fostering innovation thus remains a key said ankit agarwala managing director at pagegroup agarwala further noted that the it services industry a cornerstone of the indian economy is witnessing a phase of recalibration companies are moderating their approach to salary increments with expected hikes around \u003cEIGHT_PERCENT\u003e \u003cONE_TEN_PERCENT\u003e industries like consumer renewables finance and healthcare are flourishing bolstered by investments from local and domestic companies agarwala said sector wise analysis showed that in it technology the hike range varies from \u003cTHREE_TEN\u003e \u003cFOUR_TEN_PERCENT\u003e for junior employees \u003cTHREE_TEN\u003e \u003cFOUR_TEN_PERCENT\u003e hike for mid level executives and \u003cTWO_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e increment for senior management the property and construction sector is offering \u003cTWO_TEN\u003e \u003cFOUR_TEN_PERCENT\u003e hike to juniors \u003cTWO_TEN\u003e \u003cFOUR_TEN_PERCENT\u003e hike to middle level executives and a \u003cTWO_TEN\u003e \u003cFOUR_TEN_PERCENT\u003e salary appraisal to seniors as we delve deeper into \u003cTWO_THOUSAND\u003e the employment narrative in india is about more than just salaries flexibility work culture and professional growth opportunities are increasingly pivotal in job transitions reflecting a maturing and holistic employment ecosystem said anshul lodha managing director at page group michael page is a leading global recruitment firm specialising in permanent contract and temporary recruitment michael page operates in \u003cTHREE_TEN\u003e countries worldwide and has a strong presence in india","timestamp":"2024-04-04T13:22:00+05:30","market_timestamp":"2024-04-04T13:22:00+05:30","off_market_hours":false}