{"url":"https://www.moneycontrol.com/news/business/dhananjay-singh-takes-over-as-md-merck-life-science-in-india-12606531.html","title":"Dhananjay Singh takes over as MD Merck Life Science in India","description":"Dhananjay Singh  took over effective April 1, 2024 from Sreenath NS, who is retiring after 36 years of service with Merck in India, the company said in a statement.Dhananjay Singh takes over as MD Merck Life Science in India","content":"Merck India on Tuesday said Dhananjay Singh has taken over as the Managing Director of Merck Life Science in India, in addition to his current position as Head of Science \u0026 Lab Solutions Commercial, India. He took over effective April 1, 2024 from Sreenath NS, who is retiring after 36 years of service with Merck in India, the company said in a statement. In his role as the Managing Director, Singh will be responsible for driving the Life Science strategy in India, ensuring governance and compliance alongside other leaders from Merck's businesses in India, it added. Singh's expertise in market dynamics and multi-stakeholder relationship management will further strengthen Merck Life Science's position in the Indian market, Reddy added. Singh joined Sigma-Aldrich in 1997 and took on several leadership roles in Commercial Organisation over the years before his appointment as Head of Science \u0026 Lab Solutions Commercial for India, a position he held since 2022, the statement said. ","cleaned_content":"merck india on tuesday said dhananjay singh has taken over as the managing director of merck life science in india in addition to his current position as head of science lab solutions commercial india he took over effective april \u003cONE_\u003e \u003cTWO_THOUSAND\u003e from sreenath ns who is retiring after \u003cTHREE_TEN\u003e years of service with merck in india the company said in a statement in his role as the managing director singh will be responsible for driving the life science strategy in india ensuring governance and compliance alongside other leaders from mercks businesses in india it added singhs expertise in market dynamics and multi stakeholder relationship management will further strengthen merck life sciences position in the indian market reddy added singh joined sigma aldrich in \u003cONE_THOUSAND\u003e and took on several leadership roles in commercial organisation over the years before his appointment as head of science lab solutions commercial for india a position he held since \u003cTWO_THOUSAND\u003e the statement said","timestamp":"2024-04-09T14:23:00+05:30","market_timestamp":"2024-04-09T14:23:00+05:30","off_market_hours":false}