{"url":"https://www.moneycontrol.com/news/technology/auto/honda-commences-work-for-new-warehouse-facility-in-karnataka-12642451.html","title":"Honda commences work for new warehouse facility in Karnataka","description":"Managed by Honda Cars India, the new facility will support the spare parts operations for all Honda businesses, including Honda Cars India, Honda Motorcycle \u0026 Scooter India, and Honda India Power Products, the company said in a statement.Honda commences work for new warehouse facility in Karnataka","content":"Japanese firm Honda on Monday said it has commenced work for a spare parts warehouse facility in Doddaballapura near Bengaluru, Karnataka. Managed by Honda Cars India, the new facility will support the spare parts operations for all Honda businesses, including Honda Cars India, Honda Motorcycle \u0026 Scooter India, and Honda India Power Products, the company said in a statement. The upcoming facility, which will be operational by the first quarter of FY26, will play an important role in the faster availability of spare parts at Honda dealerships, it added. The new facility will not only enhance spare parts accessibility in the southern region of the country but also pave the way for future requirements amid rapid electrification, he added. The development project of the facility will be undertaken by Sumitomo Mitsui Construction Company (SMCC), Honda said. In the first phase, 60,000 square metres of plot area will be developed, including covered space of 25,000 sq metres. ","cleaned_content":"japanese firm honda on monday said it has commenced work for a spare parts warehouse facility in doddaballapura near bengaluru karnataka managed by honda cars india the new facility will support the spare parts operations for all honda businesses including honda cars india honda motorcycle scooter india and honda india power products the company said in a statement the upcoming facility which will be operational by the first quarter of fy26 will play an important role in the faster availability of spare parts at honda dealerships it added the new facility will not only enhance spare parts accessibility in the southern region of the country but also pave the way for future requirements amid rapid electrification he added the development project of the facility will be undertaken by sumitomo mitsui construction company smcc honda said in the first phase \u003cSIX_TEN_THOUSAND\u003e square metres of plot area will be developed including covered space of \u003cTWO_TEN_THOUSAND\u003e sq metres","timestamp":"2024-04-15T15:01:00+05:30","market_timestamp":"2024-04-15T15:01:00+05:30","off_market_hours":false}