{"url":"https://www.moneycontrol.com/news/business/bajaj-auto-appoints-abraham-joseph-as-md-of-ev-arm-chetak-technology-12700361.html","title":"Bajaj Auto appoints Abraham Joseph as MD of Chetak Technology, Ramtilak Ananthan as BAL CTO","description":"As part of the strategy to accelerate technological innovation and further strengthen its position in existing and emerging mobility segments, the company also said Ramtilak Ananthan has been named as Chief Technology Officer of Bajaj Auto Ltd (BAL).Ramtilak AnanthanRelated stories","content":"Bajaj Auto Ltd on Tuesday made key leadership changes with Abraham Joseph appointed as Managing Director of its electric vehicle arm -- Chetak Technology Ltd. As part of the strategy to accelerate technological innovation and further strengthen its position in existing and emerging mobility segments, the company also said Ramtilak Ananthan has been named as Chief Technology Officer of Bajaj Auto Ltd (BAL). Joseph is a Bajaj Auto veteran with over 35 years of experience, the company said in a statement. \"CTL will explore the potential of hydrogen vehicles, further expanding Bajaj Auto's ability to deliver technologically differentiated products,\" it added. As CTO of BAL, Joseph has been instrumental in leading the development of brands like Pulsar and overseeing the creation of numerous standout products across various segments, including Platina, CT, Boxer, Discover, V, Avenger, and Dominar, the company said. He also led the development of a variety of three-wheeler products for both cargo and passenger segments, spanning various fuel variants such as petrol, diesel, LPG, CNG and Electric. \"Moreover, India's first quadricycle, Qute, was launched under his leadership,\" the statement said. In the past six years, Joseph has played a key role in establishing and expanding the EV R\u0026D organisation -- the Chetak Technology R\u0026D. BAL said, subsequently, Ananthan will assume the role as its Chief Technology Officer. He has over 30 years of experience at Bajaj Auto with expertise in product development and testing. In 2013, he was promoted to Vice President R\u0026D and spearheaded the successful transition of all Bajaj Auto products to BS4 norms. Later, in 2019, he assumed the role of Head Test \u0026 Validation, overseeing the complete test and validation function. He played a key role in the transition of all Bajaj Auto products to BS6 and OBD2A (On-Board Diagnostic 2) norms, the statement said. ","cleaned_content":"bajaj auto ltd on tuesday made key leadership changes with abraham joseph appointed as managing director of its electric vehicle arm chetak technology ltd as part of the strategy to accelerate technological innovation and further strengthen its position in existing and emerging mobility segments the company also said ramtilak ananthan has been named as chief technology officer of bajaj auto ltd bal joseph is a bajaj auto veteran with over \u003cTHREE_TEN\u003e years of experience the company said in a statement ctl will explore the potential of hydrogen vehicles further expanding bajaj autos ability to deliver technologically differentiated products it added as cto of bal joseph has been instrumental in leading the development of brands like pulsar and overseeing the creation of numerous standout products across various segments including platina ct boxer discover v avenger and dominar the company said he also led the development of a variety of three wheeler products for both cargo and passenger segments spanning various fuel variants such as petrol diesel lpg cng and electric moreover indias first quadricycle qute was launched under his leadership the statement said in the past six years joseph has played a key role in establishing and expanding the ev r d organisation the chetak technology r d bal said subsequently ananthan will assume the role as its chief technology officer he has over \u003cTHREE_TEN\u003e years of experience at bajaj auto with expertise in product development and testing in \u003cTWO_THOUSAND\u003e he was promoted to vice president r d and spearheaded the successful transition of all bajaj auto products to bs4 norms later in \u003cTWO_THOUSAND\u003e he assumed the role of head test validation overseeing the complete test and validation function he played a key role in the transition of all bajaj auto products to bs6 and obd2a on board diagnostic \u003cTWO_\u003e norms the statement said","timestamp":"2024-04-23T21:52:00+05:30","market_timestamp":"2024-04-24T09:15:00+05:30","off_market_hours":true}