{"url":"https://www.moneycontrol.com/news/business/uae-giant-eyes-majority-stake-in-vedantas-zambian-mines-in-expansion-drive-12673911.html","title":"UAE giant eyes majority stake in Vedanta's Zambian mines in expansion drive","description":"The unit of International Holding Company recently made an offer of more than $1 billion to buy a 51% stake in Konkola Copper Mines (KCM) from Indian billionaire Anil Agarwal-owned Vedanta, the sources said.UAE giant eyes majority stake in Vedanta's Zambian mines in expansion driveRelated stories","content":"The mining investment arm of Abu Dhabi's most valuable company has offered to buy a majority stake in Vedanta Resources' Zambian copper assets, two sources familiar with the matter told Reuters, in its drive to build an African copper mining empire. The unit of International Holding Company recently made an offer of more than $1 billion to buy a 51% stake in Konkola Copper Mines (KCM) from Indian billionaire Anil Agarwal-owned Vedanta, the sources said. The unit - International Resources Holding (IRH) - is racing to broaden its burgeoning copper mining business in Zambia after buying a 51% stake in Mopani Copper Mines in a deal worth $1.1 billion. IRH said last month it planned to bid for a stake owned by EMR Capital in Lubambe Copper Mine, which is also for sale. The IRH offer for a controlling stake is non-binding and talks are ongoing, one of the sources said. Vedanta might balk at giving up a majority interest in KCM as it has always wanted the assets on its balance sheet, the source added. \"IRH is deeply committed to strategically expanding its presence in the copper mining sector, exemplified by our interest in multiple assets,\" IRH said in reply to a request for comment. It declined to comment on \"ongoing discussions\". Vedanta wants to sell part of its 80% stake in KCM and has hired Standard Chartered to manage the process in an effort to raise capital to revive the assets, which were nearly paralysed in an ownership dispute with the government that erupted in 2019 when the then-administration seized them. The Zambian government owns 20% of KCM through state firm ZCCM-IH. Stanchart issued a \"request for proposals\" seeking investors interested in buying a minority interest in KCM, the sources said. IRH is only interested in a controlling stake in KCM as there are no clear benefits in becoming a passive investor in the operations, the sources said, as they are not making money and need significant investment. Asked for comment, Vedanta said Stanchart was assisting in a \"broader strategy to manage its capital structure and ensure the company has the funds necessary to meet its obligations and continue operations again.\"\"As part of this process, we are engaging with prospective partners for both short-term financing and longer-term equity financing but cannot disclose the names of these partners or investors due to the sensitive stage these discussions have reached.\" TROUBLED LEGACYVedanta recently regained control of the assets after protracted legal battles, including international arbitration, with the previous Zambian government which seized the copper mines and smelting plant after accusing the company of failing to invest in expanding copper production.The legal squabbles, which erupted following the May 2019 government-forced liquidation of KCM, starved the operations of fresh capital and nearly brought them to a standstill. Now Vedanta wants to raise about $1 billion to invest in the assets over the next five years and an additional $300 million to pay off outstanding local creditors, Chris Griffith, the CEO of Vedanta's base metals unit told Reuters in February. Much of the funding is required to advance the Konkola Deep Mining Project, an underground operation, which holds one of the world's richest copper deposits. Vedanta is open to selling either a minority or majority stake and the company is seeing interest from various investors, a third source said. A rally in copper prices is likely to fuel investors' interest in the assets, but they may be unnerved by tough conditions including removing groundwater from the Konkola Deep underground operation, another source at a global miner which previously explored a deal over the assets, told Reuters. ","cleaned_content":"the mining investment arm of abu dhabis most valuable company has offered to buy a majority stake in vedanta resources zambian copper assets two sources familiar with the matter told reuters in its drive to build an african copper mining empire the unit of international holding company recently made an offer of more than \u003cONE_\u003e billion to buy a \u003cFIVE_TEN_PERCENT\u003e stake in konkola copper mines kcm from indian billionaire anil agarwal owned vedanta the sources said the unit international resources holding irh is racing to broaden its burgeoning copper mining business in zambia after buying a \u003cFIVE_TEN_PERCENT\u003e stake in mopani copper mines in a deal worth \u003cONE_\u003e billion irh said last month it planned to bid for a stake owned by emr capital in lubambe copper mine which is also for sale the irh offer for a controlling stake is non binding and talks are ongoing one of the sources said vedanta might balk at giving up a majority interest in kcm as it has always wanted the assets on its balance sheet the source added irh is deeply committed to strategically expanding its presence in the copper mining sector exemplified by our interest in multiple assets irh said in reply to a request for comment it declined to comment on ongoing discussions vedanta wants to sell part of its \u003cEIGHT_TEN_PERCENT\u003e stake in kcm and has hired standard chartered to manage the process in an effort to raise capital to revive the assets which were nearly paralysed in an ownership dispute with the government that erupted in \u003cTWO_THOUSAND\u003e when the then administration seized them the zambian government owns \u003cTWO_TEN_PERCENT\u003e of kcm through state firm zccm ih stanchart issued a request for proposals seeking investors interested in buying a minority interest in kcm the sources said irh is only interested in a controlling stake in kcm as there are no clear benefits in becoming a passive investor in the operations the sources said as they are not making money and need significant investment asked for comment vedanta said stanchart was assisting in a broader strategy to manage its capital structure and ensure the company has the funds necessary to meet its obligations and continue operations again as part of this process we are engaging with prospective partners for both short term financing and longer term equity financing but cannot disclose the names of these partners or investors due to the sensitive stage these discussions have reached troubled legacyvedanta recently regained control of the assets after protracted legal battles including international arbitration with the previous zambian government which seized the copper mines and smelting plant after accusing the company of failing to invest in expanding copper production the legal squabbles which erupted following the may \u003cTWO_THOUSAND\u003e government forced liquidation of kcm starved the operations of fresh capital and nearly brought them to a standstill now vedanta wants to raise about \u003cONE_\u003e billion to invest in the assets over the next five years and an additional \u003cTHREE_HUNDRED\u003e million to pay off outstanding local creditors chris griffith the ceo of vedantas base metals unit told reuters in february much of the funding is required to advance the konkola deep mining project an underground operation which holds one of the worlds richest copper deposits vedanta is open to selling either a minority or majority stake and the company is seeing interest from various investors a third source said a rally in copper prices is likely to fuel investors interest in the assets but they may be unnerved by tough conditions including removing groundwater from the konkola deep underground operation another source at a global miner which previously explored a deal over the assets told reuters","timestamp":"2024-04-19T10:58:00+05:30","market_timestamp":"2024-04-19T10:58:00+05:30","off_market_hours":false}