{"url":"https://www.moneycontrol.com/news/business/arcelormittal-nippon-steel-india-in-talks-for-1-billion-loan-12692931.html","title":"Arcelormittal Nippon Steel India in talks for $1 billion loan","description":"At least three lenders including State Bank of India, ICICI Bank Ltd. and Axis Bank Ltd. would be participating in the syndicated deal, with proceeds to be used for capital expenditure, said the people who asked not to be identified for discussing private information.Arcelormittal Nippon Steel India in talks for $1 billion loanRelated stories","content":"Arcelormittal Nippon Steel India Ltd., a joint venture between two of the world’s leading steel makers, is in talks with banks to raise about 85 billion rupees ($1 billion), according to people familiar with the matter, in what could be the biggest local-currency loan this year to fund the firm’s expansion. At least three lenders including State Bank of India, ICICI Bank Ltd. and Axis Bank Ltd. would be participating in the syndicated deal, with proceeds to be used for capital expenditure, said the people who asked not to be identified for discussing private information. SBI, India’s top bank, could lend more than half of the loan, which may carry a tenor longer than five years and be priced against a local interest rate benchmark, they said, adding that details of the lending facility are not finalized and may change. ArcelorMittal Nippon Steel India, State Bank of India, ICICI Bank and Axis Bank did not immediately reply to e-mailed requests seeking comment. The steel firm had earlier held loan negotiations with a few other lenders but they couldn’t agree on the cost of funding, said the people. The company is a joint venture between major steelmakers ArcelorMittal South Africa Ltd. and Japan’s Nippon Steel Corp. It’s India’s fourth-biggest flat steel producer with an annual capacity of 8.8 metric tons as of March 2023, according to Crisil Ratings, a local credit risk assessor. Building and construction makes up 39% of India’s total steel demand, with infrastructure at 27%, engineering and packaging at 21% and automotive at 12%, respectively, a Bloomberg Intelligence analysis shows. ","cleaned_content":"arcelormittal nippon steel india ltd a joint venture between two of the world s leading steel makers is in talks with banks to raise about \u003cEIGHT_TEN\u003e billion rupees \u003cONE_\u003e billion according to people familiar with the matter in what could be the biggest local currency loan this year to fund the firm s expansion at least three lenders including state bank of india icici bank ltd and axis bank ltd would be participating in the syndicated deal with proceeds to be used for capital expenditure said the people who asked not to be identified for discussing private information sbi india s top bank could lend more than half of the loan which may carry a tenor longer than five years and be priced against a local interest rate benchmark they said adding that details of the lending facility are not finalized and may change arcelormittal nippon steel india state bank of india icici bank and axis bank did not immediately reply to e mailed requests seeking comment the steel firm had earlier held loan negotiations with a few other lenders but they couldn t agree on the cost of funding said the people the company is a joint venture between major steelmakers arcelormittal south africa ltd and japan s nippon steel corp it s india s fourth biggest flat steel producer with an annual capacity of \u003cEIGHT_\u003e metric tons as of march \u003cTWO_THOUSAND\u003e according to crisil ratings a local credit risk assessor building and construction makes up \u003cTHREE_TEN_PERCENT\u003e of india s total steel demand with infrastructure at \u003cTWO_TEN_PERCENT\u003e engineering and packaging at \u003cTWO_TEN_PERCENT\u003e and automotive at \u003cONE_TEN_PERCENT\u003e respectively a bloomberg intelligence analysis shows","timestamp":"2024-04-22T16:19:00+05:30","market_timestamp":"2024-04-23T09:15:00+05:30","off_market_hours":true}