{"url":"https://www.moneycontrol.com/news/business/carlyle-picks-jpmorgan-and-kotak-to-help-arrange-hexaware-ipo-12638841.html","title":"Carlyle picks JPMorgan and Kotak to help arrange Hexaware IPO","description":"The US investment firm plans to hold the IPO as early as in the fourth quarter of this year, the people said, asking not to be identified as the deliberations are private. Carlyle picks JPMorgan and Kotak to help arrange Hexaware IPORelated stories","content":"Carlyle Group Inc. has selected JPMorgan Chase \u0026 Co. and Kotak Mahindra Bank to help arrange Hexaware Technologies Ltd.’s planned initial public offering in Mumbai this year, according to people familiar with the matter. The US investment firm plans to hold the IPO as early as in the fourth quarter of this year, the people said, asking not to be identified as the deliberations are private. More bankers will likely be added for the potential $1 billion offering, which may value the Indian information technology company at as much as $6 billion, they said. An IPO would help owner Carlyle pare a part of its holding in Hexaware, the people said. Deliberations are at an early stage and Carlyle may decide against the share sale, the people said. At about $1 billion, it would be the biggest IPO in the country since Life Insurance Corp. of India’s offering in 2022, according to data compiled by Bloomberg. Details such as the IPO size and value of the company could still change, the people said. Carlyle has been exploring an IPO of Hexaware, Bloomberg News has reported. Hexaware provides IT and business process outsourcing, and offers cloud, data and artificial intelligence services, according to its website. Carlyle bought Hexaware in 2021 from Baring Private Equity Asia Ltd., which is now part of Sweden’s EQT AB. India has turned into a booming market for deals including IPOs as global investors seek to tap its growth potential. Automakers, electric-scooter makers and IT companies are among those considering share sales this year. ","cleaned_content":"carlyle group inc has selected jpmorgan chase co and kotak mahindra bank to help arrange hexaware technologies ltd s planned initial public offering in mumbai this year according to people familiar with the matter the us investment firm plans to hold the ipo as early as in the fourth quarter of this year the people said asking not to be identified as the deliberations are private more bankers will likely be added for the potential \u003cONE_\u003e billion offering which may value the indian information technology company at as much as \u003cSIX_\u003e billion they said an ipo would help owner carlyle pare a part of its holding in hexaware the people said deliberations are at an early stage and carlyle may decide against the share sale the people said at about \u003cONE_\u003e billion it would be the biggest ipo in the country since life insurance corp of india s offering in \u003cTWO_THOUSAND\u003e according to data compiled by bloomberg details such as the ipo size and value of the company could still change the people said carlyle has been exploring an ipo of hexaware bloomberg news has reported hexaware provides it and business process outsourcing and offers cloud data and artificial intelligence services according to its website carlyle bought hexaware in \u003cTWO_THOUSAND\u003e from baring private equity asia ltd which is now part of sweden s eqt ab india has turned into a booming market for deals including ipos as global investors seek to tap its growth potential automakers electric scooter makers and it companies are among those considering share sales this year","timestamp":"2024-04-15T09:29:00+05:30","market_timestamp":"2024-04-15T09:29:00+05:30","off_market_hours":false}