{"url":"https://www.moneycontrol.com/news/business/vedanta-group-asks-jpmorgan-to-arrange-300-million-india-bond-12642511.html","title":"Vedanta group asks JPMorgan to arrange $300 million India bond","description":"The tenor of the proposed bonds is expected to be in the range of three to five years, the people said. Proceeds would be used to support the company’s business activities, they said.Vedanta group asks JPMorgan to arrange $300 million India bond","content":"Vedanta Ltd. has mandated JPMorgan Chase \u0026 Co. to help it raise 25 billion rupees ($300 million) via rupee-denominated bonds, according to people familiar with the matter. JPMorgan’s financing-solutions department in India, headed by Nitin Rungta, is reaching out to potential investors on behalf of the metals and mining company, according to people who asked not to be identified as the information is private. Those investors include global private credit funds, they said. The tenor of the proposed bonds is expected to be in the range of three to five years, the people said. Proceeds would be used to support the company’s business activities, they said. A JPMorgan spokesperson declined to comment. Earlier this month, a committee of Vedanta’s directors approved the plan to raise as much as 25 billion rupees through a private placement of non-convertible bonds. ","cleaned_content":"vedanta ltd has mandated jpmorgan chase co to help it raise \u003cTWO_TEN\u003e billion rupees \u003cTHREE_HUNDRED\u003e million via rupee denominated bonds according to people familiar with the matter jpmorgan s financing solutions department in india headed by nitin rungta is reaching out to potential investors on behalf of the metals and mining company according to people who asked not to be identified as the information is private those investors include global private credit funds they said the tenor of the proposed bonds is expected to be in the range of three to five years the people said proceeds would be used to support the company s business activities they said a jpmorgan spokesperson declined to comment earlier this month a committee of vedanta s directors approved the plan to raise as much as \u003cTWO_TEN\u003e billion rupees through a private placement of non convertible bonds","timestamp":"2024-04-15T15:01:00+05:30","market_timestamp":"2024-04-15T15:01:00+05:30","off_market_hours":false}