{"url":"https://www.moneycontrol.com/news/business/tech-firms-tcs-accenture-cognizant-lead-linkedins-top-large-companies-list-12648271.html","title":"Tech firms TCS, Accenture, Cognizant lead LinkedIn's top large companies list","description":"Professional networking platform LinkedIn on Tuesday released the 2024 Top Companies list for India wherein IT companies bagged the top three ranks, while financial services firms dominated the list with 9 out of 25 companies from this sector.Tech firms TCS, Accenture, Cognizant lead LinkedIn's top large companies listRelated stories","content":"Tata Consultancy Services has topped the LinkedIn's latest list of top companies to work for in India, followed by Accenture and Cognizant in the second and third place respectively. Professional networking platform LinkedIn on Tuesday released the 2024 Top Companies list for India wherein IT companies bagged the top three ranks, while financial services firms dominated the list with 9 out of 25 companies from this sector. The 8th edition has derived insights from LinkedIn data, and lists the top 25 large companies, 15 best mid-size companies, and provides insights on in-demand skills, top locations, and the largest job functions within these companies. Continuing the trend from last year, financial services dominated the 2024 list with 9 out of 25 companies from this sector including Macquarie Group (4th place), Morgan Stanley (5th), and JPMorgan Chase and Co (6th), LinkedIn said. Software-as-a-service (SaaS) platform Lentra ranked first on the list of top mid-size companies list (250-500 employees), followed by Indian online travel platform MakeMyTrip. The list also featured fashion and beauty retailer Nykaa and fantasy sports platform Dream11, showcasing the wide range of opportunities available in diverse industries for job seekers in India. \"The in-demand skills that the top companies are looking for in the financial services sector include investor relations, capital markets, and investment banking. Companies in the technology sector are looking for skills such as enterprise software, data storage technologies, software development life cycle (SDLC), and artificial intelligence (AI),\" the data revealed. Revenue analysis, nonprofit management, and mobile application development are some of the other skills that are witnessing a surge in demand, it added. Silicon valley of India, Bengaluru was named the top location where these top companies are based and looking to hire talent, followed by Hyderabad, Mumbai Metropolitan Region, and Pune. LinkedIn said the ranking of companies is based on eight pillars that have been shown to lead to career progression such as the ability to advance, skills growth, company stability, external opportunity, company affinity, gender diversity, educational background, and employee presence in the country. ","cleaned_content":"tata consultancy services has topped the linkedins latest list of top companies to work for in india followed by accenture and cognizant in the second and third place respectively professional networking platform linkedin on tuesday released the \u003cTWO_THOUSAND\u003e top companies list for india wherein it companies bagged the top three ranks while financial services firms dominated the list with \u003cNINE_\u003e out of \u003cTWO_TEN\u003e companies from this sector the \u003cEIGHT_\u003e th edition has derived insights from linkedin data and lists the top \u003cTWO_TEN\u003e large companies \u003cONE_TEN\u003e best mid size companies and provides insights on in demand skills top locations and the largest job functions within these companies continuing the trend from last year financial services dominated the \u003cTWO_THOUSAND\u003e list with \u003cNINE_\u003e out of \u003cTWO_TEN\u003e companies from this sector including macquarie group \u003cFOUR_\u003e th place morgan stanley \u003cFIVE_\u003e th and jpmorgan chase and co \u003cSIX_\u003e th linkedin said software as a service saas platform lentra ranked first on the list of top mid size companies list \u003cTWO_HUNDRED\u003e \u003cFIVE_HUNDRED\u003e employees followed by indian online travel platform makemytrip the list also featured fashion and beauty retailer nykaa and fantasy sports platform dream11 showcasing the wide range of opportunities available in diverse industries for job seekers in india the in demand skills that the top companies are looking for in the financial services sector include investor relations capital markets and investment banking companies in the technology sector are looking for skills such as enterprise software data storage technologies software development life cycle sdlc and artificial intelligence ai the data revealed revenue analysis nonprofit management and mobile application development are some of the other skills that are witnessing a surge in demand it added silicon valley of india bengaluru was named the top location where these top companies are based and looking to hire talent followed by hyderabad mumbai metropolitan region and pune linkedin said the ranking of companies is based on eight pillars that have been shown to lead to career progression such as the ability to advance skills growth company stability external opportunity company affinity gender diversity educational background and employee presence in the country","timestamp":"2024-04-16T15:41:00+05:30","market_timestamp":"2024-04-17T09:15:00+05:30","off_market_hours":true}