{"url":"https://www.moneycontrol.com/news/business/kundan-green-energy-gets-42-mw-hydropower-project-in-uttarakhand-12710554.html","title":"Kundan Green Energy gets 42 MW hydropower project in Uttarakhand","description":"The Okhali project is part of an agreement with the Uttarakhand government signed last year to develop a total of 80 MW greenfield hydropower capacity in the state at an investment of Rs 1,000 crore, Kundan Green Energy said in a statement.Kundan Green Energy gets 42 MW hydropower project in Uttarakhand","content":"Kundan Green Energy on Monday said it has secured approvals for setting up a 42 MW hydropower project at Okhali in Uttarakhand. The Okhali project is part of an agreement with the Uttarakhand government signed last year to develop a total of 80 MW greenfield hydropower capacity in the state at an investment of Rs 1,000 crore, Kundan Green Energy said in a statement. \"Kundan Green Energy receives hydropower (project) mandate of 42 MW to set up a greenfield plant at Okhali in Uttarakhand,\" the company said. The project will be completed by 2028. Once commissioned, the Okhali project will take the combined hydropower capacities of the company to 270 MW from the present 104 MW (Megawatt). ","cleaned_content":"kundan green energy on monday said it has secured approvals for setting up a \u003cFOUR_TEN\u003e mw hydropower project at okhali in uttarakhand the okhali project is part of an agreement with the uttarakhand government signed last year to develop a total of \u003cEIGHT_TEN\u003e mw greenfield hydropower capacity in the state at an investment of rs \u003cONE_THOUSAND\u003e crore kundan green energy said in a statement kundan green energy receives hydropower project mandate of \u003cFOUR_TEN\u003e mw to set up a greenfield plant at okhali in uttarakhand the company said the project will be completed by \u003cTWO_THOUSAND\u003e once commissioned the okhali project will take the combined hydropower capacities of the company to \u003cTWO_HUNDRED\u003e mw from the present \u003cONE_HUNDRED\u003e mw megawatt","timestamp":"2024-04-29T13:27:00+05:30","market_timestamp":"2024-04-29T13:27:00+05:30","off_market_hours":false}