{"url":"https://www.moneycontrol.com/news/business/sterlite-power-bags-projects-worth-rs-2500-crore-in-q4-12711471.html","title":"Sterlite Power bags projects worth Rs 2,500 crore in Q4","description":"This takes the company's cumulative order wins in FY24 to Rs 7,000 crore, up 35 per cent year-on-year (YoY) over FY23, Sterlite Power said in a statement.Sterlite Power bags projects worth Rs 2,500 crore in Q4Related stories","content":"Sterlite Power on Tuesday announced securing new orders worth Rs 2,500 crore during the quarter ended March 31. This takes the company's cumulative order wins in FY24 to Rs 7,000 crore, up 35 per cent year-on-year (YoY) over FY23, Sterlite Power said in a statement. \"Sterlite Power has capped off a successful fiscal year FY24 with new orders worth Rs 2,500 crore for its Global Products and Services (GPS) business unit in Q4. This growth underscores the growing global and domestic demand for robust power transmission infrastructure, particularly to support the integration of renewable energy sources critical for a net-zero future,\" the company said. In Q4, some of the projects secured by the company are for conductor supply to green energy power transmission projects in Rajasthan including the Fatehgarh-Bhadla Transmission line project. The company also bagged export orders for OPGW (Optical Ground Wire) in Africa and CIS (Commonwealth of Independent States) markets. Besides, Sterlite Power has secured multiple orders to supply Extra High Voltage (EHV) \u0026 High Voltage (HV) cables for large-scale infrastructure projects that are underway in Madhya Pradesh, West Bengal, Karnataka, Odisha, and Gujarat. The company's specialized EPC services unit signed a turnkey project contract with Odisha state transmission utility to uprate its existing 132 kV Pratapsasan-Kesura-Ransinghpur transmission line using high performance conductors (HPC). Sterlite Power is a leading private sector power transmission infrastructure developer and Global Products and Services provider. It has a portfolio of 33 completed, sold and under construction power transmission projects covering approximately 16,529 circuit kms of transmission lines across India and Brazil. ","cleaned_content":"sterlite power on tuesday announced securing new orders worth rs \u003cTWO_THOUSAND\u003e crore during the quarter ended march \u003cTHREE_TEN\u003e this takes the companys cumulative order wins in fy24 to rs \u003cSEVEN_THOUSAND\u003e crore up \u003cTHREE_TEN_PERCENT\u003e year on year yoy over fy23 sterlite power said in a statement sterlite power has capped off a successful fiscal year fy24 with new orders worth rs \u003cTWO_THOUSAND\u003e crore for its global products and services gps business unit in q4 this growth underscores the growing global and domestic demand for robust power transmission infrastructure particularly to support the integration of renewable energy sources critical for a net zero future the company said in q4 some of the projects secured by the company are for conductor supply to green energy power transmission projects in rajasthan including the fatehgarh bhadla transmission line project the company also bagged export orders for opgw optical ground wire in africa and cis commonwealth of independent states markets besides sterlite power has secured multiple orders to supply extra high voltage ehv high voltage hv cables for large scale infrastructure projects that are underway in madhya pradesh west bengal karnataka odisha and gujarat the companys specialized epc services unit signed a turnkey project contract with odisha state transmission utility to uprate its existing \u003cONE_HUNDRED\u003e kv pratapsasan kesura ransinghpur transmission line using high performance conductors hpc sterlite power is a leading private sector power transmission infrastructure developer and global products and services provider it has a portfolio of \u003cTHREE_TEN\u003e completed sold and under construction power transmission projects covering approximately \u003cONE_TEN_THOUSAND\u003e circuit kms of transmission lines across india and brazil","timestamp":"2024-04-30T13:08:00+05:30","market_timestamp":"2024-04-30T13:08:00+05:30","off_market_hours":false}