{"url":"https://www.moneycontrol.com/news/business/patanjali-foods-gets-show-cause-notice-for-gst-dues-12711271.html","title":"Patanjali Foods gets show cause notice for GST dues","description":"The Yoga guru Ramdev-led Patanjali Ayurved Group firm, which is mainly into the edible oil business, has received the notice from the Directorate General of GST Intelligence, Chandigarh Zonal Unit, according to a regulatory filing made by the company on April 26.Patanjali Foods gets show cause notice for GST duesRelated stories","content":"Patanjali Foods has been served a show cause notice by the GST intelligence department, asking the company to explain why input tax credit worth Rs 27.46 crore should not be recovered from it. The Yoga guru Ramdev-led Patanjali Ayurved Group firm, which is mainly into the edible oil business, has received the notice from the Directorate General of GST Intelligence, Chandigarh Zonal Unit, according to a regulatory filing made by the company on April 26. \"A show cause notice is received by the company... requiring the company, its officers and authorised signatories to show cause as to why input tax credit amounting to Rs 27,46,14,343 should not be recovered (along with interest), and why penalty should not be imposed...,\" the company said. \"As of now the authority has only issued a show cause notice and the company will be taking all necessary action to defend its case before the authority,\" Patanjali Foods said. \"... expected financial implications cannot be determined till the completion of the proceedings,\" the company added. Last week, Patanjali Foods had said it will evaluate a proposal to acquire the non-food business of promoter group Patanjali Ayurved. In a regulatory filing, Patanjali Foods informed that its board has discussed the initial proposal received from Patanjali Ayurved Ltd for a sale of the latter's non-food business undertaking to the company. Incorporated in 1986, Patanjali Foods Ltd, formerly known as Ruchi Soya Industries Ltd, is a leading FMCG player. The company operates in edible oils, food and FMCG, and wind power generation segments through a bouquet of brands like Patanjali, Ruchi Gold, Nutrela, etc. Patanjali Ayurved had acquired Ruchi Soya through the insolvency process and later renamed the company to Patanjali Foods Ltd. ","cleaned_content":"patanjali foods has been served a show cause notice by the gst intelligence department asking the company to explain why input tax credit worth rs \u003cTWO_TEN\u003e crore should not be recovered from it the yoga guru ramdev led patanjali ayurved group firm which is mainly into the edible oil business has received the notice from the directorate general of gst intelligence chandigarh zonal unit according to a regulatory filing made by the company on april \u003cTWO_TEN\u003e a show cause notice is received by the company requiring the company its officers and authorised signatories to show cause as to why input tax credit amounting to rs \u003cTWO_HUNDRED_MILLION\u003e should not be recovered along with interest and why penalty should not be imposed the company said as of now the authority has only issued a show cause notice and the company will be taking all necessary action to defend its case before the authority patanjali foods said expected financial implications cannot be determined till the completion of the proceedings the company added last week patanjali foods had said it will evaluate a proposal to acquire the non food business of promoter group patanjali ayurved in a regulatory filing patanjali foods informed that its board has discussed the initial proposal received from patanjali ayurved ltd for a sale of the latters non food business undertaking to the company incorporated in \u003cONE_THOUSAND\u003e patanjali foods ltd formerly known as ruchi soya industries ltd is a leading fmcg player the company operates in edible oils food and fmcg and wind power generation segments through a bouquet of brands like patanjali ruchi gold nutrela etc patanjali ayurved had acquired ruchi soya through the insolvency process and later renamed the company to patanjali foods ltd","timestamp":"2024-04-30T10:41:00+05:30","market_timestamp":"2024-04-30T10:41:00+05:30","off_market_hours":false}