{"url":"https://www.moneycontrol.com/news/business/adani-in-talks-with-banks-to-borrow-600-million-for-gas-unit-12715533.html","title":"Adani in talks with banks to borrow $600 million for gas unit","description":"The loan will be raised by Dhamra LNG Terminal Pvt., a unit of Adani Total Pvt., the people said, asking not be named because the details are private. The debt’s tenor could range from three to five years, with the pricing likely linked to the Secured Overnight Financing Rate, they said.Adani in talks with banks to borrow $600 million for gas unit","content":"Billionaire Gautam Adani’s conglomerate is seeking an offshore loan of about $600 million to refinance existing debt, according to people familiar with the matter. The loan will be raised by Dhamra LNG Terminal Pvt., a unit of Adani Total Pvt., the people said, asking not be named because the details are private. The debt’s tenor could range from three to five years, with the pricing likely linked to the Secured Overnight Financing Rate, they said. The port-to-power group is discussing the planned transaction with lenders including Credit Agricole, DBS Bank Ltd., BNP Paribas, Mitsubishi UFJ Financial Group Inc., and Mizuho Bank Ltd., two of the people said. Adani is likely to conclude the borrowing in the next two months. The conglomerate is regaining the confidence of investors since being targeted early last year by US short seller Hindenburg Research. In March, the group saw robust demand for its first public bond sale since the shortseller crisis. Adani Total is an equal venture between Adani and TotalEnergies. Prime Minister Narendra Modi’s government is trying to increase the country’s ability to import LNG to lift the share of natural gas in its energy mix to 15% by 2030 from about 7% now. The move is to help lower the dependence on dirtier fossil fuels, such as coal and oil. ","cleaned_content":"billionaire gautam adani s conglomerate is seeking an offshore loan of about \u003cSIX_HUNDRED\u003e million to refinance existing debt according to people familiar with the matter the loan will be raised by dhamra lng terminal pvt a unit of adani total pvt the people said asking not be named because the details are private the debt s tenor could range from three to five years with the pricing likely linked to the secured overnight financing rate they said the port to power group is discussing the planned transaction with lenders including credit agricole dbs bank ltd bnp paribas mitsubishi ufj financial group inc and mizuho bank ltd two of the people said adani is likely to conclude the borrowing in the next two months the conglomerate is regaining the confidence of investors since being targeted early last year by us short seller hindenburg research in march the group saw robust demand for its first public bond sale since the shortseller crisis adani total is an equal venture between adani and totalenergies prime minister narendra modi s government is trying to increase the country s ability to import lng to lift the share of natural gas in its energy mix to \u003cONE_TEN_PERCENT\u003e by \u003cTWO_THOUSAND\u003e from about \u003cSEVEN_PERCENT\u003e now the move is to help lower the dependence on dirtier fossil fuels such as coal and oil","timestamp":"2024-05-06T13:08:00+05:30","market_timestamp":"2024-05-06T13:08:00+05:30","off_market_hours":false}