{"url":"https://www.moneycontrol.com/news/business/glenmark-pharma-gets-usfda-nod-for-generic-anti-inflammatory-drug-12710285.html","title":"Glenmark Pharma gets USFDA nod for generic anti-inflammatory drug","description":"The company has received approval from the US Food and Drug Administration (USFDA) for Acetaminophen and Ibuprofen tablets (250 mg/125 mg), the Mumbai-based drug maker said in a statement.Glenmark Pharma gets USFDA nod for generic anti-inflammatory drug","content":"Glenmark Pharmaceuticals on Monday said it has received approval from the US health regulator to sell a generic version of anti-inflammatory drug in the American market. The company has received approval from the US Food and Drug Administration (USFDA) for Acetaminophen and Ibuprofen tablets (250 mg/125 mg), the Mumbai-based drug maker said in a statement. The company's product is the generic version of Haleon US Holdings, LLC's Advil 2 Dual Action with Acetaminophen Tablets, 250 mg/125 mg (OTC), it added. According to Nielsen syndicated data for the latest 52 weeks period ending March 23, 2024, the Advil Dual Action with Acetaminophen Tablets, 250 mg/125 mg achieved annual sales of around USD 84.1 million. Glenmark said its current portfolio consists of 195 products authorised for distribution in the US marketplace and 52 abbreviated new drug applications (ANDAs) pending approval with the USFDA. Shares of Glenmark Pharma were trading marginally up at Rs 1,080.45 apiece on the BSE. ","cleaned_content":"glenmark pharmaceuticals on monday said it has received approval from the us health regulator to sell a generic version of anti inflammatory drug in the american market the company has received approval from the us food and drug administration usfda for acetaminophen and ibuprofen tablets \u003cTWO_HUNDRED\u003e mg \u003cONE_HUNDRED\u003e mg the mumbai based drug maker said in a statement the companys product is the generic version of haleon us holdings llcs advil \u003cTWO_\u003e dual action with acetaminophen tablets \u003cTWO_HUNDRED\u003e mg \u003cONE_HUNDRED\u003e mg otc it added according to nielsen syndicated data for the latest \u003cFIVE_TEN\u003e weeks period ending march \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e the advil dual action with acetaminophen tablets \u003cTWO_HUNDRED\u003e mg \u003cONE_HUNDRED\u003e mg achieved annual sales of around usd \u003cEIGHT_TEN\u003e million glenmark said its current portfolio consists of \u003cONE_HUNDRED\u003e products authorised for distribution in the us marketplace and \u003cFIVE_TEN\u003e abbreviated new drug applications andas pending approval with the usfda shares of glenmark pharma were trading marginally up at rs \u003cONE_THOUSAND\u003e apiece on the bse","timestamp":"2024-04-29T10:54:00+05:30","market_timestamp":"2024-04-29T10:54:00+05:30","off_market_hours":false}