{"url":"https://www.moneycontrol.com/news/business/indian-antitrust-regulator-checks-if-pernod-colluded-with-new-delhi-retailers-12712189.html","title":"Indian antitrust regulator checks if Pernod colluded with New Delhi retailers","description":"With brands such as Chivas Regal, Glenlivet and Absolut vodka, Pernod has a share of 17% in a liquor market it says is its second biggest globally by net sales, but one where it is embroiled in licence, tax and antitrust difficulties.Indian antitrust regulator checks if Pernod colluded with New Delhi retailersRelated stories","content":"India's competition watchdog is reviewing accusations that France's Pernod Ricard colluded with retailers in New Delhi to boost market share, the latest headache for the spirits giant in a key market, legal papers seen by Reuters show. With brands such as Chivas Regal, Glenlivet and Absolut vodka, Pernod has a share of 17% in a liquor market it says is its second biggest globally by net sales, but one where it is embroiled in licence, tax and antitrust difficulties. The latest accusations figure in a confidential filing in March on practices in the liquor industry made by an individual identified only by the first name Mohit, who has a record of taking up public interest litigations. Pernod is accused of gaining market share by asking retailers in the Indian capital to stock more of its goods in return for helping them secure loans to bid for store licences, according to the filing. Reuters reviewed the filing, which is not public, in line with the watchdog's rules. In a statement to Reuters, Pernod said it had not been notified of the new antitrust case, but was committed to comply with local laws and \"instruct and educate our teams\" to do the same. The competition regulator did not reply to Reuters' queries. Telephone calls to the complainant went unanswered. The accusations rely mostly on findings by India's financial crime agency, the Enforcement Directorate, as it looks into Pernod's alleged role in a graft case centred on the city's liquor policy that led to the 2022 arrest of a company official. Drawing on the findings, the CCI complaint accuses Pernod of providing $24 million in corporate guarantees to its bankers in 2021 to help city retailers get loans. Retailers then ensured that 35% of the stock in their shops consisted of Pernod brands. The findings \"clearly spill the beans that the purpose of the corporate guarantee was cartelisation by Pernod with selected retailers for brand pushing at the expense of fair competition,\" the case document states. Among Pernod's other woes, it has, for more than a year, unsuccessfully sought a retail licence for its products in New Delhi. It faces another antitrust case for misconduct in south India and is contesting a tax demand for nearly $250 million, for allegedly undervaluing imports. Pernod has repeatedly denied any wrongdoing in all the cases. The latest CCI case centres on Enforcement Directorate findings that Pernod's acting chief financial officer for India consented in mid-2021 to the issuance of corporate guarantees for facilitating loans to Delhi retailers, and advised the group CFO, Helene de Tissot, of it in an email on July 13, 2021. Pernod's \"support\" of $24 million to bidders for store licences had the potential to generate an additional $15 million \"benefit over a three-year period\" and the move \"will also enable us to counter local players' threat\", the email said. The CCI case also cites extracts of a Pernod PowerPoint presentation in June 2021 that mentioned an internal plan to \"take control of retail shops\" in New Delhi. Reuters has previously reported the email and the presentation. ","cleaned_content":"indias competition watchdog is reviewing accusations that frances pernod ricard colluded with retailers in new delhi to boost market share the latest headache for the spirits giant in a key market legal papers seen by reuters show with brands such as chivas regal glenlivet and absolut vodka pernod has a share of \u003cONE_TEN_PERCENT\u003e in a liquor market it says is its second biggest globally by net sales but one where it is embroiled in licence tax and antitrust difficulties the latest accusations figure in a confidential filing in march on practices in the liquor industry made by an individual identified only by the first name mohit who has a record of taking up public interest litigations pernod is accused of gaining market share by asking retailers in the indian capital to stock more of its goods in return for helping them secure loans to bid for store licences according to the filing reuters reviewed the filing which is not public in line with the watchdogs rules in a statement to reuters pernod said it had not been notified of the new antitrust case but was committed to comply with local laws and instruct and educate our teams to do the same the competition regulator did not reply to reuters queries telephone calls to the complainant went unanswered the accusations rely mostly on findings by indias financial crime agency the enforcement directorate as it looks into pernods alleged role in a graft case centred on the citys liquor policy that led to the \u003cTWO_THOUSAND\u003e arrest of a company official drawing on the findings the cci complaint accuses pernod of providing \u003cTWO_TEN\u003e million in corporate guarantees to its bankers in \u003cTWO_THOUSAND\u003e to help city retailers get loans retailers then ensured that \u003cTHREE_TEN_PERCENT\u003e of the stock in their shops consisted of pernod brands the findings clearly spill the beans that the purpose of the corporate guarantee was cartelisation by pernod with selected retailers for brand pushing at the expense of fair competition the case document states among pernods other woes it has for more than a year unsuccessfully sought a retail licence for its products in new delhi it faces another antitrust case for misconduct in south india and is contesting a tax demand for nearly \u003cTWO_HUNDRED\u003e million for allegedly undervaluing imports pernod has repeatedly denied any wrongdoing in all the cases the latest cci case centres on enforcement directorate findings that pernods acting chief financial officer for india consented in mid \u003cTWO_THOUSAND\u003e to the issuance of corporate guarantees for facilitating loans to delhi retailers and advised the group cfo helene de tissot of it in an email on july \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e pernods support of \u003cTWO_TEN\u003e million to bidders for store licences had the potential to generate an additional \u003cONE_TEN\u003e million benefit over a three year period and the move will also enable us to counter local players threat the email said the cci case also cites extracts of a pernod powerpoint presentation in june \u003cTWO_THOUSAND\u003e that mentioned an internal plan to take control of retail shops in new delhi reuters has previously reported the email and the presentation","timestamp":"2024-05-01T13:45:00+05:30","market_timestamp":"2024-05-01T13:45:00+05:30","off_market_hours":false}