{"url":"https://www.moneycontrol.com/news/business/mahindra-sales-up-13-in-april-at-70471-units-12712983.html","title":"Mahindra sales up 13% in April at 70,471 units","description":"The company's total dispatches to its dealers stood at 62,294 units in April 2023.Mahindra sales up 13% in April at 70,471 units","content":"Mahindra \u0026 Mahindra on Thursday said its total wholesales increased 13 per cent year-on-year to 70,471 units in April as compared to the same month last year. The company's total dispatches to its dealers stood at 62,294 units in April 2023. The Mumbai-based auto major's passenger vehicle sales in the domestic market rose 18 per cent to 41,008 units last month against 34,698 units in April 2023, it said in a statement. The company said its tractor sales in April 2024 rose 2 per cent to 37,039 units as against 36,405 units in the same period last year. \"Government's wheat procurement operations are going on in full swing with good mandi arrivals, keeping the rural cash flows healthy,\" M\u0026M President,? Farm Equipment Sector Hemant Sikka said. IMD's forecast of an above normal monsoon rains and festivals in the month of April have helped bring positivity in rural sentiments, he added. ","cleaned_content":"mahindra mahindra on thursday said its total wholesales increased \u003cONE_TEN_PERCENT\u003e year on year to \u003cSEVEN_TEN_THOUSAND\u003e units in april as compared to the same month last year the companys total dispatches to its dealers stood at \u003cSIX_TEN_THOUSAND\u003e units in april \u003cTWO_THOUSAND\u003e the mumbai based auto majors passenger vehicle sales in the domestic market rose \u003cONE_TEN_PERCENT\u003e to \u003cFOUR_TEN_THOUSAND\u003e units last month against \u003cTHREE_TEN_THOUSAND\u003e units in april \u003cTWO_THOUSAND\u003e it said in a statement the company said its tractor sales in april \u003cTWO_THOUSAND\u003e rose \u003cTWO_PERCENT\u003e to \u003cTHREE_TEN_THOUSAND\u003e units as against \u003cTHREE_TEN_THOUSAND\u003e units in the same period last year governments wheat procurement operations are going on in full swing with good mandi arrivals keeping the rural cash flows healthy m m president farm equipment sector hemant sikka said imds forecast of an above normal monsoon rains and festivals in the month of april have helped bring positivity in rural sentiments he added","timestamp":"2024-05-02T13:21:00+05:30","market_timestamp":"2024-05-02T13:21:00+05:30","off_market_hours":false}