{"url":"https://www.moneycontrol.com/news/business/bpcl-hpcl-to-consider-bonus-share-issue-this-week-12716476.html","title":"BPCL, HPCL to consider bonus share issue this week","description":"In separate filings to the stock exchanges, the two firms said their boards will meet on May 9 to consider and approve the issuance of bonus shares.BPCL, HPCL to consider bonus share issue this weekRelated stories","content":"Oil refining and fuel marketing companies Bharat Petroleum Corporation Ltd (BPCL) and Hindustan Petroleum Corporation Ltd (HPCL) will this week consider issuing bonus shares to their shareholders. In separate filings to the stock exchanges, the two firms said their boards will meet on May 9 to consider and approve the issuance of bonus shares. A bonus issue, also known as a scrip issue or a capitalization issue, is an offer of free additional shares to existing shareholders. It increases a company's outstanding shares but not its market capitalisation. If approved, this would be the fifth bonus issue by BPCL, the last being in July 2017. In the case of HPCL, it will be the third time the company will be distributing bonus shares to its shareholders. HPCL had previously, in July 2017, given bonus shares in the ratio of 1:2, entitling shareholders to receive one additional share for every two shares held. Prior to that in September 2016, the firm had issued bonus shares in the ratio of 2:1. BPCL on the other hand had issued a 1:2 bonus share in July 2017. Prior to that, it had given a bonus share in the ratio of 1:1 (one free share for every share held) on three occasions - July 2016, July 2012 and December 2000. In a stock exchange filing, HPCL said its board is meeting on May 9 to approve financial results for the 2023-24 fiscal and fourth quarter that ended March 31. \"...the Board will also consider a proposal for recommendation of Bonus Equity Share subject to the approval of Members of the Company, including fixation of Record Date for the said Bonus Issue,\" it said. Separately, BPCL said its board will meet on May 9 to consider and approve the financial results for the quarter and financial year ended March 31, 2024, and also to consider the recommendation of final dividend. \"It is hereby informed that the Board of Directors of the Company may consider the issue of Bonus Shares in the aforesaid Board Meeting,\" BPCL said. ","cleaned_content":"oil refining and fuel marketing companies bharat petroleum corporation ltd bpcl and hindustan petroleum corporation ltd hpcl will this week consider issuing bonus shares to their shareholders in separate filings to the stock exchanges the two firms said their boards will meet on may \u003cNINE_\u003e to consider and approve the issuance of bonus shares a bonus issue also known as a scrip issue or a capitalization issue is an offer of free additional shares to existing shareholders it increases a companys outstanding shares but not its market capitalisation if approved this would be the fifth bonus issue by bpcl the last being in july \u003cTWO_THOUSAND\u003e in the case of hpcl it will be the third time the company will be distributing bonus shares to its shareholders hpcl had previously in july \u003cTWO_THOUSAND\u003e given bonus shares in the ratio of \u003cONE_\u003e \u003cTWO_\u003e entitling shareholders to receive one additional share for every two shares held prior to that in september \u003cTWO_THOUSAND\u003e the firm had issued bonus shares in the ratio of \u003cTWO_\u003e \u003cONE_\u003e bpcl on the other hand had issued a \u003cONE_\u003e \u003cTWO_\u003e bonus share in july \u003cTWO_THOUSAND\u003e prior to that it had given a bonus share in the ratio of \u003cONE_\u003e \u003cONE_\u003e one free share for every share held on three occasions july \u003cTWO_THOUSAND\u003e july \u003cTWO_THOUSAND\u003e and december \u003cTWO_THOUSAND\u003e in a stock exchange filing hpcl said its board is meeting on may \u003cNINE_\u003e to approve financial results for the \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fiscal and fourth quarter that ended march \u003cTHREE_TEN\u003e the board will also consider a proposal for recommendation of bonus equity share subject to the approval of members of the company including fixation of record date for the said bonus issue it said separately bpcl said its board will meet on may \u003cNINE_\u003e to consider and approve the financial results for the quarter and financial year ended march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e and also to consider the recommendation of final dividend it is hereby informed that the board of directors of the company may consider the issue of bonus shares in the aforesaid board meeting bpcl said","timestamp":"2024-05-07T13:39:00+05:30","market_timestamp":"2024-05-07T13:39:00+05:30","off_market_hours":false}