{"url":"https://www.moneycontrol.com/news/business/patel-engineering-jv-emerges-as-lowest-bidder-for-rs-343-crore-project-in-maharashtra-12718224.html","title":"Patel Engineering JV emerges as lowest bidder for Rs 343 crore project in Maharashtra","description":"The project is to be completed in a period of 24 months.Patel Engineering JV emerges as lowest bidder for Rs 343 crore project in Maharashtra","content":"Infrastructure company Patel Engineering and its joint venture partner have emerged as the lowest bidder for a Rs 342.76 crore water lifting project in Maharashtra. The project is to be completed in a period of 24 months. The said project is located in the state of Maharashtra and the project is to be executed in a Joint Venture, of which Patel Engineering's share is 35 per cent. The contract entails works involving construction of water lifting arrangement work for first stage from submergence of Jigaon project including civil, mechanical, electrical component and allied works, the filing added. The Mumbai-based engineering, procurement, and construction firm has a strong presence in tunnels and underground works for hydroelectric and dam projects. ","cleaned_content":"infrastructure company patel engineering and its joint venture partner have emerged as the lowest bidder for a rs \u003cTHREE_HUNDRED\u003e crore water lifting project in maharashtra the project is to be completed in a period of \u003cTWO_TEN\u003e months the said project is located in the state of maharashtra and the project is to be executed in a joint venture of which patel engineerings share is \u003cTHREE_TEN_PERCENT\u003e the contract entails works involving construction of water lifting arrangement work for first stage from submergence of jigaon project including civil mechanical electrical component and allied works the filing added the mumbai based engineering procurement and construction firm has a strong presence in tunnels and underground works for hydroelectric and dam projects","timestamp":"2024-05-09T12:24:00+05:30","market_timestamp":"2024-05-09T12:24:00+05:30","off_market_hours":false}