{"url":"https://www.moneycontrol.com/news/business/who-are-the-two-iconic-indian-spice-brands-under-scrutiny-12720407.html","title":"Who are the two iconic Indian spice brands under scrutiny?","description":"A Hong Kong sales ban on some of their products after a cancer-causing pesticide was found has triggered a wave of scrutiny, including in the United States, the Maldives, India and Australia. Both brands say their products are safe.Who are the two iconic Indian spice brands under scrutiny?Related stories","content":"For decades, India's spice makers MDH and Everest have been ubiquitous in kitchens around the world with their products being essential ingredients in chicken and fish curries and vegetable dishes. A Hong Kong sales ban on some of their products after a cancer-causing pesticide was found has triggered a wave of scrutiny, including in the United States, the Maldives, India and Australia. Both brands say their products are safe. Here are some facts and background on the two brands: * New Delhi-based MDH started in 1919 and is a family-run business. * It rose to popularity with ads and packaging featuring its founder Dharampal Gulati who sported a handlebar moustache and a turban. Gulati, often dubbed as India's \"Spice King\", died in 2020. * MDH's website says it has 62 products. It deals in grounded spices, as well as spice blends which were created after \"decades of research\". * MDH has five factories and its products are sold in India and markets such as Australia, the United States, Europe, Canada and the United Kingdom through a network of more than 400,000 retail dealers. * MDH's revenue for 2022-2023 stood at $260 million. EVEREST * Everest Food Products started in 1967 with three products. Its founder Vadilal Bhai Shah started his business from a small 200 square feet spice shop. * With 52 products, Everest today has global presence in around 80 countries, including in North America, Europe, the Middle East, the Asia Pacific and Africa. * Some 20 million households use Everest products every day and 3.7 billion packs of its products are sold each year, according to its website. Around 620,000 outlets sell Everest products in 1,000 small towns and cities of India. * India's Bollywood stars Amitabh Bachchan and Shah Rukh Khan are Everest brand ambassadors, appearing together in many TV commercials to promote its products, especially those to make the famous rice dish, biryani. * Everest's net sales for 2022-23 stood at $365 million. ","cleaned_content":"for decades indias spice makers mdh and everest have been ubiquitous in kitchens around the world with their products being essential ingredients in chicken and fish curries and vegetable dishes a hong kong sales ban on some of their products after a cancer causing pesticide was found has triggered a wave of scrutiny including in the united states the maldives india and australia both brands say their products are safe here are some facts and background on the two brands new delhi based mdh started in \u003cONE_THOUSAND\u003e and is a family run business it rose to popularity with ads and packaging featuring its founder dharampal gulati who sported a handlebar moustache and a turban gulati often dubbed as indias spice king died in \u003cTWO_THOUSAND\u003e mdhs website says it has \u003cSIX_TEN\u003e products it deals in grounded spices as well as spice blends which were created after decades of research mdh has five factories and its products are sold in india and markets such as australia the united states europe canada and the united kingdom through a network of more than \u003cFOUR_HUNDRED_THOUSAND\u003e retail dealers mdhs revenue for \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e stood at \u003cTWO_HUNDRED\u003e million everest everest food products started in \u003cONE_THOUSAND\u003e with three products its founder vadilal bhai shah started his business from a small \u003cTWO_HUNDRED\u003e square feet spice shop with \u003cFIVE_TEN\u003e products everest today has global presence in around \u003cEIGHT_TEN\u003e countries including in north america europe the middle east the asia pacific and africa some \u003cTWO_TEN\u003e million households use everest products every day and \u003cTHREE_\u003e billion packs of its products are sold each year according to its website around \u003cSIX_HUNDRED_THOUSAND\u003e outlets sell everest products in \u003cONE_THOUSAND\u003e small towns and cities of india indias bollywood stars amitabh bachchan and shah rukh khan are everest brand ambassadors appearing together in many tv commercials to promote its products especially those to make the famous rice dish biryani everests net sales for \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e stood at \u003cTHREE_HUNDRED\u003e million","timestamp":"2024-05-13T06:05:00+05:30","market_timestamp":"2024-05-13T09:15:00+05:30","off_market_hours":true}