{"url":"https://www.moneycontrol.com/news/business/sii-to-acquire-20-stake-in-integrimedical-12724853.html","title":"SII to acquire 20% stake in IntegriMedical","description":"IntegriMedical has developed a US patented needle-free Injection System (N-FIS) that utilises high-velocity jet stream using mechanical power to effectively and consistently administer biologics and drugs, Serum Institute of India (SII) said in a statement.SII to acquire 20% stake in IntegriMedicalRelated stories","content":"Vaccines manufacturer Serum Institute of India (SII) on Friday said it is acquiring 20 per cent stake in IntegriMedical, to advance needle-free injection system technology. IntegriMedical has developed a US patented needle-free Injection System (N-FIS) that utilises high-velocity jet stream using mechanical power to effectively and consistently administer biologics and drugs, Serum Institute of India (SII) said in a statement. The company, however, did not disclose the financial details of the transaction. \"IntegriMedical's N-FIS represents a significant advancement in drug delivery and we envision a needle-free solution to deliver vaccines. We believe this could potentially revolutionize the way we administer vaccines, making the process more comfortable for patients and healthcare professionals,\" SII CEO Adar Poonawalla said. IntegriMedical's N-FIS has received regulatory approvals from CDSCO (Central Drugs Standard Control Organisation), CE (European regulatory approval) MDSAP (Medical Device Single Audit Program, Australia) and is ISO 13485 certified, the statement said. \"Additionally, the technology is patented in the United States,\" it added. \"This investment is a testament to the potential of our needle-free Injections System technology and its ability to revolutionize drug delivery. SII's expertise in vaccine manufacturing and global distribution will be invaluable as we work towards making our technology more widely accessible to patients worldwide,\" IntegriMedical Managing Director Sarvesh Mutha said. N-FIS will be available in the Indian private market, offering patients and healthcare providers an alternative to traditional needle-based injections, SII said. The technology's advantages include the elimination of needle-phobia, alleviation of pain during administration, convenience of use, and prevention of needle-stick injuries and cross-contamination, it added. ","cleaned_content":"vaccines manufacturer serum institute of india sii on friday said it is acquiring \u003cTWO_TEN_PERCENT\u003e stake in integrimedical to advance needle free injection system technology integrimedical has developed a us patented needle free injection system n fis that utilises high velocity jet stream using mechanical power to effectively and consistently administer biologics and drugs serum institute of india sii said in a statement the company however did not disclose the financial details of the transaction integrimedicals n fis represents a significant advancement in drug delivery and we envision a needle free solution to deliver vaccines we believe this could potentially revolutionize the way we administer vaccines making the process more comfortable for patients and healthcare professionals sii ceo adar poonawalla said integrimedicals n fis has received regulatory approvals from cdsco central drugs standard control organisation ce european regulatory approval mdsap medical device single audit program australia and is iso \u003cONE_TEN_THOUSAND\u003e certified the statement said additionally the technology is patented in the united states it added this investment is a testament to the potential of our needle free injections system technology and its ability to revolutionize drug delivery siis expertise in vaccine manufacturing and global distribution will be invaluable as we work towards making our technology more widely accessible to patients worldwide integrimedical managing director sarvesh mutha said n fis will be available in the indian private market offering patients and healthcare providers an alternative to traditional needle based injections sii said the technologys advantages include the elimination of needle phobia alleviation of pain during administration convenience of use and prevention of needle stick injuries and cross contamination it added","timestamp":"2024-05-17T15:48:00+05:30","market_timestamp":"2024-05-20T09:15:00+05:30","off_market_hours":true}