{"url":"https://www.moneycontrol.com/news/business/larsen-toubro-bags-multiple-orders-for-buildings-factories-business-12724972.html","title":"Larsen \u0026 Toubro bags multiple orders for buildings, factories business","description":"The company has bagged a project from the Institute of Neurosciences Kolkata, for constructing a medical college and hospital campus in Kolkata on a design and build mode.Larsen \u0026 Toubro bags multiple orders for buildings, factories business","content":"Engineering and construction conglomerate Larsen \u0026 Toubro (L\u0026T) on Friday said its buildings and factories business vertical has bagged multiple orders. The company has bagged a project from the Institute of Neurosciences Kolkata, for constructing a medical college and hospital campus in Kolkata on a design and build mode. This involves a 605-bed hospital and a medical college. The project is to be executed in two phases over a period of 60 months. L\u0026T's Buildings and factories business has also received several add-on orders. Larsen \u0026 Toubro is a 27 billion dollar Indian multinational enterprise engaged in Engineering, Procurement, and Construction (EPC) projects, hi-tech manufacturing and services operating across multiple geographies. ","cleaned_content":"engineering and construction conglomerate larsen toubro l t on friday said its buildings and factories business vertical has bagged multiple orders the company has bagged a project from the institute of neurosciences kolkata for constructing a medical college and hospital campus in kolkata on a design and build mode this involves a \u003cSIX_HUNDRED\u003e bed hospital and a medical college the project is to be executed in two phases over a period of \u003cSIX_TEN\u003e months l ts buildings and factories business has also received several add on orders larsen toubro is a \u003cTWO_TEN\u003e billion dollar indian multinational enterprise engaged in engineering procurement and construction epc projects hi tech manufacturing and services operating across multiple geographies","timestamp":"2024-05-17T12:12:00+05:30","market_timestamp":"2024-05-17T12:12:00+05:30","off_market_hours":false}