{"url":"https://www.moneycontrol.com/technology/pvr-inox-now-also-a-food-giant-as-popcorn-and-pepsi-sale-outpaces-box-office-article-12722239.html","title":"PVR Inox now also a food giant as popcorn, Pepsi sales rate outpace box-office biz","description":"The exhibitor is giving many quick-service restaurant chains a run for their money, with close to Rs 2,000 crore F\u0026B business. It is PVR Inox's second-biggest contributor to overall company revenues. PVR Inox F\u0026B business growing faster than movie ticket sales.Related stories","content":"India's top multiplex chain PVR Inox's food and beverage (F\u0026B) business grew faster than movie ticket sales last fiscal. Revenue from F\u0026B sales grew 21 percent in FY24, higher than the sales from movie tickets, which registered a 19 percent growth in the last financial year. F\u0026B revenue increased to Rs 1,958.4 crore in FY24 from Rs 1,618 crore a year ago while movie ticket revenue stood at Rs 3,279.9 crore versus Rs 2,751.4 crore in FY23. PVR Inox's box-office revenue grew 19 percent in FY24 to Rs 3,915.8 crore from Rs 3,295.2 crore in FY23. Significant volatility was observed in box-office collections during the year, the company said. Also read: PVR Inox lowers FY25 capex by 25%, plans to shut down 70 non-performing screens Innovation in the F\u0026B segment \"F\u0026B revenue is higher because they have opened up a lot of these places in the metros and non-metros where people can come and consume food and not necessarily watch movies. The company has also started delivery as an experiment in certain places but in very selective markets. So, these aspects have contributed to higher F\u0026B revenue growth,\" said Karan Taurani, senior vice-president, Elara Capital. PVR Inox continues to innovate in the F\u0026B format, which can be seen in the strategic partnership with Devyani International. \"This shows that they are eager to grow the F\u0026B business in its entirety. Also, given the uncertainty surrounding ticket sales, the F\u0026B business would be something they will accelerate to hedge the theatrical risk,\" said Nitin Menon of NV Capital. Also read: KFC operator Devyani International, PVR Inox join hands to operate food courts in shopping malls PVR Inox versus QSR chains The exhibitor is giving many quick-service restaurant (QSR) chains a run for their money with close to Rs 2,000 crore F\u0026B business. This is PVR Inox's second-biggest contributor to the company's overall revenue. Westlife Foodworld, the owner-operator of McDonald's restaurants across West and South India, reported consolidated total income of Rs 2,410.28 crore in FY24. Devyani International, which runs the largest franchisee for Yum brands, including KFC and Pizza Hut in India, is also the sole franchise for Costa Coffee brands and cafes in India. It recorded a consolidated revenue from operations of Rs 3,556.32 crore in FY24. Another QSR chain, Sapphire Foods India, which is engaged in the franchisee business of KFC, Pizza Hut and Taco Bell branded restaurants, reported an FY24 revenue of Rs 2,594.27 crore. Also read: PVR Inox posts Rs 130-cr net loss in Q4 as Bollywood underperforms India’s largest food service company, Jubilant FoodWorks Limited, which operates 1,928 Domino’s stores and 25 Dunkin’ restaurants in the country, reported a revenue of Rs 4,010 crore in the nine months of FY24 . The company will announce its Q4 FY24 results on May 22. Burger King's India operator Restaurant Brands Asia recorded a total income of Rs 1,854 crore in the nine months of FY24. In FY23, PVR Inox emerged as the fifth-largest food company with F\u0026B revenue of Rs 1,525 crore, ahead of Restaurant Brands Asia, which clocked Rs 1,343 crore. Other brands, including Jubilant FoodWorks, Devyani International, Westlife Foodworld and Sapphire Foods, reported annual revenue of Rs 5,002 crore, Rs 2,617 crore, Rs 2,177 crore and Rs 1,883 crore, respectively, in FY23.  PVR Inox's F\u0026B expansion PVR Inox is now looking to expand its F\u0026B business and announced a joint venture with Devyani International on May 14 to open food courts in shopping malls. Also read: PVR Inox to expand F\u0026B pie, plans to open 5-6 food courts with Devyani International The multiplex operator is looking to pivot from being only an exhibition company to being an F\u0026B player as well, said PVR Inox's Managing Director Ajay Bijli during a Q4FY24 earnings call. \"F\u0026B continues to be a strong revenue generator and introducing new products, especially unlimited Pepsi and popcorn, has done well for us. This has helped to drive up average SPH (spend per head),\" said Sood. SPH increased over 10 percent to Rs 132 in last financial year from Rs 120 in FY23. Last year, the company started running an offer of free refills for popcorn and Pepsi. It also slashed prices of snacks last year and is now running an offer on four to five food items which are available at flat Rs 99 from Monday to Thursday. Sood said that the company has also done a lot of work in synchronising the product portfolio across both the chains of PVR and Inox. \"All the Inox cinemas where we had to launch a non-vegetarian menu have been done, which is approximately 70 percent of Inox sites. The rest of the sites will stick to vegetarian menu because of the catchment they are situated in. Everywhere else, the transition completed in March,\" the CFO said. ","cleaned_content":"indias top multiplex chain pvr inoxs food and beverage f b business grew faster than movie ticket sales last fiscal revenue from f b sales grew \u003cTWO_TEN_PERCENT\u003e in fy24 higher than the sales from movie tickets which registered a \u003cONE_TEN_PERCENT\u003e growth in the last financial year f b revenue increased to rs \u003cONE_THOUSAND\u003e crore in fy24 from rs \u003cONE_THOUSAND\u003e crore a year ago while movie ticket revenue stood at rs \u003cTHREE_THOUSAND\u003e crore versus rs \u003cTWO_THOUSAND\u003e crore in fy23 pvr inoxs box office revenue grew \u003cONE_TEN_PERCENT\u003e in fy24 to rs \u003cTHREE_THOUSAND\u003e crore from rs \u003cTHREE_THOUSAND\u003e crore in fy23 significant volatility was observed in box office collections during the year the company said also read pvr inox lowers fy25 capex by \u003cTWO_TEN_PERCENT\u003e plans to shut down \u003cSEVEN_TEN\u003e non performing screens innovation in the f b segment f b revenue is higher because they have opened up a lot of these places in the metros and non metros where people can come and consume food and not necessarily watch movies the company has also started delivery as an experiment in certain places but in very selective markets so these aspects have contributed to higher f b revenue growth said karan taurani senior vice president elara capital pvr inox continues to innovate in the f b format which can be seen in the strategic partnership with devyani international this shows that they are eager to grow the f b business in its entirety also given the uncertainty surrounding ticket sales the f b business would be something they will accelerate to hedge the theatrical risk said nitin menon of nv capital also read kfc operator devyani international pvr inox join hands to operate food courts in shopping malls pvr inox versus qsr chains the exhibitor is giving many quick service restaurant qsr chains a run for their money with close to rs \u003cTWO_THOUSAND\u003e crore f b business this is pvr inoxs second biggest contributor to the companys overall revenue westlife foodworld the owner operator of mcdonalds restaurants across west and south india reported consolidated total income of rs \u003cTWO_THOUSAND\u003e crore in fy24 devyani international which runs the largest franchisee for yum brands including kfc and pizza hut in india is also the sole franchise for costa coffee brands and cafes in india it recorded a consolidated revenue from operations of rs \u003cTHREE_THOUSAND\u003e crore in fy24 another qsr chain sapphire foods india which is engaged in the franchisee business of kfc pizza hut and taco bell branded restaurants reported an fy24 revenue of rs \u003cTWO_THOUSAND\u003e crore also read pvr inox posts rs \u003cONE_HUNDRED\u003e cr net loss in q4 as bollywood underperforms india s largest food service company jubilant foodworks limited which operates \u003cONE_THOUSAND\u003e domino s stores and \u003cTWO_TEN\u003e dunkin restaurants in the country reported a revenue of rs \u003cFOUR_THOUSAND\u003e crore in the nine months of fy24 the company will announce its q4 fy24 results on may \u003cTWO_TEN\u003e burger kings india operator restaurant brands asia recorded a total income of rs \u003cONE_THOUSAND\u003e crore in the nine months of fy24 in fy23 pvr inox emerged as the fifth largest food company with f b revenue of rs \u003cONE_THOUSAND\u003e crore ahead of restaurant brands asia which clocked rs \u003cONE_THOUSAND\u003e crore other brands including jubilant foodworks devyani international westlife foodworld and sapphire foods reported annual revenue of rs \u003cFIVE_THOUSAND\u003e crore rs \u003cTWO_THOUSAND\u003e crore rs \u003cTWO_THOUSAND\u003e crore and rs \u003cONE_THOUSAND\u003e crore respectively in fy23 pvr inoxs f b expansion pvr inox is now looking to expand its f b business and announced a joint venture with devyani international on may \u003cONE_TEN\u003e to open food courts in shopping malls also read pvr inox to expand f b pie plans to open \u003cFIVE_\u003e \u003cSIX_\u003e food courts with devyani international the multiplex operator is looking to pivot from being only an exhibition company to being an f b player as well said pvr inoxs managing director ajay bijli during a q4fy24 earnings call f b continues to be a strong revenue generator and introducing new products especially unlimited pepsi and popcorn has done well for us this has helped to drive up average sph spend per head said sood sph increased over \u003cONE_TEN_PERCENT\u003e to rs \u003cONE_HUNDRED\u003e in last financial year from rs \u003cONE_HUNDRED\u003e in fy23 last year the company started running an offer of free refills for popcorn and pepsi it also slashed prices of snacks last year and is now running an offer on four to five food items which are available at flat rs \u003cNINE_TEN\u003e from monday to thursday sood said that the company has also done a lot of work in synchronising the product portfolio across both the chains of pvr and inox all the inox cinemas where we had to launch a non vegetarian menu have been done which is approximately \u003cSEVEN_TEN_PERCENT\u003e of inox sites the rest of the sites will stick to vegetarian menu because of the catchment they are situated in everywhere else the transition completed in march the cfo said","timestamp":"2024-05-15T14:21:00+05:30","market_timestamp":"2024-05-15T14:21:00+05:30","off_market_hours":false}