{"url":"https://www.moneycontrol.com/technology/pvr-inoxs-flop-show-in-q4-drives-its-focus-on-south-films-and-cricket-article-12722789.html","title":"PVR Inox's flop show in Q4 drives its focus on South films and cricket","description":"Pushpa 2 will be potentially the biggest release of the year, said Ajay Bijli, the company's managing director. PVR Inox is focusing on South India films and sports as new content dries up.  Related stories","content":"Exhibition company PVR Inox's quarter ended March was the weakest of FY24, a year that saw the company experiencing significant volatility in box office collections. It is now betting big on South Indian language films along with alternative content including cricket and concerts. PVR Inox has screened music concerts like Taylor Swift's Eras Tour. \"The box office has been quite slow. April and May have been slow due to the general election. A lot of films have been postponed. Q1 will be a slow quarter. From mid-June, we have decent releases. FY25 is looking good for South Indian films with a big lineup. Last year this segment was muted. Tamil, Telugu, Malayalam and Kannada are expected to do better this year. For the Hindi box office, we don't have as many big films as we did last year,\" said Nitin Sood, group chief financial officer, PVR Inox. Another focus is on non-film content like the upcoming Men’s T20 World Cup cricket tournament (June 2-29) with PVR Inox looking to screen key matches. The exhibitor had also screened the ICC Men’s World Cup 2023, for which it recorded an average occupancy of over 70 percent and average ticket price of Rs 580. Important games including India versus Pakistan, the India-New Zealand semifinal as well as the final match were sold out. While this kind of non-movie business is a small part of the pie, the multiplex chain is looking to grow this segment amid slow content flow. \"Alternate content is a small proportion and is about 1 percent of overall revenue but we are focused on bringing a lot of alternate content to our screens. We are experimenting with concerts, sports, which are big focus areas,\" said Sood. The exhibitor has also been playing old content due to a weak pipeline of new films, having screened movies like Dune, Oppenheimer and Titanic, alongside Hindi favourites such as Yeh Jawaani Hai Deewani, Jab We Met, Veer-Zaara, Dilwale Dulhania Le Jayenge, Mohabbatein and Rab Ne Bana Di Jodi. Earlier this year, PVR Inox had also as part of its alternative content portfolio screened the inauguration of the Ram Mandir in Ayodhya and the Republic Day event, for which it registered 70 percent and 65 percent occupancy, respectively. While year-on-year footfall increased in PVR Inox theatres by around 8 percent in FY24 to 151.4 million from 140.4 million in FY23, across the industry the traffic is down by 25-30 percent. To drive audiences, the company is counting on its revised version of the subscription plan called Passport. \"Under the new Passport subscription plan, we sold 1.75 lakh plans despite film releases being slow. June onwards, with a stronger lineup, this programme will be more meaningful. We are expecting its contribution to be significant in admissions once we have a content lineup in place. Also, out of the total Passports sold, South India's contribution is 35 percent followed by the North market at 32 percent,\" said Sood. Among the key releases expected this year are Chandu Champion and Bhool Bhulaiya 3 starring Kartik Aryan; Kalki 2898 AD starring Prabhas, Deepika Padukone and Amitabh Bachchan; Sitare Zameen Par starring Aamir Khan; Singham Again starring Ajay Devgn; Welcome 2 the Jungle and Sarfira starring Akshay Kumar; Stree 2 starring Shraddha Kapoor and Rajkumar Rao; and Indian 2 starring Kamal Hassan, among others. With the content pipeline expected to stabilise from next month, PVR Inox is expecting better advertising revenue in FY25. \"Ad revenue has direct correlation with the box office because advertisers want to advertise when there are strong footfalls in cinemas. We had a positive trajectory in FY24, and in FY25 we are hoping we will get closer to pre-Covid numbers. Cinema advertising will start taking off from Q2 as Q1 has been a slow quarter,\" Sood said. The company reported Rs 4,51.9 crore in ad revenue in the last financial year, up 18 percent from Rs 3,81.8 crore in FY23. Event alert: Moneycontrol and CNBC TV18 are hosting the ultimate event on artificial intelligence, bringing together entrepreneurs, ecosystem enablers, policymakers, industry leaders, and innovators on May 17 in Gurugram. Click here to register and gain access to the AI Alliance Delhi-NCR Chapter. https://www.moneycontrol.com/msite/global-ai-conclave/gurugram ","cleaned_content":"exhibition company pvr inoxs quarter ended march was the weakest of fy24 a year that saw the company experiencing significant volatility in box office collections it is now betting big on south indian language films along with alternative content including cricket and concerts pvr inox has screened music concerts like taylor swifts eras tour the box office has been quite slow april and may have been slow due to the general election a lot of films have been postponed q1 will be a slow quarter from mid june we have decent releases fy25 is looking good for south indian films with a big lineup last year this segment was muted tamil telugu malayalam and kannada are expected to do better this year for the hindi box office we dont have as many big films as we did last year said nitin sood group chief financial officer pvr inox another focus is on non film content like the upcoming men s t20 world cup cricket tournament june \u003cTWO_\u003e \u003cTWO_TEN\u003e with pvr inox looking to screen key matches the exhibitor had also screened the icc men s world cup \u003cTWO_THOUSAND\u003e for which it recorded an average occupancy of over \u003cSEVEN_TEN_PERCENT\u003e and average ticket price of rs \u003cFIVE_HUNDRED\u003e important games including india versus pakistan the india new zealand semifinal as well as the final match were sold out while this kind of non movie business is a small part of the pie the multiplex chain is looking to grow this segment amid slow content flow alternate content is a small proportion and is about \u003cONE_PERCENT\u003e of overall revenue but we are focused on bringing a lot of alternate content to our screens we are experimenting with concerts sports which are big focus areas said sood the exhibitor has also been playing old content due to a weak pipeline of new films having screened movies like dune oppenheimer and titanic alongside hindi favourites such as yeh jawaani hai deewani jab we met veer zaara dilwale dulhania le jayenge mohabbatein and rab ne bana di jodi earlier this year pvr inox had also as part of its alternative content portfolio screened the inauguration of the ram mandir in ayodhya and the republic day event for which it registered \u003cSEVEN_TEN_PERCENT\u003e and \u003cSIX_TEN_PERCENT\u003e occupancy respectively while year on year footfall increased in pvr inox theatres by around \u003cEIGHT_PERCENT\u003e in fy24 to \u003cONE_HUNDRED\u003e million from \u003cONE_HUNDRED\u003e million in fy23 across the industry the traffic is down by \u003cTWO_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e to drive audiences the company is counting on its revised version of the subscription plan called passport under the new passport subscription plan we sold \u003cONE_\u003e lakh plans despite film releases being slow june onwards with a stronger lineup this programme will be more meaningful we are expecting its contribution to be significant in admissions once we have a content lineup in place also out of the total passports sold south indias contribution is \u003cTHREE_TEN_PERCENT\u003e followed by the north market at \u003cTHREE_TEN_PERCENT\u003e said sood among the key releases expected this year are chandu champion and bhool bhulaiya \u003cTHREE_\u003e starring kartik aryan kalki \u003cTWO_THOUSAND\u003e ad starring prabhas deepika padukone and amitabh bachchan sitare zameen par starring aamir khan singham again starring ajay devgn welcome \u003cTWO_\u003e the jungle and sarfira starring akshay kumar stree \u003cTWO_\u003e starring shraddha kapoor and rajkumar rao and indian \u003cTWO_\u003e starring kamal hassan among others with the content pipeline expected to stabilise from next month pvr inox is expecting better advertising revenue in fy25 ad revenue has direct correlation with the box office because advertisers want to advertise when there are strong footfalls in cinemas we had a positive trajectory in fy24 and in fy25 we are hoping we will get closer to pre covid numbers cinema advertising will start taking off from q2 as q1 has been a slow quarter sood said the company reported rs \u003cFOUR_HUNDRED\u003e crore in ad revenue in the last financial year up \u003cONE_TEN_PERCENT\u003e from rs \u003cTHREE_HUNDRED\u003e crore in fy23 event alert moneycontrol and cnbc tv18 are hosting the ultimate event on artificial intelligence bringing together entrepreneurs ecosystem enablers policymakers industry leaders and innovators on may \u003cONE_TEN\u003e in gurugram click here to register and gain access to the ai alliance delhi ncr chapter https www moneycontrol com msite global ai conclave gurugram","timestamp":"2024-05-15T16:53:00+05:30","market_timestamp":"2024-05-16T09:15:00+05:30","off_market_hours":true}