{"url":"https://www.moneycontrol.com/news/business/adani-energy-completes-acquisition-of-essars-mahan-sipat-transmission-assets-for-rs-1900-cr-12723451.html","title":"Adani Energy completes acquisition of Essar's Mahan-Sipat transmission assets for Rs 1,900 cr","description":"The share acquisition is pursuant to definitive agreements signed in June 2022, a company statement said.Adani Energy completes acquisition of Essar's Mahan-Sipat transmission assets for Rs 1,900 cr","content":"Adani Energy Solutions on Thursday said it has completed the acquisition of Essar's Mahan-Sipat Transmission assets for an enterprise value of Rs 1,900 crore. The share acquisition is pursuant to definitive agreements signed in June 2022, a company statement said. According to the statement, Adani Energy Solutions Ltd (AESL), has acquired a 100 per cent stake in Essar Transco Limited after obtaining the requisite regulatory and other approvals for an enterprise value of Rs 1,900 crores. The project operates under the Central Electricity Regulatory Commission (CERC) regulated return framework and was commissioned on September 22, 2018. Adani Transmission Step Two Ltd, a wholly-owned subsidiary of Adani Energy Solutions has acquired 100 per cent stake in Essar Transco Ltd for Rs 1,900 crore. This establishes a new benchmark for AESL to raise capital and unlocks the lower-cost debt for its operational assets. MUFG Bank Ltd is the sole lender for the financing. The acquisition of the Mahan-Sipat transmission network will consolidate AESL's presence in central India with 4 operating assets having 3,373 ckt km in the region. ","cleaned_content":"adani energy solutions on thursday said it has completed the acquisition of essars mahan sipat transmission assets for an enterprise value of rs \u003cONE_THOUSAND\u003e crore the share acquisition is pursuant to definitive agreements signed in june \u003cTWO_THOUSAND\u003e a company statement said according to the statement adani energy solutions ltd aesl has acquired a \u003cONE_HUNDRED_PERCENT\u003e stake in essar transco limited after obtaining the requisite regulatory and other approvals for an enterprise value of rs \u003cONE_THOUSAND\u003e crores the project operates under the central electricity regulatory commission cerc regulated return framework and was commissioned on september \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e adani transmission step two ltd a wholly owned subsidiary of adani energy solutions has acquired \u003cONE_HUNDRED_PERCENT\u003e stake in essar transco ltd for rs \u003cONE_THOUSAND\u003e crore this establishes a new benchmark for aesl to raise capital and unlocks the lower cost debt for its operational assets mufg bank ltd is the sole lender for the financing the acquisition of the mahan sipat transmission network will consolidate aesls presence in central india with \u003cFOUR_\u003e operating assets having \u003cTHREE_THOUSAND\u003e ckt km in the region","timestamp":"2024-05-16T11:13:00+05:30","market_timestamp":"2024-05-16T11:13:00+05:30","off_market_hours":false}