{"url":"https://www.moneycontrol.com/news/business/tvs-motor-co-expects-25-30-of-2-wheeler-sales-to-come-from-evs-md-sudarshan-venu-12719095.html","title":"TVS Motor Co expects EVs to account for 25-30% of its two-wheeler sales in next 3 years: MD Sudarshan Venu","description":"The company is betting big on electric mobility and may even look at electric bicycle and cargo three-wheelers, to have a full range of products.The company is betting big on electric mobility and may even look at electric bicycle and cargo three-wheelers, to have a full range of products.Related stories","content":"TVS Motor Company expects electric vehicles to account for 25-30 per cent of its total two-wheeler sales in the next two to three years, said Managing Director Sudarshan Venu. The company is betting big on electric mobility and may even look at electric bicycle and cargo three-wheelers, to have a full range of products. They had earlier reiterated its commitment to invest Rs 5,000 crore towards design, development and deployment of future technologies, products, and digital capabilities. EV Outlook Venu said TVS will bring another electric scooter this year to add to its existing portfolio of iQube and TVS X, while asserting that the company's EV presence will be across both scooters and motorcycle segments. In FY24, the company's EV sales grew by 101 percent at 1.94 lakh units as against 97,000 units during 2022-23. TVS sold 19.9 lakh units of motorcycles and 15.7 lakh scooters. For electric motorcycles, he referred to the 'TVS Racing Electric One Make Championship' for which the company developed TVS Apache RTE (Racing Throttle Electric) race motorcycles as a sign of things to come in the segment. Also Read | Sudarshan Venu says would have joined real estate if not for his family business \"We may look at electric bicycles and electric cargo three-wheelers. We will have a full range of products,\" he said. He added that electric three-wheelers have a huge opportunity and it would grow fast particularly in urban areas. Venu further added that as e-commerce and logistics improve there is a greater opportunity for three-wheeler cargo applications in addition to passenger applications for both EV and CNG. When asked about future investments for EV, Venu said, \"We have already announced investments and we will continue to build this business. The investment momentum that you have seen in the last few years from our side will continue going into the future as well.\" With the battery technology rapidly evolving, he said TVS has partnered with \"the best globally on the cell side to ensure that we give the best option to customers each year\". The company has been focussing on in-house development of a slew of technologies for electric vehicles, he said, adding while a large number of engineers have been committed to EV, it would also continue to strengthen in software, analytics, digital and AI going forward. Sudarshan Venu, son of Venu Srinivasan, took over the post of  Managing Director in May 2022. TVS Motor Company saw its fourth-quarter net profit rise 18 percent to Rs 485 crore in the March quarter, aided by robust volumes, healthy product mix, better pricing and benign commodity costs. With PTI inputs ","cleaned_content":"tvs motor company expects electric vehicles to account for \u003cTWO_TEN\u003e \u003cTHREE_TEN_PERCENT\u003e of its total two wheeler sales in the next two to three years said managing director sudarshan venu the company is betting big on electric mobility and may even look at electric bicycle and cargo three wheelers to have a full range of products they had earlier reiterated its commitment to invest rs \u003cFIVE_THOUSAND\u003e crore towards design development and deployment of future technologies products and digital capabilities ev outlook venu said tvs will bring another electric scooter this year to add to its existing portfolio of iqube and tvs x while asserting that the companys ev presence will be across both scooters and motorcycle segments in fy24 the companys ev sales grew by \u003cONE_HUNDRED_PERCENT\u003e at \u003cONE_\u003e lakh units as against \u003cNINE_TEN_THOUSAND\u003e units during \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e tvs sold \u003cONE_TEN\u003e lakh units of motorcycles and \u003cONE_TEN\u003e lakh scooters for electric motorcycles he referred to the tvs racing electric one make championship for which the company developed tvs apache rte racing throttle electric race motorcycles as a sign of things to come in the segment also read sudarshan venu says would have joined real estate if not for his family business we may look at electric bicycles and electric cargo three wheelers we will have a full range of products he said he added that electric three wheelers have a huge opportunity and it would grow fast particularly in urban areas venu further added that as e commerce and logistics improve there is a greater opportunity for three wheeler cargo applications in addition to passenger applications for both ev and cng when asked about future investments for ev venu said we have already announced investments and we will continue to build this business the investment momentum that you have seen in the last few years from our side will continue going into the future as well with the battery technology rapidly evolving he said tvs has partnered with the best globally on the cell side to ensure that we give the best option to customers each year the company has been focussing on in house development of a slew of technologies for electric vehicles he said adding while a large number of engineers have been committed to ev it would also continue to strengthen in software analytics digital and ai going forward sudarshan venu son of venu srinivasan took over the post of managing director in may \u003cTWO_THOUSAND\u003e tvs motor company saw its fourth quarter net profit rise \u003cONE_TEN_PERCENT\u003e to rs \u003cFOUR_HUNDRED\u003e crore in the march quarter aided by robust volumes healthy product mix better pricing and benign commodity costs with pti inputs","timestamp":"2024-05-10T13:22:00+05:30","market_timestamp":"2024-05-10T13:22:00+05:30","off_market_hours":false}