{"url":"https://www.moneycontrol.com/technology/pvr-inox-to-expand-fb-pie-plans-to-open-5-6-food-courts-with-devyani-international-article-12722121.html","title":"PVR Inox to expand F\u0026B pie, plans to open 5-6 food courts with Devyani International","description":"The multiplex operator is looking to pivot from being only an exhibition company to being an F\u0026B player as well, said PVR Inox's Managing Director Ajay Bijli. PVR Inox to expand F\u0026B business by opening food courts in malls. Related stories","content":"India's largest multiplex operator PVR Inox is expanding its food and beverage (F\u0026B) business by venturing into pre-ticketed food business, which means the company wants a share of consumers' wallets before they buy a movie ticket. While one of the biggest contributors to the company's overall revenue is the F\u0026B segment, bulk of the revenue is from post-ticketed F\u0026B business. To grow its pre-ticketed F\u0026B segment, the exhibitor under a joint venture (JV) with QSR (quick service restaurant) chain Devyani International will open five to six food courts in the first year of launching the new entity. \"We will set up a JV in which Devyani will own 51 percent (share) and PVR Inox will own the remaining. The idea is to open food courts in shopping malls all over the country. Priority will be to open in present large shopping malls,\" Nitin Sood, Group CFO (Chief Financial Officer), PVR Inox, told Moneycontrol. \"It (online sales) is a small percentage, less than 1 percent. Most of the F\u0026B sales are in cinemas. Online segment hasn't done well for us. I think we need to redo that business model. We are reworking that model,\" Sood said. The multiplex operator is looking to pivot from being only an exhibition company to being an F\u0026B player as well, said PVR Inox's Managing Director Ajay Bijli during Q4 FY24 earnings call. What will be on the menu? Sood said that the contribution in terms of food menu will be limited from PVR Inox and it will be largely driven by Devyani International's brands. \"New brands can also come in and join exclusively for the food court business. The idea is that Devyani brings food brands to the table and we bring real estate. There is an opportunity in this space for an organised player to operate.\" Sood said that opening food courts is one of the initiatives that the exhibitor is taking in the overall scheme of expanding pre-ticketed F\u0026B. \"Post ticketed F\u0026B is large at around Rs 2,000 crore. This (opening food court) will be a small fraction of that and it will take time to build up,\" the CFO added. Bijli said that they were keen to pivot to pre-ticketed F\u0026B especially with Devyani International bringing in brands like KFC, Pizza Hut, Costa Coffee. \"We have a long term relationship with them (Devyani International) as they have been our suppliers for Pepsi in most of our circuits for a long time. We see a lot of opportunities with this JV because most of the malls do not have branded food courts and in existing malls food courts are not managed well. Food courts and cinema are the two anchors in every mall that generate the maximum footfalls. Having a play in this with Devyani is a good strategic pivot for the company (PVR Inox),\" the MD said. Event alert: Moneycontrol and CNBC TV18 are hosting the ultimate event on artificial intelligence, bringing together entrepreneurs, ecosystem enablers, policymakers, industry leaders, and innovators on May 17 in Gurugram. Click here to register and gain access to the AI Alliance Delhi-NCR Chapter. https://www.moneycontrol.com/msite/global-ai-conclave/gurugram ","cleaned_content":"indias largest multiplex operator pvr inox is expanding its food and beverage f b business by venturing into pre ticketed food business which means the company wants a share of consumers wallets before they buy a movie ticket while one of the biggest contributors to the companys overall revenue is the f b segment bulk of the revenue is from post ticketed f b business to grow its pre ticketed f b segment the exhibitor under a joint venture jv with qsr quick service restaurant chain devyani international will open five to six food courts in the first year of launching the new entity we will set up a jv in which devyani will own \u003cFIVE_TEN_PERCENT\u003e share and pvr inox will own the remaining the idea is to open food courts in shopping malls all over the country priority will be to open in present large shopping malls nitin sood group cfo chief financial officer pvr inox told moneycontrol it online sales is a small percentage less than \u003cONE_PERCENT\u003e most of the f b sales are in cinemas online segment hasnt done well for us i think we need to redo that business model we are reworking that model sood said the multiplex operator is looking to pivot from being only an exhibition company to being an f b player as well said pvr inoxs managing director ajay bijli during q4 fy24 earnings call what will be on the menu sood said that the contribution in terms of food menu will be limited from pvr inox and it will be largely driven by devyani internationals brands new brands can also come in and join exclusively for the food court business the idea is that devyani brings food brands to the table and we bring real estate there is an opportunity in this space for an organised player to operate sood said that opening food courts is one of the initiatives that the exhibitor is taking in the overall scheme of expanding pre ticketed f b post ticketed f b is large at around rs \u003cTWO_THOUSAND\u003e crore this opening food court will be a small fraction of that and it will take time to build up the cfo added bijli said that they were keen to pivot to pre ticketed f b especially with devyani international bringing in brands like kfc pizza hut costa coffee we have a long term relationship with them devyani international as they have been our suppliers for pepsi in most of our circuits for a long time we see a lot of opportunities with this jv because most of the malls do not have branded food courts and in existing malls food courts are not managed well food courts and cinema are the two anchors in every mall that generate the maximum footfalls having a play in this with devyani is a good strategic pivot for the company pvr inox the md said event alert moneycontrol and cnbc tv18 are hosting the ultimate event on artificial intelligence bringing together entrepreneurs ecosystem enablers policymakers industry leaders and innovators on may \u003cONE_TEN\u003e in gurugram click here to register and gain access to the ai alliance delhi ncr chapter https www moneycontrol com msite global ai conclave gurugram","timestamp":"2024-05-15T08:48:00+05:30","market_timestamp":"2024-05-15T09:15:00+05:30","off_market_hours":true}