{"url":"https://www.moneycontrol.com/news/business/hero-motocorp-market-valuation-breaches-rs-1-lakh-crore-for-first-time-12722244.html","title":"Hero MotoCorp market valuation breaches Rs 1 lakh crore for first time","description":"Continuing its winning run for the fifth session in a row, Hero Motocorp shares hit a 52-week high of Rs 5,050 per share on BSE. The stock closed up by 3.15 per cent at Rs 5041.90.Hero MotoCorp market valuation breaches Rs 1 lakh crore for first timeRelated stories","content":"Shares of two-wheeler major Hero Motocorp on Tuesday closed higher by 3 per cent on Tuesday, taking its market valuation to more than Rs 1 lakh crore for the first time. Continuing its winning run for the fifth session in a row, Hero Motocorp shares hit a 52-week high of Rs 5,050 per share on BSE. The stock closed up by 3.15 per cent at Rs 5041.90. The stock hit a 52-week high of Rs 5,051 on NSE. Shares closed higher by 3.37 per cent at Rs 5,050 apiece on NSE. In volume trade, 49,178 equity shares were traded on the BSE, while 13.35 lakh shares were traded on the NSE during the day. The 30-share BSE Sensex benchmark jumped 328.48 points or 0.45 per cent to settle at 73,104.61, while broader NSE Nifty gained 113.80 points to close at 22,217.85. On Monday, Hero MotoCorp said it has joined the Open Network for Digital Commerce (ONDC) to enhance reach and convenience and provide an easily accessible digital mode to customers. The open network will initially offer two-wheeler parts, accessories and merchandise. Last week, two-wheeler maker Hero MotoCorp Ltd reported a 16.3 per cent rise in consolidated profit after tax to Rs 943.46 crore in the fourth quarter ended on March 31, 2024, riding on higher sales. The company had posted a consolidated profit after tax of Rs 810.8 crore in the same period a year ago. Consolidated revenue from operations during the quarter under review stood at Rs 9,616.68 crore as against Rs 8,434.28 crore in the corresponding period a year ago. ","cleaned_content":"shares of two wheeler major hero motocorp on tuesday closed higher by \u003cTHREE_PERCENT\u003e on tuesday taking its market valuation to more than rs \u003cONE_\u003e lakh crore for the first time continuing its winning run for the fifth session in a row hero motocorp shares hit a \u003cFIVE_TEN\u003e week high of rs \u003cFIVE_THOUSAND\u003e per share on bse the stock closed up by \u003cTHREE_PERCENT\u003e at rs \u003cFIVE_THOUSAND\u003e the stock hit a \u003cFIVE_TEN\u003e week high of rs \u003cFIVE_THOUSAND\u003e on nse shares closed higher by \u003cTHREE_PERCENT\u003e at rs \u003cFIVE_THOUSAND\u003e apiece on nse in volume trade \u003cFOUR_TEN_THOUSAND\u003e equity shares were traded on the bse while \u003cONE_TEN\u003e lakh shares were traded on the nse during the day the \u003cTHREE_TEN\u003e share bse sensex benchmark jumped \u003cTHREE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e to settle at \u003cSEVEN_TEN_THOUSAND\u003e while broader nse nifty gained \u003cONE_HUNDRED\u003e points to close at \u003cTWO_TEN_THOUSAND\u003e on monday hero motocorp said it has joined the open network for digital commerce ondc to enhance reach and convenience and provide an easily accessible digital mode to customers the open network will initially offer two wheeler parts accessories and merchandise last week two wheeler maker hero motocorp ltd reported a \u003cONE_TEN_PERCENT\u003e rise in consolidated profit after tax to rs \u003cNINE_HUNDRED\u003e crore in the fourth quarter ended on march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e riding on higher sales the company had posted a consolidated profit after tax of rs \u003cEIGHT_HUNDRED\u003e crore in the same period a year ago consolidated revenue from operations during the quarter under review stood at rs \u003cNINE_THOUSAND\u003e crore as against rs \u003cEIGHT_THOUSAND\u003e crore in the corresponding period a year ago","timestamp":"2024-05-15T07:04:00+05:30","market_timestamp":"2024-05-15T09:15:00+05:30","off_market_hours":true}