{"url":"https://www.moneycontrol.com/news/business/sails-bhilai-steel-plant-to-install-solar-energy-systems-in-plant-premises-township-reservoir-12722617.html","title":"SAIL's Bhilai Steel Plant to install solar energy systems in plant premises, township, reservoir","description":"The flagship unit of the country's largest steel maker Steel Authority of India Limited (SAIL), BSP, has recently signed a memorandum of understanding with the Chhattisgarh State Renewable Energy Development Agency (CREDA) for the solar power generation project within the unit's premises, a statement issued by the plant management said on Wednesday.SAIL's Bhilai Steel Plant to install solar energy systems in plant premises, township, reservoirRelated stories","content":"Bhilai Steel Plant (BSP) has decided to install solar power generation systems on the rooftops of various buildings in its plant premises and township in Bhilai. The flagship unit of the country's largest steel maker Steel Authority of India Limited (SAIL), BSP, has recently signed a memorandum of understanding with the Chhattisgarh State Renewable Energy Development Agency (CREDA) for the solar power generation project within the unit's premises, a statement issued by the plant management said on Wednesday. The proposed plan shall generate about 2 MW of electricity, it said. Upon completion, the two projects shall lead to a reduction in as much as 2,900 tonnes of Carbon Dioxide emission every year, thereby helping in environment conservation, it said. On May 9 this year, a Power Purchase Agreement (PPA) was also signed between BSP and NTPC-SAIL Power Supply Company Limited (NSPCL) for the installation of a 15 MW capacity floating Solar Plant in Maroda-1 reservoir, which shall lead to the improvement of the plant's carbon footprint, along with the conservation of energy, and the promotion of renewable energy resources, it said. The floating solar plant will be the first of its kind in the state and is scheduled to be completed by next year, it added. The total green power generation estimated from this plant is likely to be about 34.26 Million Units annually which will be consumed by BSP as captive power, it said. Another floating Solar Power Plant of 35 MW in Maroda-2 reservoir is also proposed by BSP, through NSPCL in the next phase, for which DPR (detailed project report) has already been prepared and the tender process is likely to be started soon, it said. \"The solar energy projects in the plant premises, township, Maroda-1 and Maroda-2 reservoirs will be completed in two phases with the first phase likely to be completed by 2025 and the second by 2027 end\", the release said. The electricity generated from both these projects will be added to the power grid, which will benefit the plant and other areas as well, it said. ","cleaned_content":"bhilai steel plant bsp has decided to install solar power generation systems on the rooftops of various buildings in its plant premises and township in bhilai the flagship unit of the countrys largest steel maker steel authority of india limited sail bsp has recently signed a memorandum of understanding with the chhattisgarh state renewable energy development agency creda for the solar power generation project within the units premises a statement issued by the plant management said on wednesday the proposed plan shall generate about \u003cTWO_\u003e mw of electricity it said upon completion the two projects shall lead to a reduction in as much as \u003cTWO_THOUSAND\u003e tonnes of carbon dioxide emission every year thereby helping in environment conservation it said on may \u003cNINE_\u003e this year a power purchase agreement ppa was also signed between bsp and ntpc sail power supply company limited nspcl for the installation of a \u003cONE_TEN\u003e mw capacity floating solar plant in maroda \u003cONE_\u003e reservoir which shall lead to the improvement of the plants carbon footprint along with the conservation of energy and the promotion of renewable energy resources it said the floating solar plant will be the first of its kind in the state and is scheduled to be completed by next year it added the total green power generation estimated from this plant is likely to be about \u003cTHREE_TEN\u003e million units annually which will be consumed by bsp as captive power it said another floating solar power plant of \u003cTHREE_TEN\u003e mw in maroda \u003cTWO_\u003e reservoir is also proposed by bsp through nspcl in the next phase for which dpr detailed project report has already been prepared and the tender process is likely to be started soon it said the solar energy projects in the plant premises township maroda \u003cONE_\u003e and maroda \u003cTWO_\u003e reservoirs will be completed in two phases with the first phase likely to be completed by \u003cTWO_THOUSAND\u003e and the second by \u003cTWO_THOUSAND\u003e end the release said the electricity generated from both these projects will be added to the power grid which will benefit the plant and other areas as well it said","timestamp":"2024-05-15T12:16:00+05:30","market_timestamp":"2024-05-15T12:16:00+05:30","off_market_hours":false}