{"url":"https://www.moneycontrol.com/news/business/glenmark-unit-ties-up-with-beigene-to-market-cancer-drugs-in-india-12728111.html","title":"Glenmark unit ties up with BeiGene to market cancer drugs in India","description":"Glenmark Specialty SA, a unit of Mumbai-based drug maker, has inked exclusive marketing and distribution agreement with BeiGene.Glenmark unit ties up with BeiGene to market cancer drugs in IndiaRelated stories","content":"Glenmark Pharmaceuticals on Tuesday said its unit has inked a marketing and distribution agreement with BeiGene to commercialise the latter's oncology medicines, Tislelizumab and Zanubrutinib in India. Glenmark Specialty SA, a unit of Mumbai-based drug maker, has inked exclusive marketing and distribution agreement with BeiGene. \"The addition of Tislelizumab and Zanubrutinib to our oncology portfolio underscores our dedication to the cancer patients' community and our commitment to provide access to novel therapies across India,\" said Alok Malik, Glenmark Pharmaceuticals President and Business Head, India Formulations. BeiGene Vice President and Head of Asia-Pacific Adam Roach said the collaboration is a testament to both companies' shared vision of enhancing healthcare access across Asia. \"We take great pride in advancing mission-driven access, especially given the significant disease burden in India, where rising cancer rates require comprehensive healthcare solutions - a commitment we share with our partners at Glenmark,\" he added. Glenmark said recent statistics indicate that India has the third highest number of cancer cases worldwide, with predictions suggesting this could reach 2.08 million cases by 2040 -- a 57.5 per cent increase from 2020. Currently, cancer claims around 9,00,000 lives annually in India. Shares of Glenmark were trading 0.59 percent down at Rs 1,036 apiece on the BSE. ","cleaned_content":"glenmark pharmaceuticals on tuesday said its unit has inked a marketing and distribution agreement with beigene to commercialise the latters oncology medicines tislelizumab and zanubrutinib in india glenmark specialty sa a unit of mumbai based drug maker has inked exclusive marketing and distribution agreement with beigene the addition of tislelizumab and zanubrutinib to our oncology portfolio underscores our dedication to the cancer patients community and our commitment to provide access to novel therapies across india said alok malik glenmark pharmaceuticals president and business head india formulations beigene vice president and head of asia pacific adam roach said the collaboration is a testament to both companies shared vision of enhancing healthcare access across asia we take great pride in advancing mission driven access especially given the significant disease burden in india where rising cancer rates require comprehensive healthcare solutions a commitment we share with our partners at glenmark he added glenmark said recent statistics indicate that india has the third highest number of cancer cases worldwide with predictions suggesting this could reach \u003cTWO_\u003e million cases by \u003cTWO_THOUSAND\u003e a \u003cFIVE_TEN_PERCENT\u003e increase from \u003cTWO_THOUSAND\u003e currently cancer claims around \u003cNINE_HUNDRED_THOUSAND\u003e lives annually in india shares of glenmark were trading \u003cZERO_PERCENT\u003e down at rs \u003cONE_THOUSAND\u003e apiece on the bse","timestamp":"2024-05-21T11:40:00+05:30","market_timestamp":"2024-05-21T11:40:00+05:30","off_market_hours":false}