{"url":"https://www.moneycontrol.com/technology/zee-expects-recovery-in-fmcg-ad-spends-monsoon-to-drive-momentum-in-fy25-article-12725759.html","title":"Zee expects recovery in FMCG ad spends, monsoon to drive momentum in FY25","description":"The broadcaster's MD and CEO Punit Goenka said that ad spending is seeing an upward trend in April and May.Zee Entertainment's advertising revenue stood at Rs 1,110.2 crore versus Rs 1,005.8 crore in Q4 FY23.Related stories","content":"Advertising revenue was under pressure in the last fiscal year but saw some recovery in the March quarter, said Zee. \"FY24 remained subdued due to the headwind faced from the macro-economic environment and other external factors. But the final quarter of the fiscal stood out by displaying positive levels of growth and we expect the momentum to continue in the new fiscal as well,\" Punit Goenka, the company's MD and CEO, said during a Q4 FY24 earnings call. He said that the FMCG sector has been recovering with the rural sentiment witnessing an uptick leading to a healthy increase in advertising revenue sequentially as well as on a year-on-year basis. The broadcaster's advertising revenue stood at Rs 1,110.2 crore versus Rs 1,005.8 crore in Q4 FY23. Domestic advertising revenue for the quarter grew by 10.6 percent year-on-year (YoY) driven by the continued recovery in macro advertising environment and spending pickup by FMCG clients, the company said. Also read: Bitter pill: Zee tech subsidiary Sugarbox shuts shop; employees say haven’t been paid \"While FY24 was a challenging year for the industry and Zee, we have exited the year with positive tailwind and growth momentum in Q4. For a good part of FY24, the liner ad spending environment continued to be soft due to weak pace of recovery in consumption demand for FMCG companies especially due to rural demand slowdown and weak spending among the new age companies. However, post festive season some green shoots emerged led by FMCG starting to inch up their ad spending. The ad spending on GECs (general entertainment channels) has continued to gradually pick up in Q4 FY24,\" said the firm's chief financial officer (CFO), Rohit Gupta. Subscription revenue to grow Goenka said that ad spending is seeing an upward trend in April and May. He expects the industry to see healthy high single digit growth for both subscription and advertising. \"Subscription revenue has also continued to grow at a steady pace, going forward the focus of the players across the industry will be on identifying the avenues to grow the pay TV ecosystem in a healthy manner. We remain hopeful that NTO 3.0 implementation and tariff growth will strengthen the pay TV ecosystem and pave way for sustained growth in subscription revenue,\" Goenka said. Pay TV homes fell to 118 million last year from 120 million the year before, according to an  Ernst \u0026 Young (EY) 2024 report that attributed the fall to cord-cutting and movement to connected TVs at the top end of the market, growth of alternate entertainment options and digital platforms, as well as availability of a sizeable content bouquet for Hindi speaking markets on free television. Also read: Some layoffs likely at Zee, firm revisits plan as standalone entity after Sony terminates merger \"Everyone (in the TV industry) is focused on how to grow the pay TV ecosystem,\" said Goenka. Zee's  subscription revenue grew to Rs 3,666 crore last fiscal year from Rs 3335.5 crore in FY23.  ","cleaned_content":"advertising revenue was under pressure in the last fiscal year but saw some recovery in the march quarter said zee fy24 remained subdued due to the headwind faced from the macro economic environment and other external factors but the final quarter of the fiscal stood out by displaying positive levels of growth and we expect the momentum to continue in the new fiscal as well punit goenka the companys md and ceo said during a q4 fy24 earnings call he said that the fmcg sector has been recovering with the rural sentiment witnessing an uptick leading to a healthy increase in advertising revenue sequentially as well as on a year on year basis the broadcasters advertising revenue stood at rs \u003cONE_THOUSAND\u003e crore versus rs \u003cONE_THOUSAND\u003e crore in q4 fy23 domestic advertising revenue for the quarter grew by \u003cONE_TEN_PERCENT\u003e year on year yoy driven by the continued recovery in macro advertising environment and spending pickup by fmcg clients the company said also read bitter pill zee tech subsidiary sugarbox shuts shop employees say haven t been paid while fy24 was a challenging year for the industry and zee we have exited the year with positive tailwind and growth momentum in q4 for a good part of fy24 the liner ad spending environment continued to be soft due to weak pace of recovery in consumption demand for fmcg companies especially due to rural demand slowdown and weak spending among the new age companies however post festive season some green shoots emerged led by fmcg starting to inch up their ad spending the ad spending on gecs general entertainment channels has continued to gradually pick up in q4 fy24 said the firms chief financial officer cfo rohit gupta subscription revenue to grow goenka said that ad spending is seeing an upward trend in april and may he expects the industry to see healthy high single digit growth for both subscription and advertising subscription revenue has also continued to grow at a steady pace going forward the focus of the players across the industry will be on identifying the avenues to grow the pay tv ecosystem in a healthy manner we remain hopeful that nto \u003cTHREE_\u003e implementation and tariff growth will strengthen the pay tv ecosystem and pave way for sustained growth in subscription revenue goenka said pay tv homes fell to \u003cONE_HUNDRED\u003e million last year from \u003cONE_HUNDRED\u003e million the year before according to an ernst young ey \u003cTWO_THOUSAND\u003e report that attributed the fall to cord cutting and movement to connected tvs at the top end of the market growth of alternate entertainment options and digital platforms as well as availability of a sizeable content bouquet for hindi speaking markets on free television also read some layoffs likely at zee firm revisits plan as standalone entity after sony terminates merger everyone in the tv industry is focused on how to grow the pay tv ecosystem said goenka zees subscription revenue grew to rs \u003cTHREE_THOUSAND\u003e crore last fiscal year from rs \u003cTHREE_THOUSAND\u003e crore in fy23","timestamp":"2024-05-18T09:21:00+05:30","market_timestamp":"2024-05-20T09:15:00+05:30","off_market_hours":true}