{"url":"https://www.moneycontrol.com/news/business/hero-motocorp-plans-to-expand-electric-model-range-to-increase-customer-base-12729267.html","title":"Hero MotoCorp plans to expand electric model range to increase customer base","description":"The country's largest two-wheeler maker currently sells two electric scooters under its Vida range, priced between Rs 1 lakh and Rs 1.5 lakh.Hero MotoCorp plans to expand electric model range to increase customer baseRelated stories","content":"Hero MotoCorp is looking to expand its presence in the electric two-wheeler segment as it aims to introduce new models below its current range to cater to a broader set of customers, as per a senior company official. The country's largest two-wheeler maker currently sells two electric scooters under its Vida range, priced between Rs 1 lakh and Rs 1.5 lakh. \"We are expanding our portfolio in the first half of this year (current fiscal)..into the mid and the mass segment as well,\" Hero MotoCorp Chief Business Officer - Emerging Mobility BU Swadesh Srivastava said in an analyst call. \"With this, we are looking at significant growth within this year. And we are also looking to improve our cost structures,\" he said. The company is going to witness huge growth in the EV segment this year as well as next year, he stated. \"We are looking at steep growth this year and next year, based on the portfolio and the geographical expansion,\" Srivastava said. Hero MotoCorp has expanded the presence of the VIDA brand to more than 120 cities and over 180 touch-points in the country. It has also entered into a partnership with Ather Energy for an interoperable charging network, providing over 2,000 charging points across 200 cities to its customers. To strengthen its global presence, VIDA is also expected to make its debut in European and UK markets in FY25. Replying to a query, Hero MotoCorp CEO Niranjan Gupta said the company's capex guidance remains between Rs 1,000 crore and Rs 1,500 crore for the current fiscal. He noted that there are new product launches in the offing. \"We are going to launch Xoom 125, Xoom 160 - the scooter launches in the first half, you will see more, some more forays into the premium segment as well,\" he told an analyst. He further said: \"And we can confidently say that we are poised for accelerated growth moving forward for FY25 and beyond.\" ","cleaned_content":"hero motocorp is looking to expand its presence in the electric two wheeler segment as it aims to introduce new models below its current range to cater to a broader set of customers as per a senior company official the countrys largest two wheeler maker currently sells two electric scooters under its vida range priced between rs \u003cONE_\u003e lakh and rs \u003cONE_\u003e lakh we are expanding our portfolio in the first half of this year current fiscal into the mid and the mass segment as well hero motocorp chief business officer emerging mobility bu swadesh srivastava said in an analyst call with this we are looking at significant growth within this year and we are also looking to improve our cost structures he said the company is going to witness huge growth in the ev segment this year as well as next year he stated we are looking at steep growth this year and next year based on the portfolio and the geographical expansion srivastava said hero motocorp has expanded the presence of the vida brand to more than \u003cONE_HUNDRED\u003e cities and over \u003cONE_HUNDRED\u003e touch points in the country it has also entered into a partnership with ather energy for an interoperable charging network providing over \u003cTWO_THOUSAND\u003e charging points across \u003cTWO_HUNDRED\u003e cities to its customers to strengthen its global presence vida is also expected to make its debut in european and uk markets in fy25 replying to a query hero motocorp ceo niranjan gupta said the companys capex guidance remains between rs \u003cONE_THOUSAND\u003e crore and rs \u003cONE_THOUSAND\u003e crore for the current fiscal he noted that there are new product launches in the offing we are going to launch xoom \u003cONE_HUNDRED\u003e xoom \u003cONE_HUNDRED\u003e the scooter launches in the first half you will see more some more forays into the premium segment as well he told an analyst he further said and we can confidently say that we are poised for accelerated growth moving forward for fy25 and beyond","timestamp":"2024-05-22T11:57:00+05:30","market_timestamp":"2024-05-22T11:57:00+05:30","off_market_hours":false}