{"url":"https://www.moneycontrol.com/news/business/sony-appoints-disneys-gaurav-banerjee-as-new-india-ceo-report-12734334.html","title":"Sony appoints Disney's Gaurav Banerjee as new India CEO: Report","description":"Gaurav Banerjee has resigned from Disney's India unit where he was the head of content for its streaming service, Hotstar, and head of business for the company's TV channels in Hindi-speaking markets, one source said.Sony appoints Disney's Gaurav Banerjee as new India CEO: Report","content":"Japan's Sony has appointed a Walt Disney executive, Gaurav Banerjee, as its new India chief executive to lead its television and other media businesses, two people familiar with the matter told Reuters on Tuesday. Banerjee has resigned from Disney's India unit where he was the head of content for its streaming service, Hotstar, and head of business for the company's TV channels in Hindi-speaking markets, one source said. A second source said Banerjee would join Sony in about two months. Last week, Sony said it was looking for a successor to its current India chief executive, N.P. Singh, who had decided to move on. Sony runs 26 channels in India, from general entertainment to sports and movies, and also a streaming service. This year, it scrapped a planned merger with India's Zee Entertainment that would have created a $10-billion enterprise. Banerje's departure from Disney comes as the U.S. firm seeks Indian regulators' approval to merge its India media assets with those of Reliance, which is led by billionaire Mukesh Ambani, in a combination making it India's biggest entertainment company. ","cleaned_content":"japans sony has appointed a walt disney executive gaurav banerjee as its new india chief executive to lead its television and other media businesses two people familiar with the matter told reuters on tuesday banerjee has resigned from disneys india unit where he was the head of content for its streaming service hotstar and head of business for the companys tv channels in hindi speaking markets one source said a second source said banerjee would join sony in about two months last week sony said it was looking for a successor to its current india chief executive n p singh who had decided to move on sony runs \u003cTWO_TEN\u003e channels in india from general entertainment to sports and movies and also a streaming service this year it scrapped a planned merger with indias zee entertainment that would have created a \u003cONE_TEN\u003e billion enterprise banerjes departure from disney comes as the u s firm seeks indian regulators approval to merge its india media assets with those of reliance which is led by billionaire mukesh ambani in a combination making it indias biggest entertainment company","timestamp":"2024-05-28T12:12:00+05:30","market_timestamp":"2024-05-28T12:12:00+05:30","off_market_hours":false}