{"url":"https://www.moneycontrol.com/news/business/pune-based-rsiil-bags-two-major-projects-worth-rs-4900-crore-from-msrdc-12730303.html","title":"Pune-based RSIIL bags two major projects worth Rs 4,900 crore from MSRDC","description":"This project will enhance the connectivity and facilitate smoother traffic flow around Pune, the statement added.Pune-based RSIIL bags two major projects worth Rs 4,900 crore from MSRDC","content":"Roadway Solutions India Infra Ltd on Thursday said it has bagged two infrastructure projects worth Rs 4,900 crore from Maharashtra State Road Development Corporation (MSRDC). It has been declared as the lowest bidder for the said projects, the company said in a statement. This project will enhance the connectivity and facilitate smoother traffic flow around Pune, the statement added. The other project includes the construction of Access Controlled Expressway Connector to Hindu Hrudaysamrat Balasaheb Thackeray Maharashtra Samruddhi Mahamarg from Jalna to Nanded in Maharashtra. With these new projects, the company said its order book has now crossed Rs 11,000 crore. In addition to these new ventures, the company is already actively executing three notable packages at the Vadodara Mumbai Expressway in Packages 8, 9, and 10, the statement added. ","cleaned_content":"roadway solutions india infra ltd on thursday said it has bagged two infrastructure projects worth rs \u003cFOUR_THOUSAND\u003e crore from maharashtra state road development corporation msrdc it has been declared as the lowest bidder for the said projects the company said in a statement this project will enhance the connectivity and facilitate smoother traffic flow around pune the statement added the other project includes the construction of access controlled expressway connector to hindu hrudaysamrat balasaheb thackeray maharashtra samruddhi mahamarg from jalna to nanded in maharashtra with these new projects the company said its order book has now crossed rs \u003cONE_TEN_THOUSAND\u003e crore in addition to these new ventures the company is already actively executing three notable packages at the vadodara mumbai expressway in packages \u003cEIGHT_\u003e \u003cNINE_\u003e and \u003cONE_TEN\u003e the statement added","timestamp":"2024-05-23T12:06:00+05:30","market_timestamp":"2024-05-23T12:06:00+05:30","off_market_hours":false}