{"url":"https://www.moneycontrol.com/news/business/indya-raises-rs-50-crore-from-sangita-jindal-others-12732903.html","title":"Indya raises Rs 50 crore from Sangita Jindal, others","description":"Three fourths of the funding is equity infusion for a minority stake, while the rest is debt, Indya's co-founder Shivani Poddar said.Indya raises Rs 50 crore from Sangita Jindal, othersRelated stories","content":"High Street Essentials, the makers of fashion brand Indya, on Monday announced a Rs 50-crore fundraise from JSW Group chairman Sajjan Jindal's wife Sangita Jindal and other investors. Three fourths of the funding is equity infusion for a minority stake, while the rest is debt, Indya's co-founder Shivani Poddar said. Other investors who have participated include family offices of SRF Group, Krishna Bodanapu of Cyient Technologies and Timmy Sarna from Pure Home + Living. Anurag Murali, also a co-founder of the company, said Indya can benefit from JSW's expertise in celebrity-led marketing and supply chain management in the future. It can be noted that a majority of big conglomerates have investments in fashion brands but nearly all such groups have retail ventures. The 2012-founded Indya, which delivered operational profit in April this year, will be utilising the newly raised funds for business expansion, and plans to invest up to USD 3 million in FY25, which will include opening ten offline stores in the country, Murali said. At present, it has 12 exclusive brand outlets in eight cities, and 150 large-format retail outlets, including Lifestyle, Shoppers Stop, Centro and Ethnicity. Having been active in selling its wares online in the US, the brand is also aiming to open a physical presence either in the US or South Africa in FY25, he added. In a statement, Sangita Jindal said along with the global expansion, the investment will also help the brand widen its market share in the Indian wedding-wear opportunity. The company's core strength is in its unique designs, she said, appreciating the back-end capabilities created by the founders. ","cleaned_content":"high street essentials the makers of fashion brand indya on monday announced a rs \u003cFIVE_TEN\u003e crore fundraise from jsw group chairman sajjan jindals wife sangita jindal and other investors three fourths of the funding is equity infusion for a minority stake while the rest is debt indyas co founder shivani poddar said other investors who have participated include family offices of srf group krishna bodanapu of cyient technologies and timmy sarna from pure home living anurag murali also a co founder of the company said indya can benefit from jsws expertise in celebrity led marketing and supply chain management in the future it can be noted that a majority of big conglomerates have investments in fashion brands but nearly all such groups have retail ventures the \u003cTWO_THOUSAND\u003e founded indya which delivered operational profit in april this year will be utilising the newly raised funds for business expansion and plans to invest up to usd \u003cTHREE_\u003e million in fy25 which will include opening ten offline stores in the country murali said at present it has \u003cONE_TEN\u003e exclusive brand outlets in eight cities and \u003cONE_HUNDRED\u003e large format retail outlets including lifestyle shoppers stop centro and ethnicity having been active in selling its wares online in the us the brand is also aiming to open a physical presence either in the us or south africa in fy25 he added in a statement sangita jindal said along with the global expansion the investment will also help the brand widen its market share in the indian wedding wear opportunity the companys core strength is in its unique designs she said appreciating the back end capabilities created by the founders","timestamp":"2024-05-27T11:28:00+05:30","market_timestamp":"2024-05-27T11:28:00+05:30","off_market_hours":false}