{"url":"https://www.moneycontrol.com/news/business/indias-top-ev-ride-hailer-seeks-300-million-to-expand-car-fleet-12733896.html","title":"India’s top EV ride-hailer seeks $300 million to expand car fleet","description":"The company will increase its Indian fleet of electric vehicles — supplied by Tata Motors Ltd., BYD Co., SAIC Motor Corp.’s MG Motor and Stellantis NV’s Citroën — to 13,000 by March from 7,500 currently, Punit Goyal, co-founder of the BP Ventures-backed startup, said in an interview. In three years, it aims to have 25,000 cars, he said. India’s top EV ride-hailer seeks $300 million to expand car fleetRelated stories","content":"BluSmart, India’s biggest electric cab operator, wants to raise more than $300 million in three years to add thousands of cars to its fleet in its push to take on the likes of Uber Technologies Inc. in the fast-growing market. The company will increase its Indian fleet of electric vehicles — supplied by Tata Motors Ltd., BYD Co., SAIC Motor Corp.’s MG Motor and Stellantis NV’s Citroën — to 13,000 by March from 7,500 currently, Punit Goyal, co-founder of the BP Ventures-backed startup, said in an interview. In three years, it aims to have 25,000 cars, he said. Part of the funding it raises will go toward the company’s expansion beyond Delhi and the southern Indian city of Bengaluru. BluSmart will launch in Dubai next month with about 100 Audi EVs, and plans to run 300 Audi and Tesla Inc. vehicles there by December, according to Goyal. “We don’t want to go to small cities because that’s not where the revenue comes from,” said Goyal. “Cheap rides, cheap quality, cheap service and cheap pricing are not our forte.” The company estimates it will almost double annual revenue to $110 million by March 2025, based on its current monthly financial performance. Goyal didn’t say when he expects the company would make a profit. Going ElectricWhile BluSmart has consistently maintained an all-electric fleet, its rivals are also rolling out greener options to customers. Uber last year said it will add 25,000 electric vehicles to its platform in India, though didn’t specify a timeline, and Ola began deploying 10,000 electric scooters earlier this year. Road transport is estimated to account for as much as 30% of the air pollution that can shroud India’s biggest urban centers, according to the International Energy Agency, causing dangerous long-term health impacts and even premature deaths. Electrification is a core pillar to the country’s pledge to reach net zero carbon emissions by 2070, but efforts have been stymied by the high cost of buying an EV and limited charging infrastructure. Ride-hailing also plays a complicated role: a non-pooled ride-hailing trip produces about 47% more emissions than a private car trip, though taking a journey in an EV can cut emissions by about half, according to US-based nonprofit Union of Concerned Scientists. BluSmart, which has secured $200 million in equity and long-term growth debt so far, is currently raising $25 million that Goyal said includes investment from its founders, existing investors, family offices and founders of other startups.The funding round, which is part of its three-year $300-million plan, will close by late June, he said. Despite the looming foray into Dubai, Goyal said its home market of India will continue to be the company’s core focus. “You can fit 15 Singapores in terms of population” in the area around the capital of Delhi, he said. “That’s a huge opportunity and that’s where the key market is.” ","cleaned_content":"blusmart india s biggest electric cab operator wants to raise more than \u003cTHREE_HUNDRED\u003e million in three years to add thousands of cars to its fleet in its push to take on the likes of uber technologies inc in the fast growing market the company will increase its indian fleet of electric vehicles supplied by tata motors ltd byd co saic motor corp s mg motor and stellantis nv s citro n to \u003cONE_TEN_THOUSAND\u003e by march from \u003cSEVEN_THOUSAND\u003e currently punit goyal co founder of the bp ventures backed startup said in an interview in three years it aims to have \u003cTWO_TEN_THOUSAND\u003e cars he said part of the funding it raises will go toward the company s expansion beyond delhi and the southern indian city of bengaluru blusmart will launch in dubai next month with about \u003cONE_HUNDRED\u003e audi evs and plans to run \u003cTHREE_HUNDRED\u003e audi and tesla inc vehicles there by december according to goyal we don t want to go to small cities because that s not where the revenue comes from said goyal cheap rides cheap quality cheap service and cheap pricing are not our forte the company estimates it will almost double annual revenue to \u003cONE_HUNDRED\u003e million by march \u003cTWO_THOUSAND\u003e based on its current monthly financial performance goyal didn t say when he expects the company would make a profit going electricwhile blusmart has consistently maintained an all electric fleet its rivals are also rolling out greener options to customers uber last year said it will add \u003cTWO_TEN_THOUSAND\u003e electric vehicles to its platform in india though didn t specify a timeline and ola began deploying \u003cONE_TEN_THOUSAND\u003e electric scooters earlier this year road transport is estimated to account for as much as \u003cTHREE_TEN_PERCENT\u003e of the air pollution that can shroud india s biggest urban centers according to the international energy agency causing dangerous long term health impacts and even premature deaths electrification is a core pillar to the country s pledge to reach net zero carbon emissions by \u003cTWO_THOUSAND\u003e but efforts have been stymied by the high cost of buying an ev and limited charging infrastructure ride hailing also plays a complicated role a non pooled ride hailing trip produces about \u003cFOUR_TEN_PERCENT\u003e more emissions than a private car trip though taking a journey in an ev can cut emissions by about half according to us based nonprofit union of concerned scientists blusmart which has secured \u003cTWO_HUNDRED\u003e million in equity and long term growth debt so far is currently raising \u003cTWO_TEN\u003e million that goyal said includes investment from its founders existing investors family offices and founders of other startups the funding round which is part of its three year \u003cTHREE_HUNDRED\u003e million plan will close by late june he said despite the looming foray into dubai goyal said its home market of india will continue to be the company s core focus you can fit \u003cONE_TEN\u003e singapores in terms of population in the area around the capital of delhi he said that s a huge opportunity and that s where the key market is","timestamp":"2024-05-28T08:57:00+05:30","market_timestamp":"2024-05-28T09:15:00+05:30","off_market_hours":true}