{"url":"https://www.moneycontrol.com/news/business/emcure-gennova-settle-litigation-with-hdt-ink-pact-to-develop-mrnavaccines-12730374.html","title":"Emcure, Gennova settle litigation with HDT, ink pact to develop mRNAvaccines","description":"Under the settlement, the litigation between them, including before US courts and the arbitral tribunal in London, has been settled and dismissed, Emcure said in a statement.Emcure, Gennova settle litigation with HDT, ink pact to develop mRNAvaccinesRelated stories","content":"Emcure Pharmaceuticals Ltd and its arm Gennova Biopharmaceuticals have settled all legal disputes with HDT Bio Corp and have signed a long-term agreement to develop mRNA vaccines, the company said on Thursday. Under the settlement, the litigation between them, including before US courts and the arbitral tribunal in London, has been settled and dismissed, Emcure said in a statement. The parties have also entered into a long-term agreement to develop mRNA vaccines against a broad range of infectious diseases, in India and several other countries. As part of their agreement, HDT has granted a licence to Gennova to use its patented mRNA vaccine technology in multiple fields, it added. HDT had filed lawsuit against Emcure alleging stealing of Covid-19 vaccine technology trade secrets. Emcure Pharmaceuticals CEO \u0026 Managing Director Satish Mehta said,\"...the misunderstanding between us and HDT not only stands resolved but we have widened the scope of our technical collaboration on a long-term basis.\" He further said,\"mRNA platform will be the launching pad for our foray into vaccines for tuberculosis, rabies, dengue and other infectious diseases and our collaboration with HDT will be mutually beneficial.\" Commenting on the development, HDT CEO Steve Reed said,\"HDT's proprietary technology, combined with Emcure's and Gennova's innovation and manufacturing excellence and established distribution network will bring life-saving vaccines to countless people. We are committed to a successful relationship with Emcure and Gennova.\" ","cleaned_content":"emcure pharmaceuticals ltd and its arm gennova biopharmaceuticals have settled all legal disputes with hdt bio corp and have signed a long term agreement to develop mrna vaccines the company said on thursday under the settlement the litigation between them including before us courts and the arbitral tribunal in london has been settled and dismissed emcure said in a statement the parties have also entered into a long term agreement to develop mrna vaccines against a broad range of infectious diseases in india and several other countries as part of their agreement hdt has granted a licence to gennova to use its patented mrna vaccine technology in multiple fields it added hdt had filed lawsuit against emcure alleging stealing of covid \u003cONE_TEN\u003e vaccine technology trade secrets emcure pharmaceuticals ceo managing director satish mehta said the misunderstanding between us and hdt not only stands resolved but we have widened the scope of our technical collaboration on a long term basis he further said mrna platform will be the launching pad for our foray into vaccines for tuberculosis rabies dengue and other infectious diseases and our collaboration with hdt will be mutually beneficial commenting on the development hdt ceo steve reed said hdts proprietary technology combined with emcures and gennovas innovation and manufacturing excellence and established distribution network will bring life saving vaccines to countless people we are committed to a successful relationship with emcure and gennova","timestamp":"2024-05-23T14:11:00+05:30","market_timestamp":"2024-05-23T14:11:00+05:30","off_market_hours":false}