{"url":"https://www.moneycontrol.com/news/business/biocon-biologics-secures-usfda-approval-for-biosimilar-product-to-treat-ophthalmology-conditions-12728112.html","title":"Biocon Biologics secures USFDA approval for biosimilar product to treat ophthalmology conditions","description":"The US Food and Drug Administration (USFDA) has approved the company's first-to-file application for Yesafili, a vascular endothelial growth factor inhibitor used to treat several different types of ophthalmology conditions, the company said in a statement.Biocon Biologics secures USFDA approval for biosimilar product to treat ophthalmology conditions","content":"Biocon Biologics on Tuesday said it has received approval from the US health regulator for its biosimilar product to treat different types of ophthalmology conditions. The US Food and Drug Administration (USFDA) has approved the company's first-to-file application for Yesafili, a vascular endothelial growth factor inhibitor used to treat several different types of ophthalmology conditions, the company said in a statement. Biocon Biologics is a part of Biocon Ltd. It is similar to the reference product Eylea (aflibercept). \"This approval builds on our successful track record of bringing the first interchangeable insulin, Semglee, the first biosimilar Trastuzumab, Ogivri and the first biosimilar Pegfilgrastim, Fulphila to patients in the US,\" Biocon Biologics CEO \u0026 Managing Director Shreehas Tambe said. As per the company, there are 19.8 million Americans living with age-related macular degeneration in the US. In the US, sales of aflibercept stood at around USD 5.89 billion in 2023. ","cleaned_content":"biocon biologics on tuesday said it has received approval from the us health regulator for its biosimilar product to treat different types of ophthalmology conditions the us food and drug administration usfda has approved the companys first to file application for yesafili a vascular endothelial growth factor inhibitor used to treat several different types of ophthalmology conditions the company said in a statement biocon biologics is a part of biocon ltd it is similar to the reference product eylea aflibercept this approval builds on our successful track record of bringing the first interchangeable insulin semglee the first biosimilar trastuzumab ogivri and the first biosimilar pegfilgrastim fulphila to patients in the us biocon biologics ceo managing director shreehas tambe said as per the company there are \u003cONE_TEN\u003e million americans living with age related macular degeneration in the us in the us sales of aflibercept stood at around usd \u003cFIVE_\u003e billion in \u003cTWO_THOUSAND\u003e","timestamp":"2024-05-21T11:41:00+05:30","market_timestamp":"2024-05-21T11:41:00+05:30","off_market_hours":false}