{"url":"https://www.moneycontrol.com/technology/wonderla-counts-on-chennai-park-to-be-its-biggest-will-feature-indias-largest-roller-coaster-article-12726846.html","title":"Wonderla counts on Chennai park to be its biggest; will feature India's largest roller coaster","description":"Wonderla and Imagicaa, India's biggest theme park players, are investing in expanding their portfolios and adding more thrills to drive footfalls. Theme park company Wonderla to expand to newer markets with addition of more rides in existing parks. Image: WonderlaRelated stories","content":"Wonderla, one of India's biggest theme park companies, sees its upcoming Chennai property giving tough fight to its current best performing park in Bengaluru, thanks to larger and more thrilling rides. Investment in the Chennai park, which is expected to launch in the second quarter of FY26, has increased with the addition of bigger rides. \"We spent Rs 150-160 crore on the Chennai project and the total cost has been revised to Rs 515 crore. Earlier, it was Rs 490 crore but with changes in the park and the kind of attractions we are adding it has gone a little over budget. We are going to have the largest roller coaster in India, an attraction available in parks like Disney and Universal. The cost of the ride is around Rs 70-80 crore,\" said Arun Chittilappilly, Managing Director, (MD), Wonderla. \"Chennai can be as big as Bengaluru. I think it could be our biggest park and should compete with the Bengaluru park for the highest number of footfalls. They (Tamil Nadu) have been demanding a park from Wonderla for the last 20 years, so it was about time we did it,\" the MD said. While it is gearing up to launch the Chennai park, Wonderla is all set to open its new resort in Bhubaneswar, Odisha, later this week. Also read: Wonderla Holidays weak Q4 disappoints investors, stock tumbles 10% in 2 days \"We are sold out for the opening weekend. We are expecting four lakh visitors in our first year of launch because we lost two months of vacation this year,\" said Chittilappilly, who is targeting to commission a new project every year. The company is pursuing leads for projects in other cities like Indore, Greater Noida and Mohali. \"One of these three will get done in a couple of months and we will start working on that as well.\" Past the pressure during the pandemic, when theme parks dealt with full shutdowns and partial reopening leading to losses, Wonderla is now bringing bigger rides and newer thrills. \"We spent around Rs 20-30 crore in existing parks in FY24. Kochi had a lot of investment and we are awaiting a large ride to be installed which cost around Rs 15 crore. It is a ride with a free fall drop from a 40-meter height. We have a new virtual reality ride coming up in Bengaluru which is almost Rs 40 crore investment that is ongoing,\" the MD said. Imagicaa expansion Along with Wonderla, another leading player in the theme park space, Imagicaaworld Entertainment is expanding its park portfolio from three to seven by acquiring a water park and amusement park in Lonavala as well as Shirdi. Its property in Shirdi is a religious theme park called Saiteerth Devotional Theme Park. Also read: Theme parks like Wonderla, Imagicaa see footfalls coming back; resort bookings rise The transaction closure of the acquisition of these properties owned by Giriraj Enterprises has been extended to not later than June 30, 2024, from the earlier expected timeline of April 30, 2024, Imagicaaworld said in an exchange filing. The company also added six new rides at Imagicaa Water Park, Khopoli earlier this month with the total capital expenditure of Rs 12 crore. It expects this expansion to raise the water park’s daily footfall capacity by around 30 percent. Bengaluru resort Wonderla, which saw a dip in revenue and footfalls in the March quarter of FY24 in Bengaluru, witnessed its resort in the city clocking strong metrics. The resort recorded an 18 percent growth in revenue at Rs 4 crore in Q4 FY24 versus Rs 3.4 crore in the same period a year ago. Occupancy increased to 51 percent in Q4 FY24 from 48 percent in Q4 FY23. \"We have a limited inventory of 80 rooms currently, so this year we are roughly making Rs 40 crore investment to add about 40 rooms to the resort which will include cottages, glamping, pods,\" he said. On the other hand, the Bengaluru park's revenue fell 13 percent to Rs 35.9 crore in Q4 FY24 from Rs 41.4 crore in Q4 FY23, while footfalls dropped 10 percent to 2.4 lakh in Q4 FY24 from 2.6 lakh during the same period a year ago. \"Last year our group footfalls were lower, especially in Bengaluru and Kochi, while walk-ins have been good and grown versus the same period a year ago. There was a change in students' exam time, also elections led to some disruptions. In April heatwave affected footfalls but in May we are seeing growth,\" Chittilappilly said. ","cleaned_content":"wonderla one of indias biggest theme park companies sees its upcoming chennai property giving tough fight to its current best performing park in bengaluru thanks to larger and more thrilling rides investment in the chennai park which is expected to launch in the second quarter of fy26 has increased with the addition of bigger rides we spent rs \u003cONE_HUNDRED\u003e \u003cONE_HUNDRED\u003e crore on the chennai project and the total cost has been revised to rs \u003cFIVE_HUNDRED\u003e crore earlier it was rs \u003cFOUR_HUNDRED\u003e crore but with changes in the park and the kind of attractions we are adding it has gone a little over budget we are going to have the largest roller coaster in india an attraction available in parks like disney and universal the cost of the ride is around rs \u003cSEVEN_TEN\u003e \u003cEIGHT_TEN\u003e crore said arun chittilappilly managing director md wonderla chennai can be as big as bengaluru i think it could be our biggest park and should compete with the bengaluru park for the highest number of footfalls they tamil nadu have been demanding a park from wonderla for the last \u003cTWO_TEN\u003e years so it was about time we did it the md said while it is gearing up to launch the chennai park wonderla is all set to open its new resort in bhubaneswar odisha later this week also read wonderla holidays weak q4 disappoints investors stock tumbles \u003cONE_TEN_PERCENT\u003e in \u003cTWO_\u003e days we are sold out for the opening weekend we are expecting four lakh visitors in our first year of launch because we lost two months of vacation this year said chittilappilly who is targeting to commission a new project every year the company is pursuing leads for projects in other cities like indore greater noida and mohali one of these three will get done in a couple of months and we will start working on that as well past the pressure during the pandemic when theme parks dealt with full shutdowns and partial reopening leading to losses wonderla is now bringing bigger rides and newer thrills we spent around rs \u003cTWO_TEN\u003e \u003cTHREE_TEN\u003e crore in existing parks in fy24 kochi had a lot of investment and we are awaiting a large ride to be installed which cost around rs \u003cONE_TEN\u003e crore it is a ride with a free fall drop from a \u003cFOUR_TEN\u003e meter height we have a new virtual reality ride coming up in bengaluru which is almost rs \u003cFOUR_TEN\u003e crore investment that is ongoing the md said imagicaa expansion along with wonderla another leading player in the theme park space imagicaaworld entertainment is expanding its park portfolio from three to seven by acquiring a water park and amusement park in lonavala as well as shirdi its property in shirdi is a religious theme park called saiteerth devotional theme park also read theme parks like wonderla imagicaa see footfalls coming back resort bookings rise the transaction closure of the acquisition of these properties owned by giriraj enterprises has been extended to not later than june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e from the earlier expected timeline of april \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e imagicaaworld said in an exchange filing the company also added six new rides at imagicaa water park khopoli earlier this month with the total capital expenditure of rs \u003cONE_TEN\u003e crore it expects this expansion to raise the water park s daily footfall capacity by around \u003cTHREE_TEN_PERCENT\u003e bengaluru resort wonderla which saw a dip in revenue and footfalls in the march quarter of fy24 in bengaluru witnessed its resort in the city clocking strong metrics the resort recorded an \u003cONE_TEN_PERCENT\u003e growth in revenue at rs \u003cFOUR_\u003e crore in q4 fy24 versus rs \u003cTHREE_\u003e crore in the same period a year ago occupancy increased to \u003cFIVE_TEN_PERCENT\u003e in q4 fy24 from \u003cFOUR_TEN_PERCENT\u003e in q4 fy23 we have a limited inventory of \u003cEIGHT_TEN\u003e rooms currently so this year we are roughly making rs \u003cFOUR_TEN\u003e crore investment to add about \u003cFOUR_TEN\u003e rooms to the resort which will include cottages glamping pods he said on the other hand the bengaluru parks revenue fell \u003cONE_TEN_PERCENT\u003e to rs \u003cTHREE_TEN\u003e crore in q4 fy24 from rs \u003cFOUR_TEN\u003e crore in q4 fy23 while footfalls dropped \u003cONE_TEN_PERCENT\u003e to \u003cTWO_\u003e lakh in q4 fy24 from \u003cTWO_\u003e lakh during the same period a year ago last year our group footfalls were lower especially in bengaluru and kochi while walk ins have been good and grown versus the same period a year ago there was a change in students exam time also elections led to some disruptions in april heatwave affected footfalls but in may we are seeing growth chittilappilly said","timestamp":"2024-05-20T14:08:00+05:30","market_timestamp":"2024-05-20T14:08:00+05:30","off_market_hours":false}