{"url":"https://www.moneycontrol.com/technology/airfares-to-cool-off-with-capacity-additions-from-second-half-of-fy25-ixigos-bajpai-article-12743278.html","title":"Airfares to cool off with capacity additions from second half of FY25: Ixigo's Bajpai","description":"The company's share in the train online travel aggregator (OTA) market is at 52 percent as of nine months FY24 whereas its flights and bus market share at 5.3 percent and 12.9 percent respectively. Ixigo focuses on growing air travel market. Related stories","content":"Travel tech company Ixigo has stepped up its focus on a wider share of the air travel pie and looks to tap into the next billion users betting big on capacity addition. The simmering air fares will stabilise and cool off at some point with capacity additions, Aloke Bajpai, chairman, managing director and group chief executive officer of the company, told Moneycontrol. \"If you think from where the next 50 million new flyers are going to come from then a lot of them will be train passengers travelling in the second and third AC trains. A lower air fare will lead to more shift in passengers from trains to flights. Because we are a market where only 4 percent people fly and take multiple trips and that's how we get 150 million passengers in a year. Compared to most other economies we are still underpenetrated on the air side. Ixigo needs to ride on that and tap into the next billion users,\" he said. \"We are at a low market share (in air), so we are pushing the pedal there to accelerate growth,\" Bajpai said. The Indian air travel market is one of the fastest growing markets in the world, with total passengers handled across airports amounting to 32.7 crore passengers in FY23, according to Ixigo's red herring prospectus (RHP). The initial public offering of Le Travenues Technology, the parent company of travel aggregator Ixigo, will hit Dalal Street on June 10. India's current air travel market is estimated to be 4 percent lesser that pre-Covid numbers. In FY20, 14.1 crore Indian travellers took to the skies to fulfil their domestic travel needs and in FY23 this number reached 13.8 crore, as per the RHP. Bajpai expects capacity addition to accelerate in the coming few years. \"Over 1,000 aircrafts are on order so, we are looking at market size tripling once all of that (inventory) comes in. The industry is hoping the new inventory starts coming from the second half of this year (FY25). The airlines are guiding the same. Indigo said they will add one aircraft every week, Air India is also seeing some deliveries coming in. These are positive signs,\" he said. Both Indigo and Air India have placed landmark plane orders with aircraft manufacturers recently, with Indigo placing an order of 500 aircraft in June 2023. This 500 aircraft order is not only IndiGo’s largest order, but also the largest-ever single aircraft purchase by any airline with Airbus. Air India has also firmed up its order for 250 Airbus aircraft and 220 new Boeing planes in June 2023. The Air India order includes 70 widebody planes, comprising 34 A350-1000s and six A350-900s from Airbus, and 20 787 Dreamliners and 10 777Xs from Boeing. It also includes 140 Airbus A320neo, 70 Airbus A321neo and 190 Boeing 737 MAX narrow body aircraft. Air India has also signed options to buy an additional 70 planes from Boeing including 50 737 MAXs and 20 787 Dreamliners. The delivery of these planes is expected to happen over the next five years. The growth in new airplane deliveries is a key driver, with the Indian fleet expected to be 1,200 aircrafts by 2027. However, on capacity additions, Bajpai pointed out that a lot depends on Boeing and Airbus being able to deliver aircrafts in a timely fashion. \"We recently got to know about China’s embargo on the supply part. So, we don't know how that will affect things.\" China in May had said it will restrict the exports of certain aviation and aerospace components and technologies starting July 1, citing the need to safeguard national security. ","cleaned_content":"travel tech company ixigo has stepped up its focus on a wider share of the air travel pie and looks to tap into the next billion users betting big on capacity addition the simmering air fares will stabilise and cool off at some point with capacity additions aloke bajpai chairman managing director and group chief executive officer of the company told moneycontrol if you think from where the next \u003cFIVE_TEN\u003e million new flyers are going to come from then a lot of them will be train passengers travelling in the second and third ac trains a lower air fare will lead to more shift in passengers from trains to flights because we are a market where only \u003cFOUR_PERCENT\u003e people fly and take multiple trips and thats how we get \u003cONE_HUNDRED\u003e million passengers in a year compared to most other economies we are still underpenetrated on the air side ixigo needs to ride on that and tap into the next billion users he said we are at a low market share in air so we are pushing the pedal there to accelerate growth bajpai said the indian air travel market is one of the fastest growing markets in the world with total passengers handled across airports amounting to \u003cTHREE_TEN\u003e crore passengers in fy23 according to ixigos red herring prospectus rhp the initial public offering of le travenues technology the parent company of travel aggregator ixigo will hit dalal street on june \u003cONE_TEN\u003e indias current air travel market is estimated to be \u003cFOUR_PERCENT\u003e lesser that pre covid numbers in fy20 \u003cONE_TEN\u003e crore indian travellers took to the skies to fulfil their domestic travel needs and in fy23 this number reached \u003cONE_TEN\u003e crore as per the rhp bajpai expects capacity addition to accelerate in the coming few years over \u003cONE_THOUSAND\u003e aircrafts are on order so we are looking at market size tripling once all of that inventory comes in the industry is hoping the new inventory starts coming from the second half of this year fy25 the airlines are guiding the same indigo said they will add one aircraft every week air india is also seeing some deliveries coming in these are positive signs he said both indigo and air india have placed landmark plane orders with aircraft manufacturers recently with indigo placing an order of \u003cFIVE_HUNDRED\u003e aircraft in june \u003cTWO_THOUSAND\u003e this \u003cFIVE_HUNDRED\u003e aircraft order is not only indigo s largest order but also the largest ever single aircraft purchase by any airline with airbus air india has also firmed up its order for \u003cTWO_HUNDRED\u003e airbus aircraft and \u003cTWO_HUNDRED\u003e new boeing planes in june \u003cTWO_THOUSAND\u003e the air india order includes \u003cSEVEN_TEN\u003e widebody planes comprising \u003cTHREE_TEN\u003e a350 \u003cONE_THOUSAND\u003e s and six a350 \u003cNINE_HUNDRED\u003e s from airbus and \u003cTWO_TEN\u003e \u003cSEVEN_HUNDRED\u003e dreamliners and \u003cONE_TEN\u003e \u003cSEVEN_HUNDRED\u003e xs from boeing it also includes \u003cONE_HUNDRED\u003e airbus a320neo \u003cSEVEN_TEN\u003e airbus a321neo and \u003cONE_HUNDRED\u003e boeing \u003cSEVEN_HUNDRED\u003e max narrow body aircraft air india has also signed options to buy an additional \u003cSEVEN_TEN\u003e planes from boeing including \u003cFIVE_TEN\u003e \u003cSEVEN_HUNDRED\u003e maxs and \u003cTWO_TEN\u003e \u003cSEVEN_HUNDRED\u003e dreamliners the delivery of these planes is expected to happen over the next five years the growth in new airplane deliveries is a key driver with the indian fleet expected to be \u003cONE_THOUSAND\u003e aircrafts by \u003cTWO_THOUSAND\u003e however on capacity additions bajpai pointed out that a lot depends on boeing and airbus being able to deliver aircrafts in a timely fashion we recently got to know about china s embargo on the supply part so we dont know how that will affect things china in may had said it will restrict the exports of certain aviation and aerospace components and technologies starting july \u003cONE_\u003e citing the need to safeguard national security","timestamp":"2024-06-07T14:57:00+05:30","market_timestamp":"2024-06-07T14:57:00+05:30","off_market_hours":false}