{"url":"https://www.moneycontrol.com/news/business/phonepe-launches-secured-lending-products-in-6-categories-12736818.html","title":"PhonePe launches secured lending products in 6 categories","description":"PhonePe users can avail mutual fund loan, gold loan, bike loan, car loan, home loan/loan against property and education loan, according to a company statement.PhonePe launches secured lending products in 6 categories","content":"Homegrown fintech firm PhonePe on Thursday said it has launched secured lending products across six categories on its platform. PhonePe users can avail mutual fund loan, gold loan, bike loan, car loan, home loan/loan against property and education loan, according to a company statement. The firm has partnered with banks, Non-banking Financial Companies (NBFCs) and fintech firms such as Tata Capital, L\u0026T Finance, Hero FinCorp, Muthoot Fincorp, DMI Housing Finance, Home First Finance, RuPay, Volt Money, and Gradright, the statement said. \"Lenders are investing heavily in digitising the secured loan journeys and customers are adapting to the digitisation at a rapid pace. We believe it's a great time to revolutionise the secured lending product experience for the customers working with the lending ecosystem,\" Hemant Gala, CEO, PhonePe Lending, said. ","cleaned_content":"homegrown fintech firm phonepe on thursday said it has launched secured lending products across six categories on its platform phonepe users can avail mutual fund loan gold loan bike loan car loan home loan loan against property and education loan according to a company statement the firm has partnered with banks non banking financial companies nbfcs and fintech firms such as tata capital l t finance hero fincorp muthoot fincorp dmi housing finance home first finance rupay volt money and gradright the statement said lenders are investing heavily in digitising the secured loan journeys and customers are adapting to the digitisation at a rapid pace we believe its a great time to revolutionise the secured lending product experience for the customers working with the lending ecosystem hemant gala ceo phonepe lending said","timestamp":"2024-05-30T14:41:00+05:30","market_timestamp":"2024-05-30T14:41:00+05:30","off_market_hours":false}