{"url":"https://www.moneycontrol.com/news/business/welspun-corp-associate-company-signs-rs-3670-crore-contracts-with-aramco-for-steel-pipe-supply-12739350.html","title":"Welspun Corp associate company signs Rs 3,670 crore contracts with Aramco for steel pipe supply","description":"The duration of the contracts is 19 months, and the financial impact of the contracts will be reflected from the fourth quarter of the financial year 2024-25 to the last quarter of the financial year 2025-26, Welspun Corp said in an exchange filing.Welspun Corp associate company signs Rs 3,670 crore contracts with Aramco for steel pipe supply","content":"Homegrown Welspun Corp Ltd on Monday said its associate entity EPIC has signed multiple agreements worth SAR 1.65 billion (about Rs 3,670 crore) with Saudi Arabian Oil Co. (Aramco) for the supply of steel pipes. The duration of the contracts is 19 months, and the financial impact of the contracts will be reflected from the fourth quarter of the financial year 2024-25 to the last quarter of the financial year 2025-26, Welspun Corp said in an exchange filing. \"Our associate company East Pipes Integrated Company for Industry (EPIC) today announced multi contracts sign off with Saudi Arabian Oil Co. (Aramco) with value exceeding (Saudi Riyal) SAR 1.65 billion (approximately Rs 3,670 crore) inclusive of value added tax for manufacturing and supply of steel pipes,\" it said. EPIC is Saudi Arabia's leading manufacturer of Helical Submerged Arc Welded (HSAW) pipes, Welspun Corp said. ","cleaned_content":"homegrown welspun corp ltd on monday said its associate entity epic has signed multiple agreements worth sar \u003cONE_\u003e billion about rs \u003cTHREE_THOUSAND\u003e crore with saudi arabian oil co aramco for the supply of steel pipes the duration of the contracts is \u003cONE_TEN\u003e months and the financial impact of the contracts will be reflected from the fourth quarter of the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e to the last quarter of the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e welspun corp said in an exchange filing our associate company east pipes integrated company for industry epic today announced multi contracts sign off with saudi arabian oil co aramco with value exceeding saudi riyal sar \u003cONE_\u003e billion approximately rs \u003cTHREE_THOUSAND\u003e crore inclusive of value added tax for manufacturing and supply of steel pipes it said epic is saudi arabias leading manufacturer of helical submerged arc welded hsaw pipes welspun corp said","timestamp":"2024-06-03T12:56:00+05:30","market_timestamp":"2024-06-03T12:56:00+05:30","off_market_hours":false}