{"url":"https://www.moneycontrol.com/news/business/shriram-life-insurance-eyes-expansion-of-business-across-geographies-12736399.html","title":"Shriram Life Insurance eyes expansion of business across geographies","description":"The insurance major would emphasize customer segments where the need for life insurance is the highest, yet have been financially underserved, company Managing Director and CEO Casparus J H Kromhout said.Shriram Life Insurance eyes expansion of business across geographiesRelated stories","content":"Shriram Life Insurance Company Ltd has drawn up plans to bolster its presence by expanding into tier 2 and 3 towns across 15 states in the country. The insurance major would emphasize customer segments where the need for life insurance is the highest, yet have been financially underserved, company Managing Director and CEO Casparus J H Kromhout said. \"What we realized was that we are in more than 15 states and we need to focus on growing deeper into states where the need (for insurance) is more. So, we have identified 15 states and we will apply all our business models and we can make bigger business in those states rather than going here and there,\" he told PTI in an interaction. \"In order to have a sustainable company you have to make sure that you are as efficient as possible and one way to do that is to focus on deepening your penetration into a state rather than just going here and there. You cannot be here and there. That is the main reason behind that and we can also ensure that the state is properly serviced,\" he said. Asked to share names of some of the states that the company was planning to foray into, he said the company has a strong footprint in Andhra Pradesh, Telangana, and Tamil Nadu. \"If you look at Uttar Pradesh, it is a very large state. Very under-penetrated. Odisha and Bihar,\" he said. According to company officials, the Southern region contributes the majority of retail NB premium contribution at 47 per cent followed by the East and North East at 16 per cent. Central and Western parts of the country contribute 14 per cent each, while North stands at 10 per cent. Shriram Life Insurance has partnered with cooperative and regional rural banks and reaped success. \"We work closely with them (regional rural banks, cooperative banks). It is not only getting a partner and then asking them to do business, we have to co-create solutions and work with them. We are also looking at interesting partners in other industries as well,\" he said. Shriram Life Insurance recorded a profit after tax of Rs 158 crore for the financial year ending March 31, 2024, as compared to Rs 156 crore registered a year ago. The company witnessed a 62 per cent surge in new business premiums at Rs 1,871 crore in FY 2023-24 as against Rs 1,152 crore registered in the previous financial year. Individual and new business premiums grew 39 per cent during the year ending March 31, 2024, at Rs 938 crore as compared to Rs 675 crore recorded a year ago. Responding to a query on the financial performance, he said the 62 per cent growth was contributed by group business and individual retail business. \"The important focus (for Shriram Life Insurance in the current financial year) is individual and retail business. We have achieved 39 per cent (growth in the last financial year) and we will try to another 30-40 per cent in the current (financial) year. So, we will keep building on the retail business,\" he said. Shriram Life Insurance has embarked on sales diversification by developing in-house sales capacity as well as partnerships with banks and other institutions, the company said. ","cleaned_content":"shriram life insurance company ltd has drawn up plans to bolster its presence by expanding into tier \u003cTWO_\u003e and \u003cTHREE_\u003e towns across \u003cONE_TEN\u003e states in the country the insurance major would emphasize customer segments where the need for life insurance is the highest yet have been financially underserved company managing director and ceo casparus j h kromhout said what we realized was that we are in more than \u003cONE_TEN\u003e states and we need to focus on growing deeper into states where the need for insurance is more so we have identified \u003cONE_TEN\u003e states and we will apply all our business models and we can make bigger business in those states rather than going here and there he told pti in an interaction in order to have a sustainable company you have to make sure that you are as efficient as possible and one way to do that is to focus on deepening your penetration into a state rather than just going here and there you cannot be here and there that is the main reason behind that and we can also ensure that the state is properly serviced he said asked to share names of some of the states that the company was planning to foray into he said the company has a strong footprint in andhra pradesh telangana and tamil nadu if you look at uttar pradesh it is a very large state very under penetrated odisha and bihar he said according to company officials the southern region contributes the majority of retail nb premium contribution at \u003cFOUR_TEN_PERCENT\u003e followed by the east and north east at \u003cONE_TEN_PERCENT\u003e central and western parts of the country contribute \u003cONE_TEN_PERCENT\u003e each while north stands at \u003cONE_TEN_PERCENT\u003e shriram life insurance has partnered with cooperative and regional rural banks and reaped success we work closely with them regional rural banks cooperative banks it is not only getting a partner and then asking them to do business we have to co create solutions and work with them we are also looking at interesting partners in other industries as well he said shriram life insurance recorded a profit after tax of rs \u003cONE_HUNDRED\u003e crore for the financial year ending march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e as compared to rs \u003cONE_HUNDRED\u003e crore registered a year ago the company witnessed a \u003cSIX_TEN_PERCENT\u003e surge in new business premiums at rs \u003cONE_THOUSAND\u003e crore in fy \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e as against rs \u003cONE_THOUSAND\u003e crore registered in the previous financial year individual and new business premiums grew \u003cTHREE_TEN_PERCENT\u003e during the year ending march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e at rs \u003cNINE_HUNDRED\u003e crore as compared to rs \u003cSIX_HUNDRED\u003e crore recorded a year ago responding to a query on the financial performance he said the \u003cSIX_TEN_PERCENT\u003e growth was contributed by group business and individual retail business the important focus for shriram life insurance in the current financial year is individual and retail business we have achieved \u003cTHREE_TEN_PERCENT\u003e growth in the last financial year and we will try to another \u003cTHREE_TEN\u003e \u003cFOUR_TEN_PERCENT\u003e in the current financial year so we will keep building on the retail business he said shriram life insurance has embarked on sales diversification by developing in house sales capacity as well as partnerships with banks and other institutions the company said","timestamp":"2024-05-30T10:08:00+05:30","market_timestamp":"2024-05-30T10:08:00+05:30","off_market_hours":false}