{"url":"https://www.moneycontrol.com/news/business/shinhan-bank-gets-cci-nod-to-acquire-11-stake-in-hdfc-credila-12736342.html","title":"Shinhan Bank gets CCI nod to acquire 11% stake in HDFC Credila","description":"Part of the Shinhan Financial Group, Shinhan Bank Co Ltd is a multinational bank, which commenced operations in India in 1996.Shinhan Bank gets CCI nod to acquire 11% stake in HDFC CredilaRelated stories","content":"The Competition Commission of India (CCI) has cleared South Korea-based Shinhan Bank's proposed acquisition of an 11 per cent stake in HDFC Credila Financial Services. Part of the Shinhan Financial Group, Shinhan Bank Co Ltd is a multinational bank, which commenced operations in India in 1996. \"The proposed combination relates to the acquisition of up to approximately 11 per cent shareholding by Shinhan Bank in HDFC Credila by way of subscription to shares of HDFC Credila,\" CCI said in a release on Tuesday. In another release, the competition watchdog granted its approval to Matrix Pharma to acquire 100 per cent stake in Tianish Laboratories. The acquisition will be funded in part by an investment proposed to be made by the investors in optionally convertible debentures of Mudhra Labs -- the holding company of Matrix Pharma. The regulator also cleared investment by Kingsman in compulsorily convertible preference shares of Mudhra Lifesciences, the ultimate holding company of Matrix Pharma. The proceeds of these investments will be utilised by Matrix Pharma towards the acquisition of Tianish Laboratories. Tianish Laboratories Pvt Ltd carries out the business of manufacture and sale of active pharmaceutical ingredients in India. Kingsman Wealth Fund PCC -- Aurisse Special Opportunities Fund (Kingsman) holds a global business license, issued by the Financial Services Commission, Mauritius. Fair trade regulator CCI said it has cleared the deals. The deals beyond a certain threshold require approval from the regulator, which keeps a tab on unfair business practices as well as promotes fair competition in the marketplace. ","cleaned_content":"the competition commission of india cci has cleared south korea based shinhan banks proposed acquisition of an \u003cONE_TEN_PERCENT\u003e stake in hdfc credila financial services part of the shinhan financial group shinhan bank co ltd is a multinational bank which commenced operations in india in \u003cONE_THOUSAND\u003e the proposed combination relates to the acquisition of up to approximately \u003cONE_TEN_PERCENT\u003e shareholding by shinhan bank in hdfc credila by way of subscription to shares of hdfc credila cci said in a release on tuesday in another release the competition watchdog granted its approval to matrix pharma to acquire \u003cONE_HUNDRED_PERCENT\u003e stake in tianish laboratories the acquisition will be funded in part by an investment proposed to be made by the investors in optionally convertible debentures of mudhra labs the holding company of matrix pharma the regulator also cleared investment by kingsman in compulsorily convertible preference shares of mudhra lifesciences the ultimate holding company of matrix pharma the proceeds of these investments will be utilised by matrix pharma towards the acquisition of tianish laboratories tianish laboratories pvt ltd carries out the business of manufacture and sale of active pharmaceutical ingredients in india kingsman wealth fund pcc aurisse special opportunities fund kingsman holds a global business license issued by the financial services commission mauritius fair trade regulator cci said it has cleared the deals the deals beyond a certain threshold require approval from the regulator which keeps a tab on unfair business practices as well as promotes fair competition in the marketplace","timestamp":"2024-05-30T09:45:00+05:30","market_timestamp":"2024-05-30T09:45:00+05:30","off_market_hours":false}