{"url":"https://www.moneycontrol.com/news/business/india-company-tribunal-clears-air-india-vistara-merger-12743021.html","title":"India company tribunal clears Air India-Vistara merger","description":"The merger, first announced in November 2022, will include Vistara, which is 49% owned by Singapore Airlines being absorbed into Air India, giving Singapore Airlines a 25.1% stake in the merged entity.India company tribunal clears Air India-Vistara merger","content":"An Indian company tribunal approved the merger of full-service carriers Vistara with larger rival Air India on Thursday, according to an order dated June 6, bringing both Tata group airlines a step closer to completing the deal. The merger, first announced in November 2022, will include Vistara, which is 49% owned by Singapore Airlines being absorbed into Air India, giving Singapore Airlines a 25.1% stake in the merged entity. \"A sanction is hereby granted to the 'Composite Scheme of Arrangement' amongst the petitioner companies and their respective shareholders,\" the National Company Law Tribunal (NCLT) said in its order. Both India's and Singapore's antitrust regulators have cleared the deal. The merger is expected to be completed by the end of the year, Air India CEO Campbell Wilson said earlier this week. The Air India group, which also includes low-cost carrier Air India Express and Air Asia India, has ordered a staggering 470 jets from Airbus and Boeing, aiming to take on local rivals such as IndiGo and Middle Eastern carriers that dominate outbound traffic from India. ","cleaned_content":"an indian company tribunal approved the merger of full service carriers vistara with larger rival air india on thursday according to an order dated june \u003cSIX_\u003e bringing both tata group airlines a step closer to completing the deal the merger first announced in november \u003cTWO_THOUSAND\u003e will include vistara which is \u003cFOUR_TEN_PERCENT\u003e owned by singapore airlines being absorbed into air india giving singapore airlines a \u003cTWO_TEN_PERCENT\u003e stake in the merged entity a sanction is hereby granted to the composite scheme of arrangement amongst the petitioner companies and their respective shareholders the national company law tribunal nclt said in its order both indias and singapores antitrust regulators have cleared the deal the merger is expected to be completed by the end of the year air india ceo campbell wilson said earlier this week the air india group which also includes low cost carrier air india express and air asia india has ordered a staggering \u003cFOUR_HUNDRED\u003e jets from airbus and boeing aiming to take on local rivals such as indigo and middle eastern carriers that dominate outbound traffic from india","timestamp":"2024-06-07T09:48:00+05:30","market_timestamp":"2024-06-07T09:48:00+05:30","off_market_hours":false}