{"url":"https://www.moneycontrol.com/news/business/paytms-upi-market-share-continues-to-slide-after-rbi-crackdown-12742908.html","title":"Paytm’s UPI market share continues to slide after RBI crackdown","description":"Paytm accounted for 8.1% of total UPI transactions in May, down from 13% in January, according to data released by the National Payments Corporation of India. Paytm’s UPI market share continues to slide after RBI crackdownRelated stories","content":"Paytm’s share of the unified payments interface (UPI) market in India fell for a fourth straight month as the fintech pioneer struggles to recover from a regulatory setback. Paytm accounted for 8.1% of total UPI transactions in May, down from 13% in January, according to data released by the National Payments Corporation of India. The company was rocked in January when the Reserve Bank of India ordered Paytm Payments Bank Ltd., a banking affiliate, to wind down operations. Its shares have fallen about 55% since then.  Operated by state-backed NPCI, UPI is a system that allows users to make instant money transfers by linking banks with fintech apps such as Paytm, PhonePe and Google Pay. The UPI network processed a record 14.04 billion transactions in May, up 5.5% month-on-month. Walmart Inc.-owned PhonePe maintained its dominant position in the market with a 49% share in May, while Alphabet’s Google Pay boasted a 37% share.  Since the RBI order, Sharma has moved to steady the ship through new partnerships with some of India’s top lenders including Axis Bank Ltd., HDFC Bank Ltd. and State Bank of India Ltd. The alliances will help Paytm with instant money transfers that used to be handled by its banking affiliate. The company didn’t respond to a request for comment from Bloomberg News. “We expect near-term financial impact to our revenue and profitability, due to disruptions faced in our business in Q4,” Sharma said in Paytm’s latest earnings filing. ","cleaned_content":"paytm s share of the unified payments interface upi market in india fell for a fourth straight month as the fintech pioneer struggles to recover from a regulatory setback paytm accounted for \u003cEIGHT_PERCENT\u003e of total upi transactions in may down from \u003cONE_TEN_PERCENT\u003e in january according to data released by the national payments corporation of india the company was rocked in january when the reserve bank of india ordered paytm payments bank ltd a banking affiliate to wind down operations its shares have fallen about \u003cFIVE_TEN_PERCENT\u003e since then operated by state backed npci upi is a system that allows users to make instant money transfers by linking banks with fintech apps such as paytm phonepe and google pay the upi network processed a record \u003cONE_TEN\u003e billion transactions in may up \u003cFIVE_PERCENT\u003e month on month walmart inc owned phonepe maintained its dominant position in the market with a \u003cFOUR_TEN_PERCENT\u003e share in may while alphabet s google pay boasted a \u003cTHREE_TEN_PERCENT\u003e share since the rbi order sharma has moved to steady the ship through new partnerships with some of india s top lenders including axis bank ltd hdfc bank ltd and state bank of india ltd the alliances will help paytm with instant money transfers that used to be handled by its banking affiliate the company didn t respond to a request for comment from bloomberg news we expect near term financial impact to our revenue and profitability due to disruptions faced in our business in q4 sharma said in paytm s latest earnings filing","timestamp":"2024-06-07T06:45:00+05:30","market_timestamp":"2024-06-07T09:15:00+05:30","off_market_hours":true}