{"url":"https://www.moneycontrol.com/news/business/byjus-creditors-petition-to-put-more-units-in-us-bankruptcy-12742130.html","title":"Byju’s creditors petition to put more units in US bankruptcy","description":"Creditors led by HPS Investment Partners filed involuntary Chapter 11 cases in Delaware against Neuron Fuel Inc., Epic! Creations Inc. and Tangible Play Inc. on Wednesday. All three were once affiliated with Byju’s Alpha, a unit of the once high-flying startup that was put into bankruptcy earlier this year after defaulting on $1.2 billion of debt. Byju’s creditors petition to put more units in US bankruptcyRelated stories","content":"A group of lenders asked a court to impose bankruptcy oversight on multiple units tied to the struggling Indian education technology company Byju’s, claiming millions of dollars are being “siphoned” out of the companies. Creditors led by HPS Investment Partners filed involuntary Chapter 11 cases in Delaware against Neuron Fuel Inc., Epic! Creations Inc. and Tangible Play Inc. on Wednesday. All three were once affiliated with Byju’s Alpha, a unit of the once high-flying startup that was put into bankruptcy earlier this year after defaulting on $1.2 billion of debt. The lenders accused firm’s eponymous founder Byju Raveendran of violating their debt contracts by refusing to give them financial details about the three units, which are known “alleged debtors” now that they face bankruptcy. The units should have their spending restricted immediately and eventually a trustee may need to be appointed to run them, the lenders said in court papers. Involuntary bankruptcy cases, which are brought by debt holders, require a company to either agree to put itself under court protection or fight creditors to have the petition thrown out. Firms including Redwood Capital Management, Veritas Capital and loan agent Glas Trust also signed onto the case, court papers show. Byju’s plans to challenge the case, which in an emailed statement it called “premature to say the least.” The company argues that some of the lenders are not legitimate owners of the debt because they are on a list of “disqualified” investors who, under the debt contracts, are barred from holding the loan. “The lenders claim to be creditors of these entities, notwithstanding that the question of whether the underlying loan amount is due and payable remains to be decided,” a company spokesperson said in an email, referring to a lawsuit challenging whether the $1.2 billion loan is in default. The units were affiliates of Byju’s Alpha until March 2023, when Glas Trust took control of the Alpha unit, according to court papers. Byju’s, once one of India’s hottest tech startups, has been in a prolonged fight with creditors over a debt restructuring. Raveendran built an aggressively expanding education company that was once valued at $22 billion but struggled when demand for tutoring dropped off as the pandemic waned and schools reopened. The company and its lenders are now battling in courts in Delaware and New York, primarily over where the troubled company stashed $533 million that jilted lenders say should go to them. The case is Epic! Creations, Inc., 24-11161, US Bankruptcy Court, District of Delaware (Wilmington). ","cleaned_content":"a group of lenders asked a court to impose bankruptcy oversight on multiple units tied to the struggling indian education technology company byju s claiming millions of dollars are being siphoned out of the companies creditors led by hps investment partners filed involuntary chapter \u003cONE_TEN\u003e cases in delaware against neuron fuel inc epic creations inc and tangible play inc on wednesday all three were once affiliated with byju s alpha a unit of the once high flying startup that was put into bankruptcy earlier this year after defaulting on \u003cONE_\u003e billion of debt the lenders accused firm s eponymous founder byju raveendran of violating their debt contracts by refusing to give them financial details about the three units which are known alleged debtors now that they face bankruptcy the units should have their spending restricted immediately and eventually a trustee may need to be appointed to run them the lenders said in court papers involuntary bankruptcy cases which are brought by debt holders require a company to either agree to put itself under court protection or fight creditors to have the petition thrown out firms including redwood capital management veritas capital and loan agent glas trust also signed onto the case court papers show byju s plans to challenge the case which in an emailed statement it called premature to say the least the company argues that some of the lenders are not legitimate owners of the debt because they are on a list of disqualified investors who under the debt contracts are barred from holding the loan the lenders claim to be creditors of these entities notwithstanding that the question of whether the underlying loan amount is due and payable remains to be decided a company spokesperson said in an email referring to a lawsuit challenging whether the \u003cONE_\u003e billion loan is in default the units were affiliates of byju s alpha until march \u003cTWO_THOUSAND\u003e when glas trust took control of the alpha unit according to court papers byju s once one of india s hottest tech startups has been in a prolonged fight with creditors over a debt restructuring raveendran built an aggressively expanding education company that was once valued at \u003cTWO_TEN\u003e billion but struggled when demand for tutoring dropped off as the pandemic waned and schools reopened the company and its lenders are now battling in courts in delaware and new york primarily over where the troubled company stashed \u003cFIVE_HUNDRED\u003e million that jilted lenders say should go to them the case is epic creations inc \u003cTWO_TEN\u003e \u003cONE_TEN_THOUSAND\u003e us bankruptcy court district of delaware wilmington","timestamp":"2024-06-06T07:25:00+05:30","market_timestamp":"2024-06-06T09:15:00+05:30","off_market_hours":true}