{"url":"https://www.moneycontrol.com/news/business/air-india-express-bets-on-growth-opportunities-group-synergies-12741614.html","title":"Air India Express bets on growth opportunities, group synergies","description":"Air India Express is in the process of merging AIX Connect, formerly AirAsia India. \"In 2024-25, a lot of synergies will be unlocked... there will be a laser focus on the cost side,\" Singh said.Air India Express bets on growth opportunities, group synergies","content":"As it looks to tap the growth opportunities and group synergies, Air India Express Managing Director Aloke Singh on Wednesday said the airline will focus on the cost side and transformation plans in 2024-25. Air India Express is in the process of merging AIX Connect, formerly AirAsia India. \"In 2024-25, a lot of synergies will be unlocked... there will be a laser focus on the cost side,\" Singh said. The two airlines are part of the Tata Group, which is also in the process of merging Vistara with Air India. There will be cross feeds between Air India long haul flights and domestic short haul flights, he said and added that there is substantial growth coming in. Speaking at the CAPA India Aviation Summit 2024 in the national capital, Singh also said that for the next five years, he does not see any issue of bilateral flying rights impacting its growth. ","cleaned_content":"as it looks to tap the growth opportunities and group synergies air india express managing director aloke singh on wednesday said the airline will focus on the cost side and transformation plans in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e air india express is in the process of merging aix connect formerly airasia india in \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e a lot of synergies will be unlocked there will be a laser focus on the cost side singh said the two airlines are part of the tata group which is also in the process of merging vistara with air india there will be cross feeds between air india long haul flights and domestic short haul flights he said and added that there is substantial growth coming in speaking at the capa india aviation summit \u003cTWO_THOUSAND\u003e in the national capital singh also said that for the next five years he does not see any issue of bilateral flying rights impacting its growth","timestamp":"2024-06-05T13:37:00+05:30","market_timestamp":"2024-06-05T13:37:00+05:30","off_market_hours":false}