{"url":"https://www.moneycontrol.com/news/business/jsw-energy-begins-construction-of-1-gwh-battery-energy-storage-project-in-rajasthan-12744748.html","title":"JSW Energy begins construction of 1 GWh  battery energy storage project in Rajasthan","description":"The company bagged the project from Solar Energy Corporation of India Limited (SECI) recently, JSW Energy said in an exchange filing.JSW Energy begins construction of 1 GWh  battery energy storage project in Rajasthan","content":"JSW Energy on Monday said it has commenced the construction of 1 gigawatt hour (GWh) battery energy storage system project at Fatehgarh in Rajasthan. The company bagged the project from Solar Energy Corporation of India Limited (SECI) recently, JSW Energy said in an exchange filing. The project consists of two installations, each with a 500 MWh storage capacity, designed for two hours of storage in one cycle. The project will be developed under a Build Own Operate and Transfer (BOOT) mechanism and will be transferred to the offtaker after 12 years, the company said. The company has also signed a Memorandum of Understanding (MoU) with JSW Steel Ltd to supply an additional 85,000-90,000 tonne of green hydrogen annually, along with 7,20,000 tonne per annum (TPA) of green oxygen, progressively by 2030. Sharad Mahendra, Joint Managing Director and CEO, JSW Energy, said, \"...Our Battery Energy Storage System project represents a crucial advancement in enhancing grid stability and integrating renewable energy sources.\" ","cleaned_content":"jsw energy on monday said it has commenced the construction of \u003cONE_\u003e gigawatt hour gwh battery energy storage system project at fatehgarh in rajasthan the company bagged the project from solar energy corporation of india limited seci recently jsw energy said in an exchange filing the project consists of two installations each with a \u003cFIVE_HUNDRED\u003e mwh storage capacity designed for two hours of storage in one cycle the project will be developed under a build own operate and transfer boot mechanism and will be transferred to the offtaker after \u003cONE_TEN\u003e years the company said the company has also signed a memorandum of understanding mou with jsw steel ltd to supply an additional \u003cEIGHT_TEN_THOUSAND\u003e \u003cNINE_TEN_THOUSAND\u003e tonne of green hydrogen annually along with \u003cSEVEN_HUNDRED_THOUSAND\u003e tonne per annum tpa of green oxygen progressively by \u003cTWO_THOUSAND\u003e sharad mahendra joint managing director and ceo jsw energy said our battery energy storage system project represents a crucial advancement in enhancing grid stability and integrating renewable energy sources","timestamp":"2024-06-10T11:07:00+05:30","market_timestamp":"2024-06-10T11:07:00+05:30","off_market_hours":false}