{"url":"https://www.moneycontrol.com/news/business/religare-asked-to-seek-regulatory-nod-for-top-investor-raising-stake-12752495.html","title":"Religare asked to seek regulatory nod for top investor raising stake","description":"The Burmans, who founded and control consumer goods conglomerate Dabur India, raised its stake in Religare to nearly 25% in September last year, triggering the so-called open offer requirement that allows them to buy more shares from public shareholders.Religare asked to seek regulatory nod for top investor raising stake","content":"India's markets regulator has asked Religare Enterprises to apply for approvals to let the billionaire Burman family buy more shares in the financial services company, dealing a blow to the company's attempt to block the move. The Burmans, who founded and control consumer goods conglomerate Dabur India, raised its stake in Religare to nearly 25% in September last year, triggering the so-called open offer requirement that allows them to buy more shares from public shareholders. However, Religare had sought to block the deal saying the open offer was \"riddled with irregularities and statutory violations and cast serious doubts on the fit and proper status of the acquirers.\" The SEBI, in an interim order dated June 19, asked Religare to furnish an undertaking that it will apply by July 12 to regulatory authorities, including the central bank, for approvals for the open offer. It also asked Religare to form a committee of independent directors, if not already done, but did not give a reason for the directive. Religare and the Burman family did not immediately respond to Reuters' emails seeking comment. ","cleaned_content":"indias markets regulator has asked religare enterprises to apply for approvals to let the billionaire burman family buy more shares in the financial services company dealing a blow to the companys attempt to block the move the burmans who founded and control consumer goods conglomerate dabur india raised its stake in religare to nearly \u003cTWO_TEN_PERCENT\u003e in september last year triggering the so called open offer requirement that allows them to buy more shares from public shareholders however religare had sought to block the deal saying the open offer was riddled with irregularities and statutory violations and cast serious doubts on the fit and proper status of the acquirers the sebi in an interim order dated june \u003cONE_TEN\u003e asked religare to furnish an undertaking that it will apply by july \u003cONE_TEN\u003e to regulatory authorities including the central bank for approvals for the open offer it also asked religare to form a committee of independent directors if not already done but did not give a reason for the directive religare and the burman family did not immediately respond to reuters emails seeking comment","timestamp":"2024-06-20T10:11:00+05:30","market_timestamp":"2024-06-20T10:11:00+05:30","off_market_hours":false}