{"url":"https://www.moneycontrol.com/news/business/bhel-secures-rs-7000-crore-orders-from-adani-power-for-two-power-plants-12748656.html","title":"BHEL secures Rs 7,000 crore orders from Adani Power for two power plants","description":"The first order for the 2x800 MW Raipur supercritical thermal power plant, being set up in Raipur district of Chhattisgarh, has been received from Adani Power Limited, BHEL said in a statement.BHEL secures Rs 7,000 crore orders from Adani Power for two power plants","content":"State-owned BHEL on Friday said it has secured orders for two power plants worth Rs 7,000 crore from Adani Power. The first order for the 2x800 MW Raipur supercritical thermal power plant, being set up in Raipur district of Chhattisgarh, has been received from Adani Power Limited, BHEL said in a statement. The second order for the 2x800 MW Mirzapur supercritical thermal power plant, being set up in Mirzapur district of Uttar Pradesh, has been received from MTEUPPL (a subsidiary of Adani Power Limited), it said. Bharat Heavy Electricals Limited (BHEL), under the Ministry of Heavy Industries, is India's largest engineering and manufacturing enterprise, operating in the energy, industry and infrastructure sectors. ","cleaned_content":"state owned bhel on friday said it has secured orders for two power plants worth rs \u003cSEVEN_THOUSAND\u003e crore from adani power the first order for the \u003cTWO_\u003e x800 mw raipur supercritical thermal power plant being set up in raipur district of chhattisgarh has been received from adani power limited bhel said in a statement the second order for the \u003cTWO_\u003e x800 mw mirzapur supercritical thermal power plant being set up in mirzapur district of uttar pradesh has been received from mteuppl a subsidiary of adani power limited it said bharat heavy electricals limited bhel under the ministry of heavy industries is indias largest engineering and manufacturing enterprise operating in the energy industry and infrastructure sectors","timestamp":"2024-06-14T12:37:00+05:30","market_timestamp":"2024-06-14T12:37:00+05:30","off_market_hours":false}