{"url":"https://www.moneycontrol.com/news/business/waaree-energies-bags-order-to-supply-280-mw-solar-modules-to-mahindra-susten-12752723.html","title":"Waaree Energies bags order to supply 280 MW solar modules to Mahindra Susten","description":"The modules will be delivered from December 2024 onwards and are designed to support Mahindra Susten's ambitious renewable energy projects, a company statement said.Waaree Energies bags order to supply 280 MW solar modules to Mahindra Susten","content":"Waaree Energies on Thursday said that it has secured an order to supply 280 MW solar modules to Mahindra Susten. The modules will be delivered from December 2024 onwards and are designed to support Mahindra Susten's ambitious renewable energy projects, a company statement said. The Waaree Energies announced an agreement with Mahindra Susten, a renewable independent power producer (IPP), to supply 280 MW (DC) of advanced solar modules in Bikaner, Rajasthan, according to the statement. Sunil Rathi, Director Sales, Waaree Energies, said in the statement, \"Partnering with Mahindra Susten is a source of great pride for our company.\" Deepak Thakur, Managing Director \u0026 CEO of Mahindra Susten said in the statement, \"We are pleased to announce our second order this financial year with Waaree Energies.\" ","cleaned_content":"waaree energies on thursday said that it has secured an order to supply \u003cTWO_HUNDRED\u003e mw solar modules to mahindra susten the modules will be delivered from december \u003cTWO_THOUSAND\u003e onwards and are designed to support mahindra sustens ambitious renewable energy projects a company statement said the waaree energies announced an agreement with mahindra susten a renewable independent power producer ipp to supply \u003cTWO_HUNDRED\u003e mw dc of advanced solar modules in bikaner rajasthan according to the statement sunil rathi director sales waaree energies said in the statement partnering with mahindra susten is a source of great pride for our company deepak thakur managing director ceo of mahindra susten said in the statement we are pleased to announce our second order this financial year with waaree energies","timestamp":"2024-06-20T12:48:00+05:30","market_timestamp":"2024-06-20T12:48:00+05:30","off_market_hours":false}