{"url":"https://www.moneycontrol.com/news/business/sun-pharma-inks-pact-with-takeda-to-introduce-gastrointestinal-drug-in-india-12753396.html","title":"Sun Pharma inks pact with Takeda to introduce gastrointestinal drug in India","description":"The company has entered into a non-exclusive patent licensing agreement with Takeda to commercialise Vonoprazan tablets in strengths of 10 and 20 mg in India, the Mumbai-based drug major said in a statement.Sun Pharma inks pact with Takeda to introduce gastrointestinal drug in IndiaRelated stories","content":"Sun Pharmaceutical Industries on Friday said it has inked a licensing pact with Takeda Pharmaceutical Company to commercialise a novel gastrointestinal drug in India. The company has entered into a non-exclusive patent licensing agreement with Takeda to commercialise Vonoprazan tablets in strengths of 10 and 20 mg in India, the Mumbai-based drug major said in a statement. Vonoprazan is a novel, orally active potassium competitive acid blocker (PCAB), used to treat reflux esophagitis and other acid peptic disorders. The partnership demonstrates the company's commitment to gastrointestinal health by providing patients and healthcare practitioners with a novel treatment option to manage reflux esophagitis and other acid peptic disorders, he added. Gastroesophageal Reflux Disease (GERD) is common in India. In November 2023, Vonoprazan was approved by the US FDA for healing and maintenance of all grades of Erosive esophagitis and providing relief from heartburn associated with Erosive esophagitis, and in combination with amoxicillin and clarithromycin or amoxicillin alone for the treatment of Helicobacter pylori (H. pylori) infection in adults. Vonoprazan was discovered and developed by Takeda. The drug is approved in India for treatment of adults with reflux esophagitis and other acid peptic disorders. Shares of Sun Pharma were trading 0.69 percent up at Rs 1,480.55 apiece on the BSE. ","cleaned_content":"sun pharmaceutical industries on friday said it has inked a licensing pact with takeda pharmaceutical company to commercialise a novel gastrointestinal drug in india the company has entered into a non exclusive patent licensing agreement with takeda to commercialise vonoprazan tablets in strengths of \u003cONE_TEN\u003e and \u003cTWO_TEN\u003e mg in india the mumbai based drug major said in a statement vonoprazan is a novel orally active potassium competitive acid blocker pcab used to treat reflux esophagitis and other acid peptic disorders the partnership demonstrates the companys commitment to gastrointestinal health by providing patients and healthcare practitioners with a novel treatment option to manage reflux esophagitis and other acid peptic disorders he added gastroesophageal reflux disease gerd is common in india in november \u003cTWO_THOUSAND\u003e vonoprazan was approved by the us fda for healing and maintenance of all grades of erosive esophagitis and providing relief from heartburn associated with erosive esophagitis and in combination with amoxicillin and clarithromycin or amoxicillin alone for the treatment of helicobacter pylori h pylori infection in adults vonoprazan was discovered and developed by takeda the drug is approved in india for treatment of adults with reflux esophagitis and other acid peptic disorders shares of sun pharma were trading \u003cZERO_PERCENT\u003e up at rs \u003cONE_THOUSAND\u003e apiece on the bse","timestamp":"2024-06-21T10:19:00+05:30","market_timestamp":"2024-06-21T10:19:00+05:30","off_market_hours":false}