{"url":"https://www.moneycontrol.com/news/business/india-largest-market-for-nestles-maggi-worldwide-2nd-biggest-for-kitkat-12751107.html","title":"India largest market for Nestle's Maggi worldwide, 2nd biggest for KitKat","description":"Besides, the India market with a high double-digit growth has become one of the fastest growing markets for Nestle, it added.India largest market for Nestle's Maggi worldwide, 2nd biggest for KitKatRelated stories","content":"India has become the largest market for Nestle globally for its instant noodles and soup brand Maggi and the second largest for chocolate wafer brand KitKat, according to the latest annual report of its local subsidiary. Besides, the India market with a high double-digit growth has become one of the fastest growing markets for Nestle, it added. \"Penetration, premiumisation and innovation, combined with disciplined resource allocation, have been key in driving business, making your company one of the fastest growing markets for Nestle globally,\" said Nestle India's annual report for 2023-24. Nestle is expanding its play under brand Maggi and has launched Oats Noodle, Korean Noodles and various masala variants at an affordable Rs 10. \"The Prepared Dishes and Cooking Aids business recorded a strong growth momentum. This was aided by a balance of product mix, pricing and volume growth in Maggi noodles and Maggi Masala-ae-Magic, supported by strong consumer engagement and market presence with media campaigns and attractive consumer activations,\" it said. In confectionary, Nestle India said it sold 4,200 million fingers of KitKat. The growth was fuelled by the launch of new products, expansion of the distribution network and innovative brand activations. \"KitKat has emerged as the star performer, by not only delivering strong growth but making Nestlé India the second largest market for the brand globally,\" it said. In India, brand Maggi recovered after a five-month ban on its instant noodles over allegation of containing lead beyond permissible limits. However, the instant noodles returned to market after a relaunch in November 2015 and later Nestle India extended the brand in the food segment and adjacencies. Before the crisis, the brand had over 70 per cent market share in the instant noodles segment, which it still has not reached as the competition has intensified in the segment with arrival of new players. Nestle, which is setting up its tenth Indian factory in Odisha, reaffirmed the significance of India as a market. \"Strengthening this further, your company is poised to invest approximately Rs 7,500 crore between 2020 and 2025 to develop new capabilities and expand existing ones with a sharp focus on sustained growth and innovation,\" its Chairman \u0026 Managing Director Suresh Narayanan said while addressing shareholders in the report. The company is focussing on innovations and in the past eight years, it has launched over 140 products. A significant portion of sales in 2023 was attributed to innovative products. According to Narayanan, plant-based products present a significant opportunity for Nestle India, which has been operating here for 112 years. It is also expanding its presence and through RUrban journey its direct coverage has gone beyond two lakh villages. Nestle India recently announced to continue to pay royalty to its parent company at the existing rate of 4.5 per cent of net sales after a proposal to hike it was rejected by shareholders. The company's board approved the continuation of payment of general licence fees (royalty) at the rate of 4.5 per cent to Societe des Produits Nestle SA (licensor) and recommended to the members of the company for their approval. In April, Nestle India's board had approved increasing royalty to its parent company by 0.15 per cent per year for the next five years, thereby enhancing it to 5.25 per cent of net sales. In its annual report, Nestle India said \"the general licence fees (royalty) rate paid by the company to the licensor is comparatively lower\" in comparison to other multinational corporations (MNCs) in India. Nestle India had reported sales of Rs 24,275.5 crore in the fifteen months to March 31, 2024. ","cleaned_content":"india has become the largest market for nestle globally for its instant noodles and soup brand maggi and the second largest for chocolate wafer brand kitkat according to the latest annual report of its local subsidiary besides the india market with a high double digit growth has become one of the fastest growing markets for nestle it added penetration premiumisation and innovation combined with disciplined resource allocation have been key in driving business making your company one of the fastest growing markets for nestle globally said nestle indias annual report for \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e nestle is expanding its play under brand maggi and has launched oats noodle korean noodles and various masala variants at an affordable rs \u003cONE_TEN\u003e the prepared dishes and cooking aids business recorded a strong growth momentum this was aided by a balance of product mix pricing and volume growth in maggi noodles and maggi masala ae magic supported by strong consumer engagement and market presence with media campaigns and attractive consumer activations it said in confectionary nestle india said it sold \u003cFOUR_THOUSAND\u003e million fingers of kitkat the growth was fuelled by the launch of new products expansion of the distribution network and innovative brand activations kitkat has emerged as the star performer by not only delivering strong growth but making nestl india the second largest market for the brand globally it said in india brand maggi recovered after a five month ban on its instant noodles over allegation of containing lead beyond permissible limits however the instant noodles returned to market after a relaunch in november \u003cTWO_THOUSAND\u003e and later nestle india extended the brand in the food segment and adjacencies before the crisis the brand had over \u003cSEVEN_TEN_PERCENT\u003e market share in the instant noodles segment which it still has not reached as the competition has intensified in the segment with arrival of new players nestle which is setting up its tenth indian factory in odisha reaffirmed the significance of india as a market strengthening this further your company is poised to invest approximately rs \u003cSEVEN_THOUSAND\u003e crore between \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e to develop new capabilities and expand existing ones with a sharp focus on sustained growth and innovation its chairman managing director suresh narayanan said while addressing shareholders in the report the company is focussing on innovations and in the past eight years it has launched over \u003cONE_HUNDRED\u003e products a significant portion of sales in \u003cTWO_THOUSAND\u003e was attributed to innovative products according to narayanan plant based products present a significant opportunity for nestle india which has been operating here for \u003cONE_HUNDRED\u003e years it is also expanding its presence and through rurban journey its direct coverage has gone beyond two lakh villages nestle india recently announced to continue to pay royalty to its parent company at the existing rate of \u003cFOUR_PERCENT\u003e of net sales after a proposal to hike it was rejected by shareholders the companys board approved the continuation of payment of general licence fees royalty at the rate of \u003cFOUR_PERCENT\u003e to societe des produits nestle sa licensor and recommended to the members of the company for their approval in april nestle indias board had approved increasing royalty to its parent company by \u003cZERO_PERCENT\u003e per year for the next five years thereby enhancing it to \u003cFIVE_PERCENT\u003e of net sales in its annual report nestle india said the general licence fees royalty rate paid by the company to the licensor is comparatively lower in comparison to other multinational corporations mncs in india nestle india had reported sales of rs \u003cTWO_TEN_THOUSAND\u003e crore in the fifteen months to march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e","timestamp":"2024-06-18T14:35:00+05:30","market_timestamp":"2024-06-18T14:35:00+05:30","off_market_hours":false}