{"url":"https://www.moneycontrol.com/news/business/haldirams-explores-ipo-as-stake-sale-plans-stall-12746867.html","title":"Haldiram's explores IPO as stake sale plans stall: Report","description":"The Agarwal family is considering a listing as bids in the region of $8 billion to $8.5 billion didn’t meet its valuation expectations of about $12 billion, according to the people, who asked not to be identified discussing private information. The Agarwal family is reportedly considering a listing as bids in the region of $8 bn-$8.5 bn didn’t meet its valuation expectations of about $12 bnRelated stories","content":"The owners of Haldiram Snacks Pvt Ltd. are exploring a possible initial public offering for the food producer and restaurant operator as plans to sell it to foreign investors have stalled, people familiar with the matter said. The Agarwal family is considering a listing as bids in the region of $8 billion to $8.5 billion didn’t meet its valuation expectations of about $12 billion, according to the people, who asked not to be identified discussing private information. The company known as Haldiram’s received bids in May from a Blackstone Inc.-led consortium featuring Abu Dhabi Investment Authority and GIC Pte, as well as one led by Bain \u0026 Co. and Temasek Holdings Pte, local media has reported. A representative for Haldiram’s declined to comment. India has turned into a hotspot for IPOs, with about $3.9 billion raised so far this year, double the same period in 2023 and more than Hong Kong and Korea combined, data compiled by Bloomberg show. Founded by Ganga Bishan Agarwal in the 1930s in north India, Haldiram’s sells a range of foods from sweet and savory snacks to frozen meals and breads. It also runs 43 restaurants in and around Delhi, according to its website. ","cleaned_content":"the owners of haldiram snacks pvt ltd are exploring a possible initial public offering for the food producer and restaurant operator as plans to sell it to foreign investors have stalled people familiar with the matter said the agarwal family is considering a listing as bids in the region of \u003cEIGHT_\u003e billion to \u003cEIGHT_\u003e billion didn t meet its valuation expectations of about \u003cONE_TEN\u003e billion according to the people who asked not to be identified discussing private information the company known as haldiram s received bids in may from a blackstone inc led consortium featuring abu dhabi investment authority and gic pte as well as one led by bain co and temasek holdings pte local media has reported a representative for haldiram s declined to comment india has turned into a hotspot for ipos with about \u003cTHREE_\u003e billion raised so far this year double the same period in \u003cTWO_THOUSAND\u003e and more than hong kong and korea combined data compiled by bloomberg show founded by ganga bishan agarwal in the \u003cONE_THOUSAND\u003e s in north india haldiram s sells a range of foods from sweet and savory snacks to frozen meals and breads it also runs \u003cFOUR_TEN\u003e restaurants in and around delhi according to its website","timestamp":"2024-06-12T17:02:00+05:30","market_timestamp":"2024-06-13T09:15:00+05:30","off_market_hours":true}