{"url":"https://www.moneycontrol.com/news/india/indias-consumer-market-represents-long-term-structural-opportunity-n-chandrasekaran-12747696.html","title":"India's consumer market represents long-term structural opportunity: N Chandrasekaran","description":"The Tata group's FMCG arm is well positioned to capitalise on the significant opportunity, he said, while addressing the annual general meeting (AGM) of TCPL.India's consumer market represents long-term structural opportunity: N ChandrasekaranRelated stories","content":"India's consumer market represents a long-term structural opportunity, driven by population, a growing middle class, rapid urbanisation, increasing disposable incomes and raising aspirations, Tata Consumer Products Ltd Chairman N Chandrasekaran said on Thursday. The Tata group's FMCG arm is well positioned to capitalise on the significant opportunity, he said, while addressing the annual general meeting (AGM) of TCPL. Chandrasekaran said the India economy has been growing \"very strongly\" and the current momentum continues to be high. The baseline forecast for the world economy is to continue to grow over 3 per cent during 2024 and 2025. However, \"India has been growing very strongly with the economic growth rate of 8.2 per cent for the fiscal 2023-2044. Looking at the future, the momentum continues to be high and India should maintain similar growth momentum in the coming years,\" said Chandrasekaran. Notably, India's consumer market represents a \"long-term structural\" opportunity, Chandrasekaran said and noted that this is driven by a young population, a growing middle class, rapid urbanisation, increasing disposable incomes, and raising aspirations. Chandrasekaran also added that the Indian middle class is growing rapidly, which will create opportunities for the company. \"India's middle class is expected to grow from about 30 per cent of the population to 50 per cent by the end of this decade. That is about an additional 300 million people who will be entering the middle class,\" he said. Apart from this, rapid urbanisation, increasing disposable incomes and ever increasing aspirations of consumers, all bode well for Tata Consumer Products Ltd (TCPL), which is well positioned to capitalise on the significant opportunity. Over the latest acquisition of Capital Foods and Organic India by TCPL, Chandrasekaran said, this is to expand the company's addressable market into high-growth, high-margin segments. \"The company has scaled its distribution to reach 4 million retail outlets in India, which represents a two-fold increase since 2020. The company has also focused on innovation and has replaced a 5x growth in innovation revenue since the fiscal year FY21,\" he said. TCPL, new innovations contributes 5 per cent to sales distribution, which is in line with the best metrics in the industry. \"The company's digital transformation agenda has been progressing well,\" he said. On Tata Starbucks, its 50:50 JV with Starbuck, he said it has opened 95 new stores in FY24, setting a record for the highest number of stores opened in a single year since inception. \"The company's international business has been progressing well,\" he said. In FY24, TCPL delivered revenue of Rs 15,206 crores, with a growth of 10 per cent. TCPL was formed in 2020, after merging the consumer products business of Tata Chemicals with Tata Global Beverages. It owns brands as -- Tata Salt, Tata Tea, Tetley, Eight O'Clock Coffee, Good Earth Tea, and Tata Sampann. It also operates coffee chain Tata Starbucks. ","cleaned_content":"indias consumer market represents a long term structural opportunity driven by population a growing middle class rapid urbanisation increasing disposable incomes and raising aspirations tata consumer products ltd chairman n chandrasekaran said on thursday the tata groups fmcg arm is well positioned to capitalise on the significant opportunity he said while addressing the annual general meeting agm of tcpl chandrasekaran said the india economy has been growing very strongly and the current momentum continues to be high the baseline forecast for the world economy is to continue to grow over \u003cTHREE_PERCENT\u003e during \u003cTWO_THOUSAND\u003e and \u003cTWO_THOUSAND\u003e however india has been growing very strongly with the economic growth rate of \u003cEIGHT_PERCENT\u003e for the fiscal \u003cTWO_THOUSAND\u003e \u003cTWO_THOUSAND\u003e looking at the future the momentum continues to be high and india should maintain similar growth momentum in the coming years said chandrasekaran notably indias consumer market represents a long term structural opportunity chandrasekaran said and noted that this is driven by a young population a growing middle class rapid urbanisation increasing disposable incomes and raising aspirations chandrasekaran also added that the indian middle class is growing rapidly which will create opportunities for the company indias middle class is expected to grow from about \u003cTHREE_TEN_PERCENT\u003e of the population to \u003cFIVE_TEN_PERCENT\u003e by the end of this decade that is about an additional \u003cTHREE_HUNDRED\u003e million people who will be entering the middle class he said apart from this rapid urbanisation increasing disposable incomes and ever increasing aspirations of consumers all bode well for tata consumer products ltd tcpl which is well positioned to capitalise on the significant opportunity over the latest acquisition of capital foods and organic india by tcpl chandrasekaran said this is to expand the companys addressable market into high growth high margin segments the company has scaled its distribution to reach \u003cFOUR_\u003e million retail outlets in india which represents a two fold increase since \u003cTWO_THOUSAND\u003e the company has also focused on innovation and has replaced a \u003cFIVE_\u003e x growth in innovation revenue since the fiscal year fy21 he said tcpl new innovations contributes \u003cFIVE_PERCENT\u003e to sales distribution which is in line with the best metrics in the industry the companys digital transformation agenda has been progressing well he said on tata starbucks its \u003cFIVE_TEN\u003e \u003cFIVE_TEN\u003e jv with starbuck he said it has opened \u003cNINE_TEN\u003e new stores in fy24 setting a record for the highest number of stores opened in a single year since inception the companys international business has been progressing well he said in fy24 tcpl delivered revenue of rs \u003cONE_TEN_THOUSAND\u003e crores with a growth of \u003cONE_TEN_PERCENT\u003e tcpl was formed in \u003cTWO_THOUSAND\u003e after merging the consumer products business of tata chemicals with tata global beverages it owns brands as tata salt tata tea tetley eight oclock coffee good earth tea and tata sampann it also operates coffee chain tata starbucks","timestamp":"2024-06-13T12:09:00+05:30","market_timestamp":"2024-06-13T12:09:00+05:30","off_market_hours":false}