{"url":"https://www.moneycontrol.com/news/business/ebikego-plans-to-expand-e-two-wheeler-fleet-to-1-lakh-units-by-fy26-12750867.html","title":"eBikeGo plans to expand e-two-wheeler fleet to 1 lakh units by FY26","description":"The domestic last-mile delivery and e-commerce business is growing at 6.4 per cent as of the first quarter of 2024. As direct-to-consumer delivery becomes the need of the hour and a compulsory asset, the affordability of a fuel two-wheeler at the current price point raises a question.eBikeGo plans to expand e-two-wheeler fleet to 1 lakh units by FY26Related stories","content":"Electric vehicle rental services operator eBikeGo on Tuesday said it plans to expand its e-two-wheeler fleet to 1-lakh units by FY26 amid a rapidly increasing last-mile and e-commerce segment. The domestic last-mile delivery and e-commerce business is growing at 6.4 per cent as of the first quarter of 2024. As direct-to-consumer delivery becomes the need of the hour and a compulsory asset, the affordability of a fuel two-wheeler at the current price point raises a question. \"eBikeGo is poised for substantial growth with plans to increase its fleet of 2-wheeler electric vehicles (EVs) to over 1, 00,000 by the end of next fiscal year. Having established a robust presence in seven metropolitan cities over the past three years, the company now aims to broaden its operations to include tier I and tier II cities across the country,\" the company said in a statement. Hyperlocal delivery models are also penetrating deep into tier II and III cities, as well as rural areas, it added. \"After success in metropolitan cities, we now focus our expertise to expand to tier I and tier II cities,\" said Irfan Khan, founder and CEO of eBikeGo. Set up in 2019, eBikeGo currently manages a fleet of over 3,000 ebikes, catering to businesses such as Zomato, Swiggy and other FMCG brands in major metropolitan cities. ","cleaned_content":"electric vehicle rental services operator ebikego on tuesday said it plans to expand its e two wheeler fleet to \u003cONE_\u003e lakh units by fy26 amid a rapidly increasing last mile and e commerce segment the domestic last mile delivery and e commerce business is growing at \u003cSIX_PERCENT\u003e as of the first quarter of \u003cTWO_THOUSAND\u003e as direct to consumer delivery becomes the need of the hour and a compulsory asset the affordability of a fuel two wheeler at the current price point raises a question ebikego is poised for substantial growth with plans to increase its fleet of \u003cTWO_\u003e wheeler electric vehicles evs to over \u003cONE_\u003e \u003cZERO_\u003e by the end of next fiscal year having established a robust presence in seven metropolitan cities over the past three years the company now aims to broaden its operations to include tier i and tier ii cities across the country the company said in a statement hyperlocal delivery models are also penetrating deep into tier ii and iii cities as well as rural areas it added after success in metropolitan cities we now focus our expertise to expand to tier i and tier ii cities said irfan khan founder and ceo of ebikego set up in \u003cTWO_THOUSAND\u003e ebikego currently manages a fleet of over \u003cTHREE_THOUSAND\u003e ebikes catering to businesses such as zomato swiggy and other fmcg brands in major metropolitan cities","timestamp":"2024-06-18T12:21:00+05:30","market_timestamp":"2024-06-18T12:21:00+05:30","off_market_hours":false}