{"url":"https://www.moneycontrol.com/news/business/hyundai-motor-india-plans-to-launch-4-ev-models-in-future-electric-version-of-creta-by-q4-fy25-12750704.html","title":"Hyundai Motor India plans to launch 4 EV models in future; electric version of Creta by Q4 FY25","description":"The company is looking to maximise the price competitiveness of its electric vehicle (EV) models and intends to focus on securing local production capabilities for key parts, such as cells, battery packs, power electronics, and drivetrain and building a localised EV supply chain.Hyundai Motor India plans to launch 4 EV models in future; electric version of Creta by Q4 FY25Related stories","content":"Hyundai Motor India Ltd plans to launch four electric vehicle models in future, including Creta EV, in the last quarter of the current fiscal, according to the company's preliminary IPO papers filed with Sebi. The company is looking to maximise the price competitiveness of its electric vehicle (EV) models and intends to focus on securing local production capabilities for key parts, such as cells, battery packs, power electronics, and drivetrain and building a localised EV supply chain. In the draft red herring prospectus (DRHP), Hyundai Motor India Ltd (HMIL) said it seeks to calibrate its EV strategy and plan EV timelines in line with market demands in India by launching the appropriate EV models within each price segment. At present, HMIL sells two EV models in India -- IONIQ5 and Kona Electric -- priced around Rs 45 lakh and Rs 24 lakh, respectively. The company further said, \"To maximise price competitiveness of our EV models, we intend to focus on securing local production capabilities for key parts, such as cells, battery packs, power electronics, drivetrain and building a localised EV supply chain\". HMIL has leased a section of the Chennai Manufacturing Plant to Mobis, a Hyundai Motor Company (HMC) group firm, for the assembly of EV batteries, which will be supplied to the company, in turn, reducing import costs for battery packs, it added. \"Further, we intend to localise the EV supply chain through collaboration with both local and global EV power electronic vendors,\" it said, adding recently in 2024, HMC announced a strategic collaboration with Exide Energy Solutions Ltd to facilitate localised battery production and supply in India. Similarly, HMIL said, \"Currently, our company is also exploring different avenues for a strategic collaboration for the production of batteries. We believe the addition of domestically sourced EV models will contribute to diversifying our passenger vehicle offering and further expand our market coverage\". Further, in the near term, the company aims to increase localisation to secure production-linked incentive (PLI) subsidies and transition to a dedicated EV platform to optimise costs, it added. Beyond EV manufacturing, HMIL said, \"We aim to develop the EV infrastructure in India by constructing charging stations. As of March 31, 2024, we have established 11 fast charging stations in India. We intend to support the adoption of EVs by installing charging points across cities and highways in India\". Pointing out threats and challenges to the automotive industry in its DRHP, the company pointed out 'ad-hoc changes in policies' as one of the factors. \"Another challenge that the industry is facing is frequent changes in policies, which makes it difficult for the auto industry stakeholders not only to ensure adherence but also commit investments. Overall policy stability and transparency will be required going forward to ensure smooth technology transition and localisation in the country,\" HMIL said. Further, it also pointed out that there are still concerns about meeting the eligibility criteria and availing of the benefits under the localisation norms. The government is encouraging localisation across sectors, especially in the automotive sector via policies like PLI for automotive technology and advanced cell chemistry, phased manufacturing program, 'Atmanirbhar Bharat' and Make in India, it said. \"While the end goal of localisation is to reduce import dependence, and bring down overall manufacturing costs, it also involves significant initial capital investments from several stakeholders within the automotive industry,\" HMIL said in its preliminary papers. The company further said, \"While the government has designed the schemes to support investments by offering several subsidies and import duty benefits, there are still concerns around meeting the eligibility criteria and availing of the benefits\". Going forward, it said, \"Simplification and better tracking of the policies will ensure localisation in India. The progress of the vendors tied up with individual OEMs would also lead to a change in the risk profile of the industry from a supply-side perspective\". Last week, HMIL filed preliminary papers with Sebi to launch an initial public offering (IPO). The company's IPO, if it goes through, would be the largest in India, surpassing LIC's share sale of Rs 21,000 crore. It proposes to sell 14,21,94,700 equity shares of face value of Rs 10 each, which constitute 17.5 per cent of the post-offer paid-up share capital of the company. ","cleaned_content":"hyundai motor india ltd plans to launch four electric vehicle models in future including creta ev in the last quarter of the current fiscal according to the companys preliminary ipo papers filed with sebi the company is looking to maximise the price competitiveness of its electric vehicle ev models and intends to focus on securing local production capabilities for key parts such as cells battery packs power electronics and drivetrain and building a localised ev supply chain in the draft red herring prospectus drhp hyundai motor india ltd hmil said it seeks to calibrate its ev strategy and plan ev timelines in line with market demands in india by launching the appropriate ev models within each price segment at present hmil sells two ev models in india ioniq5 and kona electric priced around rs \u003cFOUR_TEN\u003e lakh and rs \u003cTWO_TEN\u003e lakh respectively the company further said to maximise price competitiveness of our ev models we intend to focus on securing local production capabilities for key parts such as cells battery packs power electronics drivetrain and building a localised ev supply chain hmil has leased a section of the chennai manufacturing plant to mobis a hyundai motor company hmc group firm for the assembly of ev batteries which will be supplied to the company in turn reducing import costs for battery packs it added further we intend to localise the ev supply chain through collaboration with both local and global ev power electronic vendors it said adding recently in \u003cTWO_THOUSAND\u003e hmc announced a strategic collaboration with exide energy solutions ltd to facilitate localised battery production and supply in india similarly hmil said currently our company is also exploring different avenues for a strategic collaboration for the production of batteries we believe the addition of domestically sourced ev models will contribute to diversifying our passenger vehicle offering and further expand our market coverage further in the near term the company aims to increase localisation to secure production linked incentive pli subsidies and transition to a dedicated ev platform to optimise costs it added beyond ev manufacturing hmil said we aim to develop the ev infrastructure in india by constructing charging stations as of march \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e we have established \u003cONE_TEN\u003e fast charging stations in india we intend to support the adoption of evs by installing charging points across cities and highways in india pointing out threats and challenges to the automotive industry in its drhp the company pointed out ad hoc changes in policies as one of the factors another challenge that the industry is facing is frequent changes in policies which makes it difficult for the auto industry stakeholders not only to ensure adherence but also commit investments overall policy stability and transparency will be required going forward to ensure smooth technology transition and localisation in the country hmil said further it also pointed out that there are still concerns about meeting the eligibility criteria and availing of the benefits under the localisation norms the government is encouraging localisation across sectors especially in the automotive sector via policies like pli for automotive technology and advanced cell chemistry phased manufacturing program atmanirbhar bharat and make in india it said while the end goal of localisation is to reduce import dependence and bring down overall manufacturing costs it also involves significant initial capital investments from several stakeholders within the automotive industry hmil said in its preliminary papers the company further said while the government has designed the schemes to support investments by offering several subsidies and import duty benefits there are still concerns around meeting the eligibility criteria and availing of the benefits going forward it said simplification and better tracking of the policies will ensure localisation in india the progress of the vendors tied up with individual oems would also lead to a change in the risk profile of the industry from a supply side perspective last week hmil filed preliminary papers with sebi to launch an initial public offering ipo the companys ipo if it goes through would be the largest in india surpassing lics share sale of rs \u003cTWO_TEN_THOUSAND\u003e crore it proposes to sell \u003cONE_HUNDRED_MILLION\u003e equity shares of face value of rs \u003cONE_TEN\u003e each which constitute \u003cONE_TEN_PERCENT\u003e of the post offer paid up share capital of the company","timestamp":"2024-06-18T10:55:00+05:30","market_timestamp":"2024-06-18T10:55:00+05:30","off_market_hours":false}