{"url":"https://www.moneycontrol.com/news/business/jk-tyre-partners-with-eka-mobility-to-provide-comprehensive-tyre-management-12744930.html","title":"JK Tyre partners with EKA Mobility to provide comprehensive tyre management","description":"Under the partnership, JK Tyre will provide its new generation of electric vehicle tyres with 'connected treel sensors' for real-time monitoring to EKA's fleet thus offering comprehensive tyre management through its mobility solutions programme.L-R-Vijay Yelne, President, SCM \u0026 Export Business Development, Eka mobility, Sanjeev Sharma, AVP, Fleet Management\u0026 Mobility, JK Tyre and Anil Baliga, President, Operations, Eka MobilityRelated stories","content":"JK Tyre \u0026 Industries on Monday said it has partnered with electric mobility player EKA Mobility to provide comprehensive tyre management. Under the partnership, JK Tyre will provide its new generation of electric vehicle tyres with 'connected treel sensors' for real-time monitoring to EKA's fleet thus offering comprehensive tyre management through its mobility solutions programme. Beginning with the currently deployed fleet in Mumbai, the company will offer comprehensive support to EKA's fleet across all cities, JK Tyre \u0026 Industries said in a statement. The company said the collaboration aims to revolutionise the EV landscape with the development and production of new generation EV tyres, specifically engineered to meet the unique demands of EVs. \"This strategic partnership with JK Tyre is a significant step towards our vision of creating an ecosystem for environment-conscious mobility... Our combined expertise will pave the way for innovative solutions that not only enhance the performance of EVs but also contribute to a greener and more sustainable future,\" EKA Mobility President Vijaykumar Yelne said. ","cleaned_content":"jk tyre industries on monday said it has partnered with electric mobility player eka mobility to provide comprehensive tyre management under the partnership jk tyre will provide its new generation of electric vehicle tyres with connected treel sensors for real time monitoring to ekas fleet thus offering comprehensive tyre management through its mobility solutions programme beginning with the currently deployed fleet in mumbai the company will offer comprehensive support to ekas fleet across all cities jk tyre industries said in a statement the company said the collaboration aims to revolutionise the ev landscape with the development and production of new generation ev tyres specifically engineered to meet the unique demands of evs this strategic partnership with jk tyre is a significant step towards our vision of creating an ecosystem for environment conscious mobility our combined expertise will pave the way for innovative solutions that not only enhance the performance of evs but also contribute to a greener and more sustainable future eka mobility president vijaykumar yelne said","timestamp":"2024-06-10T13:57:00+05:30","market_timestamp":"2024-06-10T13:57:00+05:30","off_market_hours":false}