{"url":"https://www.moneycontrol.com/news/business/adani-group-to-invest-100-billion-in-energy-transition-gautam-adani-12751806.html","title":"Adani Group to invest $100 billion in energy transition: Gautam Adani","description":"Besides building solar parks to produce electricity from sunlight and wind farms that do the same from wind, the conglomerate is building major facilities to manufacture electrolyzers for making green hydrogen, wind power turbines and solar panels.Adani Group to invest $100 billion in energy transition: Gautam AdaniRelated stories","content":"Adani group will invest more than USD 100 billion (around Rs 835 crore) in energy transition projects and manufacturing capability to produce every major component required for green energy generation, its chairman said on Wednesday. Besides building solar parks to produce electricity from sunlight and wind farms that do the same from wind, the conglomerate is building major facilities to manufacture electrolyzers for making green hydrogen, wind power turbines and solar panels. Green hydrogen, which is made by splitting hydrogen from water with the help of electrolyzers powered by clean energy, is seen as a potential panacea for decarbonizing the industry as well as transportation. \"The next decade will see us invest more than USD 100 billion in the energy transition space and further expand our integrated renewable energy value chain that today already spans the manufacturing of every major component required for green energy generation,\" he said. The coal-to-ports group wants to produce the \"world's least expensive green electron\" that will become the feedstock for several sectors that must meet the sustainability mandate. \"And to make this happen, we are already building the world's largest single-site renewable energy park in Khavda, in the district of Kutch (in Gujarat). Just this single location will generate 30 GW of power, thereby taking our total renewable energy capacity to 50 GW by 2030,\" he said. Adani said the energy transition space will fundamentally change the global energy landscape forever. \"The global transition market was valued at approximately USD 3 trillion in 2023 and is expected to grow to nearly USD 6 trillion by 2030, and thereafter double every 10 years till 2050.\" \"As many of you know, in the case of India, our country aims to install 500 gigawatts of renewable energy capacity by 2030. This ambitious target will require annual investments of over USD 150 billion dollars. The transition to green energy in India is expected to generate millions of new jobs in sectors such as solar and wind, energy storage, hydrogen and its derivatives, EV charging stations, as well as grid infrastructure development,\" he said. On digital infrastructure, he said data is indeed the new oil and at the heart of all the action is the Data Centre - the critical infrastructure needed to power all forms of computational needs, especially AI workloads for machine learning algorithms, natural language processing, computer vision, and deep learning. All of this is dependent on the ability to process data at an unprecedented speed and scale which are the precise capabilities that data centres provide. However, this will need massive amounts of energy, making the data centre business the largest energy consuming industry in the world, he said. \"This makes the energy transition even more complex and is raising electricity prices, thereby adding to the already high prices because of the combined impact of climate change and demand growth,\" Adani said. The billionaire said the infrastructure required for energy transition and the infrastructure required for digital transformation are now inseparable as the technology sector becomes the largest consumer of the precious green electrons. Adani group's digital footprint will span industrial clouds across each of its businesses that it will productize and then take to market, operational technology cybersecurity offerings, super apps to leverage its B2C businesses across wide variety of consumer facing businesses, Artificial Intelligence labs to capitalize on India's fast emerging expertise to provide AI services to the world, and Data Centres that will form the backbone of the energy intensive digital revolution. \"In fact, it is anticipated that by the year 2030, the world will need 100 to 150 GW of additional green energy just for the AI data centres. We already have India's largest order book for data centres and are now in discussions for additional gigawatt-scale green AI data centres which we are uniquely positioned to deliver,\" he said. ","cleaned_content":"adani group will invest more than usd \u003cONE_HUNDRED\u003e billion around rs \u003cEIGHT_HUNDRED\u003e crore in energy transition projects and manufacturing capability to produce every major component required for green energy generation its chairman said on wednesday besides building solar parks to produce electricity from sunlight and wind farms that do the same from wind the conglomerate is building major facilities to manufacture electrolyzers for making green hydrogen wind power turbines and solar panels green hydrogen which is made by splitting hydrogen from water with the help of electrolyzers powered by clean energy is seen as a potential panacea for decarbonizing the industry as well as transportation the next decade will see us invest more than usd \u003cONE_HUNDRED\u003e billion in the energy transition space and further expand our integrated renewable energy value chain that today already spans the manufacturing of every major component required for green energy generation he said the coal to ports group wants to produce the worlds least expensive green electron that will become the feedstock for several sectors that must meet the sustainability mandate and to make this happen we are already building the worlds largest single site renewable energy park in khavda in the district of kutch in gujarat just this single location will generate \u003cTHREE_TEN\u003e gw of power thereby taking our total renewable energy capacity to \u003cFIVE_TEN\u003e gw by \u003cTWO_THOUSAND\u003e he said adani said the energy transition space will fundamentally change the global energy landscape forever the global transition market was valued at approximately usd \u003cTHREE_\u003e trillion in \u003cTWO_THOUSAND\u003e and is expected to grow to nearly usd \u003cSIX_\u003e trillion by \u003cTWO_THOUSAND\u003e and thereafter double every \u003cONE_TEN\u003e years till \u003cTWO_THOUSAND\u003e as many of you know in the case of india our country aims to install \u003cFIVE_HUNDRED\u003e gigawatts of renewable energy capacity by \u003cTWO_THOUSAND\u003e this ambitious target will require annual investments of over usd \u003cONE_HUNDRED\u003e billion dollars the transition to green energy in india is expected to generate millions of new jobs in sectors such as solar and wind energy storage hydrogen and its derivatives ev charging stations as well as grid infrastructure development he said on digital infrastructure he said data is indeed the new oil and at the heart of all the action is the data centre the critical infrastructure needed to power all forms of computational needs especially ai workloads for machine learning algorithms natural language processing computer vision and deep learning all of this is dependent on the ability to process data at an unprecedented speed and scale which are the precise capabilities that data centres provide however this will need massive amounts of energy making the data centre business the largest energy consuming industry in the world he said this makes the energy transition even more complex and is raising electricity prices thereby adding to the already high prices because of the combined impact of climate change and demand growth adani said the billionaire said the infrastructure required for energy transition and the infrastructure required for digital transformation are now inseparable as the technology sector becomes the largest consumer of the precious green electrons adani groups digital footprint will span industrial clouds across each of its businesses that it will productize and then take to market operational technology cybersecurity offerings super apps to leverage its b2c businesses across wide variety of consumer facing businesses artificial intelligence labs to capitalize on indias fast emerging expertise to provide ai services to the world and data centres that will form the backbone of the energy intensive digital revolution in fact it is anticipated that by the year \u003cTWO_THOUSAND\u003e the world will need \u003cONE_HUNDRED\u003e to \u003cONE_HUNDRED\u003e gw of additional green energy just for the ai data centres we already have indias largest order book for data centres and are now in discussions for additional gigawatt scale green ai data centres which we are uniquely positioned to deliver he said","timestamp":"2024-06-19T12:51:00+05:30","market_timestamp":"2024-06-19T12:51:00+05:30","off_market_hours":false}