{"url":"https://www.moneycontrol.com/news/business/jakson-green-wins-ntpc-order-for-setting-up-project-to-produce-4g-ethanol-from-flue-gas-12751864.html","title":"Jakson Green wins NTPC order for setting up project to produce 4G ethanol from flue gas","description":"The proposed plant at Lara in Chhattisgarh will produce 10 tonnes per day (TPD) of 4G ethanol from flue gases emitted from power plants, a company statement said.Jakson Green wins NTPC order for setting up project to produce 4G ethanol from flue gasRelated stories","content":"New energy transition platform Jakson Green on Wednesday said it has bagged an order from state-owned NTPC for setting up a plant to produce 4G ethanol from flue gas. The proposed plant at Lara in Chhattisgarh will produce 10 tonnes per day (TPD) of 4G ethanol from flue gases emitted from power plants, a company statement said. Using the latest carbon capture technology by Veolia Carbon Clean, the plant will capture 25 TPD CO2 from flue gases, significantly reducing greenhouse gas emissions, it said. Captured carbon dioxide (CO2) and generated hydrogen (H2) are combined via advanced microbial fermentation technology from LanzaTech Inc., converting these inputs into 4G ethanol, it explained According to the statement, Jakson Green has been awarded a critical role in India's groundbreaking project towards a greener future, establishing the world's first flue gas CO2-to-4G ethanol project for a power plant. As the licensing, engineering, procurement, and construction (LEPC) partner, Jakson Green will spearhead this project which is expected to begin operations within two years. The plant has been conceptualized and designed by NETRA (NTPC Energy Technology Research Alliance), the research and development arm of NTPC Ltd. Kannan Krishnan, Joint Managing Director of Jakson Green Private Limited, said in the statement, \"This partnership builds upon the success of our numerous joint projects... Increasing the production of ethanol is crucial to achieving India's blending goals, strengthening energy security, and fostering a cleaner future.\" Having the production capacity of over 8,500 tonnes per annum of green hydrogen and its derivatives under development across six projects, Jakson Green is uniquely positioned to spearhead India's clean energy transition and contribute to a sustainable future, it said. ","cleaned_content":"new energy transition platform jakson green on wednesday said it has bagged an order from state owned ntpc for setting up a plant to produce \u003cFOUR_\u003e g ethanol from flue gas the proposed plant at lara in chhattisgarh will produce \u003cONE_TEN\u003e tonnes per day tpd of \u003cFOUR_\u003e g ethanol from flue gases emitted from power plants a company statement said using the latest carbon capture technology by veolia carbon clean the plant will capture \u003cTWO_TEN\u003e tpd co2 from flue gases significantly reducing greenhouse gas emissions it said captured carbon dioxide co2 and generated hydrogen h2 are combined via advanced microbial fermentation technology from lanzatech inc converting these inputs into \u003cFOUR_\u003e g ethanol it explained according to the statement jakson green has been awarded a critical role in indias groundbreaking project towards a greener future establishing the worlds first flue gas co2 to \u003cFOUR_\u003e g ethanol project for a power plant as the licensing engineering procurement and construction lepc partner jakson green will spearhead this project which is expected to begin operations within two years the plant has been conceptualized and designed by netra ntpc energy technology research alliance the research and development arm of ntpc ltd kannan krishnan joint managing director of jakson green private limited said in the statement this partnership builds upon the success of our numerous joint projects increasing the production of ethanol is crucial to achieving indias blending goals strengthening energy security and fostering a cleaner future having the production capacity of over \u003cEIGHT_THOUSAND\u003e tonnes per annum of green hydrogen and its derivatives under development across six projects jakson green is uniquely positioned to spearhead indias clean energy transition and contribute to a sustainable future it said","timestamp":"2024-06-19T13:43:00+05:30","market_timestamp":"2024-06-19T13:43:00+05:30","off_market_hours":false}