{"url":"https://www.moneycontrol.com/news/business/uber-green-electric-cabs-launched-in-kolkata-12752808.html","title":"Uber Green electric cabs launched in Kolkata","description":"Uber Green electric cabs launched in Kolkata","content":"Uber on Thursday announced the launch of its flagship electric vehicle service, Uber Green, in Kolkata, marking a step towards eco-friendly urban transportation. Uber becomes the second ride-hailing service provider to offer electric vehicles in the city, following Snap E, another brand operating with an all-EV fleet. \"Enhancing the air quality in Kolkata is a shared duty we all must embrace. I commend Uber for introducing 'Uber Green' in Kolkata, a significant step towards reducing carbon emissions in our city,\" West Bengal Transport Minister Snehasis Chakraborty said. The company did not disclose details on the number of vehicles under Uber Green or its expansion plans for the city. The company has committed to becoming a zero-emissions mobility platform by 2030 in Europe and North America, and globally by 2040. EV drivers on Uber are going electric five times faster than the general public, the company stated. ","cleaned_content":"uber on thursday announced the launch of its flagship electric vehicle service uber green in kolkata marking a step towards eco friendly urban transportation uber becomes the second ride hailing service provider to offer electric vehicles in the city following snap e another brand operating with an all ev fleet enhancing the air quality in kolkata is a shared duty we all must embrace i commend uber for introducing uber green in kolkata a significant step towards reducing carbon emissions in our city west bengal transport minister snehasis chakraborty said the company did not disclose details on the number of vehicles under uber green or its expansion plans for the city the company has committed to becoming a zero emissions mobility platform by \u003cTWO_THOUSAND\u003e in europe and north america and globally by \u003cTWO_THOUSAND\u003e ev drivers on uber are going electric five times faster than the general public the company stated","timestamp":"2024-06-20T14:21:00+05:30","market_timestamp":"2024-06-20T14:21:00+05:30","off_market_hours":false}