{"url":"https://www.moneycontrol.com/news/business/euronics-looking-to-double-turnover-to-rs-400-crore-by-2025-26-md-ceo-viknesh-jain-12755673.html","title":"Euronics looking to double turnover to Rs 400 crore by 2025-26: MD \u0026 CEO Viknesh Jain","description":"The company has invested Rs 100 crore to set up the washroom automation accessories production unit at Gurugram with an annual production capacity of 2 lakh units and it will become operational this month.Euronics looking to double turnover to Rs 400 crore by 2025-26: MD \u0026 CEO Viknesh JainRelated stories","content":"Public washroom automation firm Euronics is looking to double its turnover to Rs 400 crore by 2025-26 with its new manufacturing plant at Gurugram set to become operational to fulfil 50 per cent of its orders. The company has invested Rs 100 crore to set up the washroom automation accessories production unit at Gurugram with an annual production capacity of 2 lakh units and it will become operational this month. \"In the last financial year we were around Rs 200 crore... This year we are looking at close to Rs 280 crore to Rs 290 crore and in FY25-26 we are chasing Rs 400 crore turnover,\" Euronics MD \u0026 CEO Viknesh Jain told PTI. Established in 2002, Euronics is a major player in India's public and commercial washroom sector, he said, with growth fuelled by the expansive growth of the country's public infrastructure, commercial real estate, and retail sectors. While initially it catered mainly to the private sector, including several Fortune 500 companies, Jain said in the past six to seven years it has started getting a lot of government projects. Euronics had recently undertaken washroom automation for Ram Mandir in Ayodhya; Yashobhoomi (India International Convention \u0026 Expo Center), New Parliament Building, airports across Ayodhya, Mumbai, Delhi, Goa, and Bangalore among other cities, and other smart city projects in India, Jain added. With the new plant coming in, the company said it will be able to fulfill 50 per cent of its average order volumes from the Gurugram unit alone. The unit will create around 200 blue-collar jobs. \"When we started it was more like contract manufacturing but right now around 50-60 per cent of the products which are sold by us are produced by us. The idea is to increase it to 80 per cent by the next year-end,\" Jain said. Currently, Euronics has other plants in Jamnagar, Greater Noida, and Bhiwadi. Bullish on India's public infrastructure sector, he said Euronics is set to meet its washroom automation needs with 100 per cent domestically manufactured accessories within the next three years. ","cleaned_content":"public washroom automation firm euronics is looking to double its turnover to rs \u003cFOUR_HUNDRED\u003e crore by \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e with its new manufacturing plant at gurugram set to become operational to fulfil \u003cFIVE_TEN_PERCENT\u003e of its orders the company has invested rs \u003cONE_HUNDRED\u003e crore to set up the washroom automation accessories production unit at gurugram with an annual production capacity of \u003cTWO_\u003e lakh units and it will become operational this month in the last financial year we were around rs \u003cTWO_HUNDRED\u003e crore this year we are looking at close to rs \u003cTWO_HUNDRED\u003e crore to rs \u003cTWO_HUNDRED\u003e crore and in fy25 \u003cTWO_TEN\u003e we are chasing rs \u003cFOUR_HUNDRED\u003e crore turnover euronics md ceo viknesh jain told pti established in \u003cTWO_THOUSAND\u003e euronics is a major player in indias public and commercial washroom sector he said with growth fuelled by the expansive growth of the countrys public infrastructure commercial real estate and retail sectors while initially it catered mainly to the private sector including several fortune \u003cFIVE_HUNDRED\u003e companies jain said in the past six to seven years it has started getting a lot of government projects euronics had recently undertaken washroom automation for ram mandir in ayodhya yashobhoomi india international convention expo center new parliament building airports across ayodhya mumbai delhi goa and bangalore among other cities and other smart city projects in india jain added with the new plant coming in the company said it will be able to fulfill \u003cFIVE_TEN_PERCENT\u003e of its average order volumes from the gurugram unit alone the unit will create around \u003cTWO_HUNDRED\u003e blue collar jobs when we started it was more like contract manufacturing but right now around \u003cFIVE_TEN\u003e \u003cSIX_TEN_PERCENT\u003e of the products which are sold by us are produced by us the idea is to increase it to \u003cEIGHT_TEN_PERCENT\u003e by the next year end jain said currently euronics has other plants in jamnagar greater noida and bhiwadi bullish on indias public infrastructure sector he said euronics is set to meet its washroom automation needs with \u003cONE_HUNDRED_PERCENT\u003e domestically manufactured accessories within the next three years","timestamp":"2024-06-25T11:31:00+05:30","market_timestamp":"2024-06-25T11:31:00+05:30","off_market_hours":false}