{"url":"https://www.moneycontrol.com/news/business/markets/mc-inside-edge-fo-continues-to-be-a-bigger-draw-for-youngsters-a-concentrated-bet-on-defence-silence-of-the-mfs-12761278.html","title":"MC Inside Edge: F\u0026O continues to be a bigger draw for youngsters, a concentrated bet on defence, silence of the MFs","description":"Know what stocks veteran bulls are eyeing, what the bears are ganging up against, major deals and all the inner goings-on from Dalal StreetKnow about all the major deals and all the inner goings-on from Dalal Street. Related stories","content":"The regulator may be trying hard to clamp down on derivatives trading, but it can do little to curb the enthusiasm of youngsters, many of whom still feel that it is easy route to riches. Last week, a Mumbai-based financial services firm known for its value investing credo had held an investor camp in Chennai. The idea was to preach the gospel of equity investing and the rewards it promised to true believers. The turnout was impressive, but most of the questions that were asked of the speakers after their presentations were related to options trading. Thanks to SEBI’s relentless efforts, it is now widely known that nine out of ten retail traders lose money in derivatives trading. Yet, every newcomer seems to be hopeful, or maybe overconfident, that he or she will be in that tenth who wins.  Chink in the armour Compliance concerns The regulator as well as asset management companies have been working towards creating an internal mechanism for compliance, without having to face constant scrutiny from SEBI. But some fund houses are concerned that with the latest development of SEBI's raid on a high profile mutual fund, these plans may hit a roadblock. Currently, most fund houses are maintaining a shall not speak policy on the issue with the AMC in news. Is it a case of true industry solidarity or concerns that they could be the next to face regulatory scrutiny? ","cleaned_content":"the regulator may be trying hard to clamp down on derivatives trading but it can do little to curb the enthusiasm of youngsters many of whom still feel that it is easy route to riches last week a mumbai based financial services firm known for its value investing credo had held an investor camp in chennai the idea was to preach the gospel of equity investing and the rewards it promised to true believers the turnout was impressive but most of the questions that were asked of the speakers after their presentations were related to options trading thanks to sebi s relentless efforts it is now widely known that nine out of ten retail traders lose money in derivatives trading yet every newcomer seems to be hopeful or maybe overconfident that he or she will be in that tenth who wins chink in the armour compliance concerns the regulator as well as asset management companies have been working towards creating an internal mechanism for compliance without having to face constant scrutiny from sebi but some fund houses are concerned that with the latest development of sebis raid on a high profile mutual fund these plans may hit a roadblock currently most fund houses are maintaining a shall not speak policy on the issue with the amc in news is it a case of true industry solidarity or concerns that they could be the next to face regulatory scrutiny","timestamp":"2024-07-03T12:03:00+05:30","market_timestamp":"2024-07-03T12:03:00+05:30","off_market_hours":false}