{"url":"https://www.moneycontrol.com/news/business/jpmorgan-india-bank-ceo-prabdev-singh-quits-before-end-of-term-12754698.html","title":"JPMorgan India bank CEO Prabdev Singh quits before end of term","description":"“Pranav Chawda, head of commercial banking for India, will expand his current responsibilities to become the head of India Corporate Banking and can confirm that PD Singh is ​leaving the firm,” a JPMorgan representative said by email in response to queries from Bloomberg News. JPMorgan India bank CEO Prabdev Singh quits before end of term","content":"Prabdev Singh, chief executive officer of JPMorgan Chase \u0026 Co.’s bank in India, has stepped down before the end of his term. “Pranav Chawda, head of commercial banking for India, will expand his current responsibilities to become the head of India Corporate Banking and can confirm that PD Singh is ​leaving the firm,” a JPMorgan representative said by email in response to queries from Bloomberg News. Singh, popularly known as PD, had received regulatory approval in January 2023 for a three-year term as CEO of JPMorgan Chase Bank India. He had replaced Madhav Kalyan who — in October 2022 — was named head of payments for Asia Pacific. Singh, a trained engineer, had worked for a decade at HSBC Holdings Plc before joining JPMorgan in 2010, according to his Linkedin profile. ","cleaned_content":"prabdev singh chief executive officer of jpmorgan chase co s bank in india has stepped down before the end of his term pranav chawda head of commercial banking for india will expand his current responsibilities to become the head of india corporate banking and can confirm that pd singh is leaving the firm a jpmorgan representative said by email in response to queries from bloomberg news singh popularly known as pd had received regulatory approval in january \u003cTWO_THOUSAND\u003e for a three year term as ceo of jpmorgan chase bank india he had replaced madhav kalyan who in october \u003cTWO_THOUSAND\u003e was named head of payments for asia pacific singh a trained engineer had worked for a decade at hsbc holdings plc before joining jpmorgan in \u003cTWO_THOUSAND\u003e according to his linkedin profile","timestamp":"2024-06-24T08:39:00+05:30","market_timestamp":"2024-06-24T09:15:00+05:30","off_market_hours":true}