{"url":"https://www.moneycontrol.com/news/business/sony-pictures-networks-india-appoints-gaurav-banerjee-as-new-md-ceo-12754889.html","title":"Sony Pictures Networks India appoints Gaurav Banerjee as new MD \u0026 CEO","description":"Gaurav Banerjee will succeed NP Singh, who will move into the role of Non-Executive Chairman after a 25-year tenure, Sony Pictures Networks India (SPNI) said in a statement.Sony Pictures Networks India appoints Gaurav Banerjee as new MD \u0026 CEORelated stories","content":"Sony Pictures Networks India on Monday announced the appointment of former Disney executive Gaurav Banerjee as its Managing Director and CEO, effective on or before August 26, pending regulatory approvals. Banerjee will succeed NP Singh, who will move into the role of Non-Executive Chairman after a 25-year tenure, Sony Pictures Networks India (SPNI) said in a statement. Singh will move into the new role only after Banerjee takes charge, to support the transition through the end of the fiscal year. Banerjee previously held the positions of Head of Content for Hindi Entertainment \u0026 Disney+ Hotstar and Business Head for Star Bharat, Hindi \u0026 English Movies, Kids \u0026 Infotainment, and Regional (East), the statement said. He started career in media as an assistant producer and anchor at Aaj Tak and later moved to Star News, where he started producing and anchoring prime time news shows. Banerjee has a master's degree in filmmaking and TV production from Jamia Millia Islamia University and an undergraduate in history from St. Stephens, Delhi, the company said. Banerjee's appointment follows Singh's decision to move on, which was announced last month. Singh had said that after nearly 44 years in his career, he is \"ready to focus on social change and shift from operational roles to advisory ones\". The Japanese parent of SPNI, had pushed for Singh to lead the merged entity proposed to be formed after amalgamation with India's Zee Entertainment Enterprises Ltd (ZEEL) before calling off the USD 10 billion deal in January this year. The deal announced more than two years back, collapsed following a stalemate over who will lead the merged entity and also due failure to meet closing conditions by ZEEL despite a month's extension of deadline. ","cleaned_content":"sony pictures networks india on monday announced the appointment of former disney executive gaurav banerjee as its managing director and ceo effective on or before august \u003cTWO_TEN\u003e pending regulatory approvals banerjee will succeed np singh who will move into the role of non executive chairman after a \u003cTWO_TEN\u003e year tenure sony pictures networks india spni said in a statement singh will move into the new role only after banerjee takes charge to support the transition through the end of the fiscal year banerjee previously held the positions of head of content for hindi entertainment disney hotstar and business head for star bharat hindi english movies kids infotainment and regional east the statement said he started career in media as an assistant producer and anchor at aaj tak and later moved to star news where he started producing and anchoring prime time news shows banerjee has a masters degree in filmmaking and tv production from jamia millia islamia university and an undergraduate in history from st stephens delhi the company said banerjees appointment follows singhs decision to move on which was announced last month singh had said that after nearly \u003cFOUR_TEN\u003e years in his career he is ready to focus on social change and shift from operational roles to advisory ones the japanese parent of spni had pushed for singh to lead the merged entity proposed to be formed after amalgamation with indias zee entertainment enterprises ltd zeel before calling off the usd \u003cONE_TEN\u003e billion deal in january this year the deal announced more than two years back collapsed following a stalemate over who will lead the merged entity and also due failure to meet closing conditions by zeel despite a months extension of deadline","timestamp":"2024-06-24T11:58:00+05:30","market_timestamp":"2024-06-24T11:58:00+05:30","off_market_hours":false}