{"url":"https://www.moneycontrol.com/technology/karnataka-it-minister-priyank-kharge-alleges-pm-modi-pressuring-companies-to-invest-in-gujarat-article-12756041.html","title":"Karnataka IT minister Priyank Kharge alleges PM Modi pressuring companies to invest in Gujarat","description":"Priyank Kharge said he will meet Union Finance Minister Nirmala Sitharaman on June 27 to seek similar incentives for companies interested in investing in Karnataka, similar to those offered in Gujarat.A delegation from the Karnataka Department of Electronics, IT, and BT recently visited the US, UK, France, and Germany to attract investments, showcase startups, and promote international technology and innovation collaboration.Related stories","content":"Karnataka IT-BT Minister Priyank Kharge alleged on June 25 that Prime Minister Narendra Modi is pressuring companies to invest in Gujarat by blocking investments intended for Karnataka. Speaking to reporters at Vikasa Soudha in Bengaluru, Kharge said he knows which companies they are, but did not reveal their names. \"We are making every effort to attract investors to Karnataka, but the PM himself is calling and pressuring them to invest in Gujarat and Uttar Pradesh. There are also instances of pressure on those who intend to invest in Telangana. We will disclose everything in the future,\" he said. His comments come against the backdrop of Union Minister for Heavy Industries and Steel HD Kumaraswamy questioning subsidies offered for US-based microchip manufacturer Micron Technology to set up a chip assembly facility in Gujarat. Kumaraswamy later claimed he was 'misquoted' in the media. Karnataka Minister for Large and Medium Industries MB Patil had also accused the Union government of favoring Gujarat, the Prime Minister's home state. Kharge said he will meet Union Finance Minister Nirmala Sitharaman on June 27 to seek similar incentives for companies interested in investing in Karnataka, similar to those offered in Gujarat. He said there is a huge demand for human resources in Karnataka, adding, \"We are not competing with other states in India but with China, Vietnam, and others.\" Potential investments worth $6.2 billion from recent foreign visits A delegation from the Karnataka Department of Electronics, IT, and BT recently visited the US, UK, France, and Germany to attract investments, showcase startups, and promote international technology and innovation collaboration. Sharath Bachegowda, Chairman of Karnataka State Electronics Development Corporation Ltd, who was part of the delegation, said there are potential investments worth $6.2 billion from these recent foreign visits but did not disclose the conversion rate or employment generation resulting from these promises. The delegation met with Stanford Biodesign representatives interested in expanding their Founders’ Forum initiative to Bengaluru. \"They will soon sign an MoU with the Karnataka government to collaborate on Stanford Biodesign’s Med-Tech startup mentorship and accelerator program. “Detailed proposals and budgets were reviewed, with plans for the Stanford Biodesign team to visit Karnataka in July to advance discussions,” said Ekroop Caur, secretary, IT-BT department. Bachegowda said the delegation conducted a series of meetings during the visit. On June 5, they engaged with Applied Materials, Jabil, and Bloom Energy in the US, focusing on semiconductor manufacturing in Karnataka. The delegation also held discussions with Ambient Photonics Inc. and Microchip Technology Inc. highlighting academic partnerships and potential collaborations with Karnataka’s Centers of Excellence. Additionally, meetings with Arm Holdings explored expanding operations and strategic support in Beyond Bengaluru clusters. In the UK, discussions at the Microsoft Technology Centre covered AI frameworks, quantum technology, and digital transformations. At London Tech Week, talks with Startup Genome centered on the 2024 Global Startup Ecosystem Report and collaborations under the Hyper Growth Acceleration programme, aimed at supporting 100 startups in Enterprise Tech, SaaS, and Fintech with funding from private players and collaboration with 87 Venture Capitalists. ","cleaned_content":"karnataka it bt minister priyank kharge alleged on june \u003cTWO_TEN\u003e that prime minister narendra modi is pressuring companies to invest in gujarat by blocking investments intended for karnataka speaking to reporters at vikasa soudha in bengaluru kharge said he knows which companies they are but did not reveal their names we are making every effort to attract investors to karnataka but the pm himself is calling and pressuring them to invest in gujarat and uttar pradesh there are also instances of pressure on those who intend to invest in telangana we will disclose everything in the future he said his comments come against the backdrop of union minister for heavy industries and steel hd kumaraswamy questioning subsidies offered for us based microchip manufacturer micron technology to set up a chip assembly facility in gujarat kumaraswamy later claimed he was misquoted in the media karnataka minister for large and medium industries mb patil had also accused the union government of favoring gujarat the prime ministers home state kharge said he will meet union finance minister nirmala sitharaman on june \u003cTWO_TEN\u003e to seek similar incentives for companies interested in investing in karnataka similar to those offered in gujarat he said there is a huge demand for human resources in karnataka adding we are not competing with other states in india but with china vietnam and others potential investments worth \u003cSIX_\u003e billion from recent foreign visits a delegation from the karnataka department of electronics it and bt recently visited the us uk france and germany to attract investments showcase startups and promote international technology and innovation collaboration sharath bachegowda chairman of karnataka state electronics development corporation ltd who was part of the delegation said there are potential investments worth \u003cSIX_\u003e billion from these recent foreign visits but did not disclose the conversion rate or employment generation resulting from these promises the delegation met with stanford biodesign representatives interested in expanding their founders forum initiative to bengaluru they will soon sign an mou with the karnataka government to collaborate on stanford biodesign s med tech startup mentorship and accelerator program detailed proposals and budgets were reviewed with plans for the stanford biodesign team to visit karnataka in july to advance discussions said ekroop caur secretary it bt department bachegowda said the delegation conducted a series of meetings during the visit on june \u003cFIVE_\u003e they engaged with applied materials jabil and bloom energy in the us focusing on semiconductor manufacturing in karnataka the delegation also held discussions with ambient photonics inc and microchip technology inc highlighting academic partnerships and potential collaborations with karnataka s centers of excellence additionally meetings with arm holdings explored expanding operations and strategic support in beyond bengaluru clusters in the uk discussions at the microsoft technology centre covered ai frameworks quantum technology and digital transformations at london tech week talks with startup genome centered on the \u003cTWO_THOUSAND\u003e global startup ecosystem report and collaborations under the hyper growth acceleration programme aimed at supporting \u003cONE_HUNDRED\u003e startups in enterprise tech saas and fintech with funding from private players and collaboration with \u003cEIGHT_TEN\u003e venture capitalists","timestamp":"2024-06-25T18:18:00+05:30","market_timestamp":"2024-06-26T09:15:00+05:30","off_market_hours":true}