{"url":"https://www.moneycontrol.com/news/business/bpcl-sees-nearly-flat-annual-crude-processing-executive-says-12757277.html","title":"BPCL sees nearly flat annual crude processing, executive says","description":"BPCL, the country's third-largest oil refiner, plans to shut its 120,000 barrels per day (bpd) crude unit and some secondary units at the 310,000 bpd Kochi refinery in southern India from mid-September, said Sanjay Khanna, the company's head of refineries, at an industry event.BPCL sees nearly flat annual crude processing, executive says","content":"India's state-run Bharat Petroleum Corp does not see any major change in its annual crude processing this fiscal year, as it plans to shut a crude unit at its biggest refinery for a month for maintenance, an executive said on Thursday. BPCL, the country's third-largest oil refiner, plans to shut its 120,000 barrels per day (bpd) crude unit and some secondary units at the 310,000 bpd Kochi refinery in southern India from mid-September, said Sanjay Khanna, the company's head of refineries, at an industry event. In the last fiscal year ended March 31, BPCL processed nearly 800,000 bpd of crude at its three refineries that have a combined nameplate capacity of 708,000 bpd, he said. He added that BPCL aims to complete an expansion at its Bina refinery in central India to 220,000 bpd from the current 156,000 bpd by mid-2027. The company hopes to build a 1.2 million ton per year (tpy) petrochemical plant at the Bina refinery by mid-2028, he said, adding the plant would have provision to be expanded to 1.5 million tpy. ","cleaned_content":"indias state run bharat petroleum corp does not see any major change in its annual crude processing this fiscal year as it plans to shut a crude unit at its biggest refinery for a month for maintenance an executive said on thursday bpcl the countrys third largest oil refiner plans to shut its \u003cONE_HUNDRED_THOUSAND\u003e barrels per day bpd crude unit and some secondary units at the \u003cTHREE_HUNDRED_THOUSAND\u003e bpd kochi refinery in southern india from mid september said sanjay khanna the companys head of refineries at an industry event in the last fiscal year ended march \u003cTHREE_TEN\u003e bpcl processed nearly \u003cEIGHT_HUNDRED_THOUSAND\u003e bpd of crude at its three refineries that have a combined nameplate capacity of \u003cSEVEN_HUNDRED_THOUSAND\u003e bpd he said he added that bpcl aims to complete an expansion at its bina refinery in central india to \u003cTWO_HUNDRED_THOUSAND\u003e bpd from the current \u003cONE_HUNDRED_THOUSAND\u003e bpd by mid \u003cTWO_THOUSAND\u003e the company hopes to build a \u003cONE_\u003e million ton per year tpy petrochemical plant at the bina refinery by mid \u003cTWO_THOUSAND\u003e he said adding the plant would have provision to be expanded to \u003cONE_\u003e million tpy","timestamp":"2024-06-27T11:46:00+05:30","market_timestamp":"2024-06-27T11:46:00+05:30","off_market_hours":false}