{"url":"https://www.moneycontrol.com/news/business/fairfax-india-holdings-unit-sells-9-7-stake-in-csb-bank-for-70-million-12757383.html","title":"Fairfax India Holdings unit sells 9.7% stake in CSB Bank for $70 million","description":"The proceeds of the sale amounted to 5.9 billion rupees ($70.7 million) in gross terms, Fairfax India said in a release.Fairfax India Holdings unit sells 9.7% stake in CSB Bank for $70 million","content":"Fairfax India Holdings Corp said on Thursday its wholly-owned subsidiary, FIH Mauritius Investments, sold a 9.7% stake in Indian private lender CSB Bank to comply with regulatory norms. The proceeds of the sale amounted to 5.9 billion rupees ($70.7 million) in gross terms, Fairfax India said in a release. After the sale, Fairfax India's stake in Kerala-based CSB Bank will reduce to 40% from 49.72% at the end of March. In November, FIH Mauritius Investments received approval from the Reserve Bank of India to bring down its shareholding in CSB Bank to 26% within 15 years, instead of 15% as advised by the central bank earlier. CSB Bank's shares were up 4.1% in early trade on Thursday. ","cleaned_content":"fairfax india holdings corp said on thursday its wholly owned subsidiary fih mauritius investments sold a \u003cNINE_PERCENT\u003e stake in indian private lender csb bank to comply with regulatory norms the proceeds of the sale amounted to \u003cFIVE_\u003e billion rupees \u003cSEVEN_TEN\u003e million in gross terms fairfax india said in a release after the sale fairfax indias stake in kerala based csb bank will reduce to \u003cFOUR_TEN_PERCENT\u003e from \u003cFOUR_TEN_PERCENT\u003e at the end of march in november fih mauritius investments received approval from the reserve bank of india to bring down its shareholding in csb bank to \u003cTWO_TEN_PERCENT\u003e within \u003cONE_TEN\u003e years instead of \u003cONE_TEN_PERCENT\u003e as advised by the central bank earlier csb banks shares were up \u003cFOUR_PERCENT\u003e in early trade on thursday","timestamp":"2024-06-27T13:12:00+05:30","market_timestamp":"2024-06-27T13:12:00+05:30","off_market_hours":false}