{"url":"https://www.moneycontrol.com/news/business/vedanta-mulls-first-dollar-bond-sale-of-500-million-12754903.html","title":"Vedanta mulls first dollar bond sale of $500 million","description":"Vedanta Ltd. is discussing the plan with lenders and seeking legal opinions about the potential sale, according to the people, who asked not to be identified discussing non-public issues.Vedanta mulls first dollar bond sale of $500 millionRelated stories","content":"The Indian mining company controlled by billionaire Anil Agarwal is considering tapping bond markets for at least $500 million in a debut overseas issuance, according to two people familiar with the proposal. Vedanta Ltd. is discussing the plan with lenders and seeking legal opinions about the potential sale, according to the people, who asked not to be identified discussing non-public issues. The bond sale could climb to $1 billion depending on the response from investors, according to one of the people. The company is also exploring other avenues of fundraising, including equity sales and local currency loans from domestic banks, the people said. The move comes at a time when four high-yield dollar bonds sold by Vedanta’s parent company, Vedanta Resources Ltd., are the top performers from India so far this year, according to data compiled by Bloomberg. The holding company earlier this year successfully restructured its offshore bonds. Vedanta Ltd. has historically sold local currency bonds and borrowed in rupees from local lenders. Last week, the company’s board approved the sale of 10 billion rupees ($120 million) in local, non-convertible debentures. Vedanta has interests in semiconductors and commodities including aluminum, oil and gas, iron and copper. While largely concentrated in India, it has operations in South Africa, Namibia and Liberia as well. The 2024-25 fiscal year is lining up to be a critical one for Vedanta, Executive Director Arun Misra said during an analysts’ call on April 25, when he discussed plans for $1.9 billion in capex spending. The dollar bond sale would provide revenue for that expansion. In an overhaul announced last year, Agarwal is working to divide the company into six different business units: Vedanta Ltd. would control the semiconductor, zinc and stainless steel business. The company said the split would be completed in the fiscal year ending in March 2025. ","cleaned_content":"the indian mining company controlled by billionaire anil agarwal is considering tapping bond markets for at least \u003cFIVE_HUNDRED\u003e million in a debut overseas issuance according to two people familiar with the proposal vedanta ltd is discussing the plan with lenders and seeking legal opinions about the potential sale according to the people who asked not to be identified discussing non public issues the bond sale could climb to \u003cONE_\u003e billion depending on the response from investors according to one of the people the company is also exploring other avenues of fundraising including equity sales and local currency loans from domestic banks the people said the move comes at a time when four high yield dollar bonds sold by vedanta s parent company vedanta resources ltd are the top performers from india so far this year according to data compiled by bloomberg the holding company earlier this year successfully restructured its offshore bonds vedanta ltd has historically sold local currency bonds and borrowed in rupees from local lenders last week the company s board approved the sale of \u003cONE_TEN\u003e billion rupees \u003cONE_HUNDRED\u003e million in local non convertible debentures vedanta has interests in semiconductors and commodities including aluminum oil and gas iron and copper while largely concentrated in india it has operations in south africa namibia and liberia as well the \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fiscal year is lining up to be a critical one for vedanta executive director arun misra said during an analysts call on april \u003cTWO_TEN\u003e when he discussed plans for \u003cONE_\u003e billion in capex spending the dollar bond sale would provide revenue for that expansion in an overhaul announced last year agarwal is working to divide the company into six different business units vedanta ltd would control the semiconductor zinc and stainless steel business the company said the split would be completed in the fiscal year ending in march \u003cTWO_THOUSAND\u003e","timestamp":"2024-06-24T12:05:00+05:30","market_timestamp":"2024-06-24T12:05:00+05:30","off_market_hours":false}