{"url":"https://www.moneycontrol.com/news/business/musashi-india-begins-mass-production-of-e-axles-for-ev-two-wheelers-12754997.html","title":"Musashi India begins mass production of e-Axles for EV two-wheelers","description":"The company said it plans to invest a total of Rs 160 crore in its EV business in phase I. This significant investment will be used to establish new assembly lines for EV transmission components and upgrade existing facilities.Musashi India begins mass production of e-Axles for EV two-wheelers","content":"Musashi Auto Parts India, a wholly-owned subsidiary of Japanese firm Musashi Seimitsu Industries, on Monday said it has started the mass production of e-Axles for electric two-wheelers in the domestic market. The company said it plans to invest a total of Rs 160 crore in its EV business in phase I. This significant investment will be used to establish new assembly lines for EV transmission components and upgrade existing facilities. The company entered the EV segment in India in September last year through a joint venture (JV) with Delta Electronics, Inc. and Toyota Tsusho Corporation to establish Musashi Delta e-Axle India Private Limited. \"With the rapid growth of EV two-wheelers in India, the need to build a local and robust ecosystem of EV components is imperative,\" said Naoya Nishimura (CEO India \u0026 Africa Region). Musashi said it plans to achieve a localisation level of two-thirds of the total cost by the end of this financial year, with a motor assembly line and a drive unit assembly line. It is also working with BNC Motors to develop products equipped with EV drive units. These units will be used in BNC's upcoming EV two-wheeler that will be equivalent to a 125cc ICE scooter. ","cleaned_content":"musashi auto parts india a wholly owned subsidiary of japanese firm musashi seimitsu industries on monday said it has started the mass production of e axles for electric two wheelers in the domestic market the company said it plans to invest a total of rs \u003cONE_HUNDRED\u003e crore in its ev business in phase i this significant investment will be used to establish new assembly lines for ev transmission components and upgrade existing facilities the company entered the ev segment in india in september last year through a joint venture jv with delta electronics inc and toyota tsusho corporation to establish musashi delta e axle india private limited with the rapid growth of ev two wheelers in india the need to build a local and robust ecosystem of ev components is imperative said naoya nishimura ceo india africa region musashi said it plans to achieve a localisation level of two thirds of the total cost by the end of this financial year with a motor assembly line and a drive unit assembly line it is also working with bnc motors to develop products equipped with ev drive units these units will be used in bncs upcoming ev two wheeler that will be equivalent to a \u003cONE_HUNDRED\u003e cc ice scooter","timestamp":"2024-06-24T13:21:00+05:30","market_timestamp":"2024-06-24T13:21:00+05:30","off_market_hours":false}