{"url":"https://www.moneycontrol.com/news/business/tata-power-invests-over-rs-4200-crore-in-network-expansion-upgrade-in-odisha-12767732.html","title":"Tata Power invests over Rs 4,200 crore in network expansion, upgrade in Odisha","description":"The company operates four Discoms in joint ventures with the government of Odisha - TP Central Odisha Distribution (TPCODL), TP Western Odisha Distribution (TPWODL), TP Southern Odisha Distribution (TPSODL), and TP Northern Odisha Distribution Limited (TPNODL), collectively serving a customer base of over 9 million.Tata Power invests over Rs 4,200 crore in network expansion, upgrade in Odisha","content":"Tata Power-led power distribution companies (Discoms) have invested Rs 4,245 crore in infrastructure expansion and network upgrade in Odisha over the past 3-4 years, the company said on Friday. The company operates four Discoms in joint ventures with the government of Odisha - TP Central Odisha Distribution (TPCODL), TP Western Odisha Distribution (TPWODL), TP Southern Odisha Distribution (TPSODL), and TP Northern Odisha Distribution Limited (TPNODL), collectively serving a customer base of over 9 million. Of the total investment, Rs 1,232 crore has been allocated through various government-backed schemes. This includes laying 2,177 circuit kilometres (Ckms) of 33 kilovolt (KV) lines and 19,809 Ckms of 11 KV lines, as well as adding 30,230 distribution transformers to improve the distribution network's reliability across rural and urban areas, the company said. Furthermore, the network improvements have contributed to a reduction in Aggregate Transmission and Distribution (AT\u0026C) losses, averaging 17.79 per cent in Odisha during the financial year 2023-24, the company added. ","cleaned_content":"tata power led power distribution companies discoms have invested rs \u003cFOUR_THOUSAND\u003e crore in infrastructure expansion and network upgrade in odisha over the past \u003cTHREE_\u003e \u003cFOUR_\u003e years the company said on friday the company operates four discoms in joint ventures with the government of odisha tp central odisha distribution tpcodl tp western odisha distribution tpwodl tp southern odisha distribution tpsodl and tp northern odisha distribution limited tpnodl collectively serving a customer base of over \u003cNINE_\u003e million of the total investment rs \u003cONE_THOUSAND\u003e crore has been allocated through various government backed schemes this includes laying \u003cTWO_THOUSAND\u003e circuit kilometres ckms of \u003cTHREE_TEN\u003e kilovolt kv lines and \u003cONE_TEN_THOUSAND\u003e ckms of \u003cONE_TEN\u003e kv lines as well as adding \u003cTHREE_TEN_THOUSAND\u003e distribution transformers to improve the distribution networks reliability across rural and urban areas the company said furthermore the network improvements have contributed to a reduction in aggregate transmission and distribution at c losses averaging \u003cONE_TEN_PERCENT\u003e in odisha during the financial year \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e the company added","timestamp":"2024-07-12T14:31:00+05:30","market_timestamp":"2024-07-12T14:31:00+05:30","off_market_hours":false}