{"url":"https://www.moneycontrol.com/news/business/coffee-day-enterprises-total-default-at-rs-433-91-crore-in-q1-fy25-12763028.html","title":"Coffee Day Enterprises' total default at Rs 433.91 crore in Q1 FY25","description":"Coffee Day Enterprises Ltd (CDEL) which is pairing its debts through asset resolution, in a regulatory update said \"the delay in debt servicing is due to liquidity crisis.\"Coffee Day Enterprises' total default at Rs 433.91 crore in Q1 FY25Related stories","content":"Coffee Day Enterprises Ltd has reported a total default of Rs 433.91 crore on payments of interest and repayment of principal amount on loans from banks, financial institutions, and unlisted debt securities as NCDs and NCRPS for the quarter ended June 30, 2024. Coffee Day Enterprises Ltd (CDEL) which is pairing its debts through asset resolution, in a regulatory update said \"the delay in debt servicing is due to liquidity crisis.\" There is no change in the default amount as the company has reported a similar amount in previous quarters. This is because the company is not adding interest from 2021. CDEL has reported a default of Rs 183.36 crore on the payment of the principal amount on loans or revolving facilities like cash credit from banks or financial institutions as of June 30, 2024. Besides, it has also defaulted in payment of interest of Rs 5.78 crore on the above, informed CDEL. While for unlisted debt securities such as NCDs (Non-Convertible Debentures) and NCRPS (Non-Convertible Redeemable Preference Shares), the outstanding amount of default is Rs 200 crore as of June 30, 2024, along with a default in payment of interest of Rs 44.77 crore on the same. After the death of founder Chairman V G Siddhartha in July 2019, CDEL was in trouble and paired debts through the resolution of assets. In March 2020, CDEL announced repaying Rs 1,644 crore to 13 lenders after concluding a deal with Blackstone Group to sell its technology business park. It is also pursuing a legal course to recover over Rs 3,535 crore allegedly siphoned out of the company into Mysore Amalgamated Coffee Estates Limited (MACEL), a personal firm promoted by its late founder V G Siddhartha. ","cleaned_content":"coffee day enterprises ltd has reported a total default of rs \u003cFOUR_HUNDRED\u003e crore on payments of interest and repayment of principal amount on loans from banks financial institutions and unlisted debt securities as ncds and ncrps for the quarter ended june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e coffee day enterprises ltd cdel which is pairing its debts through asset resolution in a regulatory update said the delay in debt servicing is due to liquidity crisis there is no change in the default amount as the company has reported a similar amount in previous quarters this is because the company is not adding interest from \u003cTWO_THOUSAND\u003e cdel has reported a default of rs \u003cONE_HUNDRED\u003e crore on the payment of the principal amount on loans or revolving facilities like cash credit from banks or financial institutions as of june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e besides it has also defaulted in payment of interest of rs \u003cFIVE_\u003e crore on the above informed cdel while for unlisted debt securities such as ncds non convertible debentures and ncrps non convertible redeemable preference shares the outstanding amount of default is rs \u003cTWO_HUNDRED\u003e crore as of june \u003cTHREE_TEN\u003e \u003cTWO_THOUSAND\u003e along with a default in payment of interest of rs \u003cFOUR_TEN\u003e crore on the same after the death of founder chairman v g siddhartha in july \u003cTWO_THOUSAND\u003e cdel was in trouble and paired debts through the resolution of assets in march \u003cTWO_THOUSAND\u003e cdel announced repaying rs \u003cONE_THOUSAND\u003e crore to \u003cONE_TEN\u003e lenders after concluding a deal with blackstone group to sell its technology business park it is also pursuing a legal course to recover over rs \u003cTHREE_THOUSAND\u003e crore allegedly siphoned out of the company into mysore amalgamated coffee estates limited macel a personal firm promoted by its late founder v g siddhartha","timestamp":"2024-07-05T14:36:00+05:30","market_timestamp":"2024-07-05T14:36:00+05:30","off_market_hours":false}