{"url":"https://www.moneycontrol.com/news/business/cg-power-and-industrial-solutions-board-approves-amar-kauls-appointment-as-md-ceo-12764469.html","title":"CG Power and Industrial Solutions board approves Amar Kaul's appointment as MD \u0026 CEO","description":"Amar Kaul's appointment is for a period of five years, effective July 25, 2024, and is subject to the necessary approvals, the company said in an exchange filing.CG Power and Industrial Solutions board approves Amar Kaul's appointment as MD \u0026 CEO","content":"CG Power and Industrial Solutions on Monday said its board has approved the appointment of Amar Kaul as the company's Managing Director and CEO. Kaul's appointment is for a period of five years, effective July 25, 2024, and is subject to the necessary approvals, the company said in an exchange filing. Meanwhile, the board has appointed Kaul as the Managing Director \u0026 CEO-Designate with effect from July 9, 2024, up to July 24, 2024. Kaul has done B.Tech (Mechanical), MS (Engineering Business Management) and Executive Leadership Programmes from Stanford. He has more than 30 years of experience and has worked with large organisations. CG Power and Industrial Solutions is an engineering conglomerate with a diverse portfolio of products, solutions and services for power and industrial equipment and solutions. ","cleaned_content":"cg power and industrial solutions on monday said its board has approved the appointment of amar kaul as the companys managing director and ceo kauls appointment is for a period of five years effective july \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e and is subject to the necessary approvals the company said in an exchange filing meanwhile the board has appointed kaul as the managing director ceo designate with effect from july \u003cNINE_\u003e \u003cTWO_THOUSAND\u003e up to july \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e kaul has done b tech mechanical ms engineering business management and executive leadership programmes from stanford he has more than \u003cTHREE_TEN\u003e years of experience and has worked with large organisations cg power and industrial solutions is an engineering conglomerate with a diverse portfolio of products solutions and services for power and industrial equipment and solutions","timestamp":"2024-07-08T14:40:00+05:30","market_timestamp":"2024-07-08T14:40:00+05:30","off_market_hours":false}