{"url":"https://www.moneycontrol.com/news/business/markets/mc-inside-edge-sudden-and-swift-jump-in-fertiliser-stocks-three-stocks-in-the-limelight-in-fo-a-risky-trend-in-small-caps-12765155.html","title":"MC Inside Edge: Sudden and swift jump in fertiliser stocks, three stocks in the limelight in F\u0026O, a risky trend in small caps","description":"Know all about the major deals and all the inner goings-on from Dalal Street. Here's what stocks veteran bulls are eyeing, what the bears are ganging up against Here's what stocks veteran bulls are eyeing, what the bears are ganging up against Related stories","content":"A fertile jump in volume It is that time of the year when fertiliser stocks are in the limelight. And while the markets keep a tab on the progress of the monsoons, they also prefer to keep fertiliser stocks high on their radar during this time. Hence, it comes as no surprise that a large section of traders was focusing on the sudden and swift jump in the volume of many fertiliser stocks on Monday. Traders are of the view that there are strong signs of positive momentum as almost all the stocks from the segment are exhibiting strong Relative Strength Index (RSI) across various timeframes, up to 90 days. Indeed, as Chambal Fertilisers saw nearly 3.5 lakh shares being traded on BSE, as against the two-week average of 2.36 lakh. Similarly, Gujarat State Fertilisers \u0026 Chemicals saw a huge jump with 12.5 lakh shares being traded on Monday, much higher than the two-week average of 4.28 lakh shares. The case was no different for stocks like Rashtriya Chemicals \u0026 Fertilisers, Mangalore Chemicals \u0026 Fertilizers and Shree Pushkar Chemicals \u0026 Fertilisers.  Derivatives segment is in the news on most days nowadays – be it due to regulatory concerns or just the whopping volume it clocks on a daily basis. Three stocks -- Reliance Industries, JSW Steel and NTPC – were quite hotly discussed in the F\u0026O segment on Monday. In the case of RIL, traders say, a massive unwinding of 5,000 future contracts alongside shorting of 4,900 put options suggests a potentially bullish stance even as call option activity remained subdued at around 230 lots. Meanwhile, in the case of JSW Steel, call option buying dominated with 1,460 contracts traded compared to a negligible 12 put options, clearly indicating a bullish outlook. Similar to JSW Steel, NTPC also saw significant call option buying (3,200 contracts) versus minimal put option activity (143 contracts), suggesting a strong positive bias. Is small still beautiful? Small cap stocks have been in the fast lane for long – a fact corroborated by the nearly 26 percent jump in the BSE SmallCap index in the current calendar year till date. This is significantly higher than the benchmark Sensex gain of a little over 11 percent. Concerns around the small cap universe have been lingering for long and those waiting for the small cap bubble – many in the market are actually using the term – to burst have been coming forth with many theories. The latest trend in the market is highlighting events in the US markets. They have been quick in circulating messages stating that small cap stocks in the US are down around two percent in CY24 even as large caps are up over 17 percent. They say that this is the highest margin of outperformance since 1998 and hence needs to be taken seriously. The trend could mirror in India and so be extra cautious when it comes to putting more money in small caps, they say.  ","cleaned_content":"a fertile jump in volume it is that time of the year when fertiliser stocks are in the limelight and while the markets keep a tab on the progress of the monsoons they also prefer to keep fertiliser stocks high on their radar during this time hence it comes as no surprise that a large section of traders was focusing on the sudden and swift jump in the volume of many fertiliser stocks on monday traders are of the view that there are strong signs of positive momentum as almost all the stocks from the segment are exhibiting strong relative strength index rsi across various timeframes up to \u003cNINE_TEN\u003e days indeed as chambal fertilisers saw nearly \u003cTHREE_\u003e lakh shares being traded on bse as against the two week average of \u003cTWO_\u003e lakh similarly gujarat state fertilisers chemicals saw a huge jump with \u003cONE_TEN\u003e lakh shares being traded on monday much higher than the two week average of \u003cFOUR_\u003e lakh shares the case was no different for stocks like rashtriya chemicals fertilisers mangalore chemicals fertilizers and shree pushkar chemicals fertilisers derivatives segment is in the news on most days nowadays be it due to regulatory concerns or just the whopping volume it clocks on a daily basis three stocks reliance industries jsw steel and ntpc were quite hotly discussed in the f o segment on monday in the case of ril traders say a massive unwinding of \u003cFIVE_THOUSAND\u003e future contracts alongside shorting of \u003cFOUR_THOUSAND\u003e put options suggests a potentially bullish stance even as call option activity remained subdued at around \u003cTWO_HUNDRED\u003e lots meanwhile in the case of jsw steel call option buying dominated with \u003cONE_THOUSAND\u003e contracts traded compared to a negligible \u003cONE_TEN\u003e put options clearly indicating a bullish outlook similar to jsw steel ntpc also saw significant call option buying \u003cTHREE_THOUSAND\u003e contracts versus minimal put option activity \u003cONE_HUNDRED\u003e contracts suggesting a strong positive bias is small still beautiful small cap stocks have been in the fast lane for long a fact corroborated by the nearly \u003cTWO_TEN_PERCENT\u003e jump in the bse smallcap index in the current calendar year till date this is significantly higher than the benchmark sensex gain of a little over \u003cONE_TEN_PERCENT\u003e concerns around the small cap universe have been lingering for long and those waiting for the small cap bubble many in the market are actually using the term to burst have been coming forth with many theories the latest trend in the market is highlighting events in the us markets they have been quick in circulating messages stating that small cap stocks in the us are down around two percent in cy24 even as large caps are up over \u003cONE_TEN_PERCENT\u003e they say that this is the highest margin of outperformance since \u003cONE_THOUSAND\u003e and hence needs to be taken seriously the trend could mirror in india and so be extra cautious when it comes to putting more money in small caps they say","timestamp":"2024-07-09T12:58:00+05:30","market_timestamp":"2024-07-09T12:58:00+05:30","off_market_hours":false}