{"url":"https://www.moneycontrol.com/news/business/inox-wind-to-become-debt-free-company-post-rs-900-crore-promoter-infusion-12761975.html","title":"Inox Wind to become debt-free company post Rs 900 crore promoter infusion","description":"In a statement Inox Wind Ltd (IWL) on Thursday announced the completion of infusion of Rs 900 crore into the company by its promoter Inox Wind Energy Ltd (IWEL).Inox Wind to become debt-free company post Rs 900 crore promoter infusion","content":"Inox Wind Ltd on Thursday said its promoter Inox Wind Energy (IWEL) has infused Rs 900 crore into the company, following which the wind energy solutions provider will become a net debt-free company. In a statement Inox Wind Ltd (IWL) on Thursday announced the completion of infusion of Rs 900 crore into the company by its promoter Inox Wind Energy Ltd (IWEL). \"This fund infusion will help us become a net debt-free company, strengthening our balance sheet and help accelerate our growth. We expect substantial savings in interest expenses going ahead, aiding our profitability further,\" Kailash Tarachandani, CEO of Inox Wind said. The funds will be utilised by Inox Wind Ltd to completely pare down its external term debt to achieve a net debt-free status, it added. Net Debt is a metric that determines how well a company can repay all of its debt it was due immediately. \"Net debt free status is excluding promoter debt,\" Inox Wind said. ","cleaned_content":"inox wind ltd on thursday said its promoter inox wind energy iwel has infused rs \u003cNINE_HUNDRED\u003e crore into the company following which the wind energy solutions provider will become a net debt free company in a statement inox wind ltd iwl on thursday announced the completion of infusion of rs \u003cNINE_HUNDRED\u003e crore into the company by its promoter inox wind energy ltd iwel this fund infusion will help us become a net debt free company strengthening our balance sheet and help accelerate our growth we expect substantial savings in interest expenses going ahead aiding our profitability further kailash tarachandani ceo of inox wind said the funds will be utilised by inox wind ltd to completely pare down its external term debt to achieve a net debt free status it added net debt is a metric that determines how well a company can repay all of its debt it was due immediately net debt free status is excluding promoter debt inox wind said","timestamp":"2024-07-04T10:07:00+05:30","market_timestamp":"2024-07-04T10:07:00+05:30","off_market_hours":false}