{"url":"https://www.moneycontrol.com/news/business/adani-ports-to-invest-1-2-billion-in-transshipment-terminal-12767301.html","title":"Adani Ports to invest $1.2 billion in transshipment terminal","description":"The investment in Vizhinjam port in the state of Kerala is part of the second phase of the project that is expected to finish by 2028, the report, which cited people with knowledge of the matter, added.Adani Ports to invest $1.2 billion in transshipment terminal","content":"Adani Ports and Special Economic Zone plans to ramp up its investment to 100 billion rupees ($1.20 billion) to boost its southern India transshipment container port, Bloomberg News reported on Thursday. The investment in Vizhinjam port in the state of Kerala is part of the second phase of the project that is expected to finish by 2028, the report, which cited people with knowledge of the matter, added. Construction of the $900 million port had seen a four month-long standstill from protests in 2022. Container lines such as MSC Mediterranean Shipping Co., A.P. Moller - Maersk A/S, and Hapag-Lloyd are being wooed to call in at the port, Bloomberg News reported. Adani Ports did not immediately respond to a Reuters' request for comment. ","cleaned_content":"adani ports and special economic zone plans to ramp up its investment to \u003cONE_HUNDRED\u003e billion rupees \u003cONE_\u003e billion to boost its southern india transshipment container port bloomberg news reported on thursday the investment in vizhinjam port in the state of kerala is part of the second phase of the project that is expected to finish by \u003cTWO_THOUSAND\u003e the report which cited people with knowledge of the matter added construction of the \u003cNINE_HUNDRED\u003e million port had seen a four month long standstill from protests in \u003cTWO_THOUSAND\u003e container lines such as msc mediterranean shipping co a p moller maersk a s and hapag lloyd are being wooed to call in at the port bloomberg news reported adani ports did not immediately respond to a reuters request for comment","timestamp":"2024-07-12T06:30:00+05:30","market_timestamp":"2024-07-12T09:15:00+05:30","off_market_hours":true}