{"url":"https://www.moneycontrol.com/news/business/ashwin-sheth-group-to-invest-rs-5000-crore-to-expand-real-estate-business-to-launch-ipo-in-2-years-12765188.html","title":"Ashwin Sheth Group to invest Rs 5,000 crore to expand real estate business; to launch IPO in 2 years","description":"Mumbai-based company said it has achieved sales bookings of around Rs 1,500 crore during the last fiscal, a 3-fold increase from the 2022-23 financial year.Ashwin Sheth Group to invest Rs 5,000 crore to expand real estate business; to launch IPO in 2 yearsRelated stories","content":"Realty firm Ashwin Sheth Group on Tuesday announced an investment of around Rs 5,000 crore to expand its business and will launch its maiden public issue in the next 18-24 months. Mumbai-based company said it has achieved sales bookings of around Rs 1,500 crore during the last fiscal, a 3-fold increase from the 2022-23 financial year. \"We are targeting to double our sales bookings to Rs 3,000 crore in the current 2024-25 fiscal,\" the company's CMD Ashwin Sheth told reporters here. \"We are planning to launch an Initial Public Offering (IPO) in the next 18-24 months,\" Sheth said. Ashwin Sheth Group will also enter into other segments like warehousing. \"India's real estate market has long been a key driver of economic growth, significantly contributing to the country's GDP. As Mumbai leads the luxury market and the real estate industry experiences positive momentum, we decided this was the perfect time for us to move onto the next level,\" Sheth said. Bhavik Bhandari, Chief Sales and Marketing Officer, Ashwin Sheth Group, said, \"We are aggressively expanding in the Pan MMR region and we will be soon launching projects in Kandivali, Borivali, Sewree, Juhu, 7 Rasta, Marine Drive, Nepean Sea Road, Goregaon, Thane, Mulund, and Mazagaon.\" Bhandari said the company is acquiring land across cities to expand business. The acquisition is both outright and Joint Development Agreements (JDAs) with landowners. He said the company is also expanding its product portfolio across residential, commercial, township, villas, retail, mix-use, farm-houses, co-working spaces, second homes and warehousing. Ashwin Sheth Group, founded in 1986, has developed more than 80 luxury projects in India and Dubai. ","cleaned_content":"realty firm ashwin sheth group on tuesday announced an investment of around rs \u003cFIVE_THOUSAND\u003e crore to expand its business and will launch its maiden public issue in the next \u003cONE_TEN\u003e \u003cTWO_TEN\u003e months mumbai based company said it has achieved sales bookings of around rs \u003cONE_THOUSAND\u003e crore during the last fiscal a \u003cTHREE_\u003e fold increase from the \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e financial year we are targeting to double our sales bookings to rs \u003cTHREE_THOUSAND\u003e crore in the current \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e fiscal the companys cmd ashwin sheth told reporters here we are planning to launch an initial public offering ipo in the next \u003cONE_TEN\u003e \u003cTWO_TEN\u003e months sheth said ashwin sheth group will also enter into other segments like warehousing indias real estate market has long been a key driver of economic growth significantly contributing to the countrys gdp as mumbai leads the luxury market and the real estate industry experiences positive momentum we decided this was the perfect time for us to move onto the next level sheth said bhavik bhandari chief sales and marketing officer ashwin sheth group said we are aggressively expanding in the pan mmr region and we will be soon launching projects in kandivali borivali sewree juhu \u003cSEVEN_\u003e rasta marine drive nepean sea road goregaon thane mulund and mazagaon bhandari said the company is acquiring land across cities to expand business the acquisition is both outright and joint development agreements jdas with landowners he said the company is also expanding its product portfolio across residential commercial township villas retail mix use farm houses co working spaces second homes and warehousing ashwin sheth group founded in \u003cONE_THOUSAND\u003e has developed more than \u003cEIGHT_TEN\u003e luxury projects in india and dubai","timestamp":"2024-07-09T13:33:00+05:30","market_timestamp":"2024-07-09T13:33:00+05:30","off_market_hours":false}