{"url":"https://www.moneycontrol.com/news/business/hdfc-bank-said-to-mull-loan-portfolio-sale-amid-growth-scrutiny-12762955.html","title":"HDFC Bank said to mull loan portfolio sale amid growth scrutiny","description":"India’s biggest private sector bank has approached public sector lenders, non-banking finance companies as well as some insurance companies and asset managers about participating in the sale, said the people, who requested anonymity discussing private conversations. HDFC Bank said to mull loan portfolio sale amid growth scrutinyRelated stories","content":"HDFC Bank Ltd. is mulling the sale of a loans portfolio, according to people familiar with the matter, amid heightened regulatory scrutiny on the nation’s lenders as their credit growth surges. India’s biggest private sector bank has approached public sector lenders, non-banking finance companies as well as some insurance companies and asset managers about participating in the sale, said the people, who requested anonymity discussing private conversations. A measure of how much of a bank’s deposits are being lent out as loans — known as the credit-deposit ratio — has drawn scrutiny from the Reserve Bank of India as that gauge for the nation’s industry stands at a decade high. Selling some of its loan portfolio would go some ways to help HDFC bring that down following an increase in the wake of its 2023 merger with the bank’s parent HDFC Ltd. and may also aid its liquidity. A spokesperson for Mumbai-based HDFC Bank didn’t reply to an email request for comment. Shares of the bank fell the most in a month on Friday after it reported flat sequential deposit performance in the quarter ended June. HDFC Bank Shares Fall Most in a Month After 1Q Deposits Miss With loans growing significantly faster than deposits in India, where the economy’s expanding toward 8%, decision makers at banks are under pressure to address potential financial risks that are building. India’s central bank has also asked banks to raise buffers for some consumer loans as it tries to keep a cap on evolving risks. The banking industry’s credit-deposit ratio stood at 80.3% in March, a decade high, according to RBI data. That has eased since, though remains elevated at 77.9% as of June 14. Bank deposits in India grew 12.6% annually through June 14, compared with 19.2% loan growth, the latest RBI data show. “The persisting gap between credit and deposit growth rates warrants a rethink by the boards of banks to re-strategize their business plans,” the Reserve Bank of India said in a monthly bulletin last month. “A prudent balance between assets and liabilities has to be maintained,” it said. HDFC’s credit-deposit ratio rose as high as 110% after the merger, according to a report by ICRA Ratings, the local arm of Moody’s Investors Inc. It’s since dropped to 104% at the end of the last fiscal year, though remains above the average of between 85%-88% in fiscal 2021 through fiscal 2023. The firm’s total loans expanded about 53% to 24.87 trillion rupees at the end of June, compared with a 24% expansion in deposits during the same period. ","cleaned_content":"hdfc bank ltd is mulling the sale of a loans portfolio according to people familiar with the matter amid heightened regulatory scrutiny on the nation s lenders as their credit growth surges india s biggest private sector bank has approached public sector lenders non banking finance companies as well as some insurance companies and asset managers about participating in the sale said the people who requested anonymity discussing private conversations a measure of how much of a bank s deposits are being lent out as loans known as the credit deposit ratio has drawn scrutiny from the reserve bank of india as that gauge for the nation s industry stands at a decade high selling some of its loan portfolio would go some ways to help hdfc bring that down following an increase in the wake of its \u003cTWO_THOUSAND\u003e merger with the bank s parent hdfc ltd and may also aid its liquidity a spokesperson for mumbai based hdfc bank didn t reply to an email request for comment shares of the bank fell the most in a month on friday after it reported flat sequential deposit performance in the quarter ended june hdfc bank shares fall most in a month after \u003cONE_\u003e q deposits miss with loans growing significantly faster than deposits in india where the economy s expanding toward \u003cEIGHT_PERCENT\u003e decision makers at banks are under pressure to address potential financial risks that are building india s central bank has also asked banks to raise buffers for some consumer loans as it tries to keep a cap on evolving risks the banking industry s credit deposit ratio stood at \u003cEIGHT_TEN_PERCENT\u003e in march a decade high according to rbi data that has eased since though remains elevated at \u003cSEVEN_TEN_PERCENT\u003e as of june \u003cONE_TEN\u003e bank deposits in india grew \u003cONE_TEN_PERCENT\u003e annually through june \u003cONE_TEN\u003e compared with \u003cONE_TEN_PERCENT\u003e loan growth the latest rbi data show the persisting gap between credit and deposit growth rates warrants a rethink by the boards of banks to re strategize their business plans the reserve bank of india said in a monthly bulletin last month a prudent balance between assets and liabilities has to be maintained it said hdfc s credit deposit ratio rose as high as \u003cONE_HUNDRED_PERCENT\u003e after the merger according to a report by icra ratings the local arm of moody s investors inc it s since dropped to \u003cONE_HUNDRED_PERCENT\u003e at the end of the last fiscal year though remains above the average of between \u003cEIGHT_TEN_PERCENT\u003e \u003cEIGHT_TEN_PERCENT\u003e in fiscal \u003cTWO_THOUSAND\u003e through fiscal \u003cTWO_THOUSAND\u003e the firm s total loans expanded about \u003cFIVE_TEN_PERCENT\u003e to \u003cTWO_TEN\u003e trillion rupees at the end of june compared with a \u003cTWO_TEN_PERCENT\u003e expansion in deposits during the same period","timestamp":"2024-07-05T12:55:00+05:30","market_timestamp":"2024-07-05T12:55:00+05:30","off_market_hours":false}