{"url":"https://www.moneycontrol.com/news/business/foxconn-chairman-young-liu-to-visit-india-this-year-12762828.html","title":"Foxconn Chairman Young Liu to visit India this year","description":"Young Liu received the Padma Bhushan Award from India Taipei Association Director General Manharsinh Yadav at Taipei on July 4.Foxconn Chairman Young Liu to visit India this year","content":"Taiwanese electronics giant Foxconn Chairman Young Liu plans to visit India this year. Liu received the Padma Bhushan Award from India Taipei Association Director General Manharsinh Yadav at Taipei on July 4. He was conferred with Padma Bhushan, the third highest civilian award, on the eve of the 75th Republic Day this year. He last visited India in July last year to attend the Semicon India conclave where he met Prime Minister Narendra Modi. Foxconn's total investment in India is estimated to be in the range of USD 9-10 billion. The company is also in process of expanding its iPhone production facility, setting up a chip plant in a joint venture with HCL Group, an electric vehicle manufacturing unit and Apple Airpods. ","cleaned_content":"taiwanese electronics giant foxconn chairman young liu plans to visit india this year liu received the padma bhushan award from india taipei association director general manharsinh yadav at taipei on july \u003cFOUR_\u003e he was conferred with padma bhushan the third highest civilian award on the eve of the \u003cSEVEN_TEN\u003e th republic day this year he last visited india in july last year to attend the semicon india conclave where he met prime minister narendra modi foxconns total investment in india is estimated to be in the range of usd \u003cNINE_\u003e \u003cONE_TEN\u003e billion the company is also in process of expanding its iphone production facility setting up a chip plant in a joint venture with hcl group an electric vehicle manufacturing unit and apple airpods","timestamp":"2024-07-05T10:44:00+05:30","market_timestamp":"2024-07-05T10:44:00+05:30","off_market_hours":false}