{"url":"https://www.moneycontrol.com/news/business/kalpataru-projects-international-bags-orders-worth-rs-2995-crore-12766612.html","title":"Kalpataru Projects International bags orders worth Rs 2,995 crore","description":"In a statement the company said the new order wins were in the transmission \u0026 distribution (T\u0026D), building \u0026 factories (B\u0026F) and water business categories.Kalpataru Projects International bags orders worth Rs 2,995 croreRelated stories","content":"Kalpataru Projects International on Thursday said the company along with its joint ventures and international subsidiaries have bagged orders worth Rs 2,995 crore. In a statement the company said the new order wins were in the transmission \u0026 distribution (T\u0026D), building \u0026 factories (B\u0026F) and water business categories. Kalpataru Projects International Limited (KPIL) along with its joint ventures and international subsidiaries have secured new orders/notification of awards of Rs 2,995 crore, the statement said. \"The orders in the building and factories and water business have further strengthened our order book, thereby improving the growth visibility for these businesses. With the above order wins, our order intake till date in the current financial year stands at Rs 6,178 crore,\" Manish Mohnot, MD \u0026 CEO, KPIL, said. KPIL is one of the largest specialized EPC companies engaged in power transmission and distribution, buildings and factories, water supply and irrigation, railways, oil and gas pipelines, urban mobility (flyovers and metro rail), highways and airports. Kalpataru Projects International is currently executing projects in over 30 countries and has a global footprint in over 70 countries. ","cleaned_content":"kalpataru projects international on thursday said the company along with its joint ventures and international subsidiaries have bagged orders worth rs \u003cTWO_THOUSAND\u003e crore in a statement the company said the new order wins were in the transmission distribution t d building factories b f and water business categories kalpataru projects international limited kpil along with its joint ventures and international subsidiaries have secured new orders notification of awards of rs \u003cTWO_THOUSAND\u003e crore the statement said the orders in the building and factories and water business have further strengthened our order book thereby improving the growth visibility for these businesses with the above order wins our order intake till date in the current financial year stands at rs \u003cSIX_THOUSAND\u003e crore manish mohnot md ceo kpil said kpil is one of the largest specialized epc companies engaged in power transmission and distribution buildings and factories water supply and irrigation railways oil and gas pipelines urban mobility flyovers and metro rail highways and airports kalpataru projects international is currently executing projects in over \u003cTHREE_TEN\u003e countries and has a global footprint in over \u003cSEVEN_TEN\u003e countries","timestamp":"2024-07-11T10:20:00+05:30","market_timestamp":"2024-07-11T10:20:00+05:30","off_market_hours":false}