{"url":"https://www.moneycontrol.com/news/business/vedanta-resources-pays-246-million-dues-to-help-revive-operations-at-zambian-copper-mine-12772555.html","title":"Vedanta Resources pays $246 million dues to help revive operations at Zambian copper mine","description":"The miner, owned by billionaire Anil Agarwal, had in November 2023 regained control of the copper mines and smelter, which the Zambian administration had seized in 2019, but needed to pay creditors of the mines to revive operations.Vedanta Resources pays $246 million dues to help revive operations at Zambian copper mine","content":"UK-based Vedanta Resources, parent of India's Vedanta, has settled dues worth $245.75 million to help revive operations in Konkola copper mines (KCM) in Zambia as part of a deal to take back the mines, the Indian miner said on Friday. The miner, owned by billionaire Anil Agarwal, had in November 2023 regained control of the copper mines and smelter, which the Zambian administration had seized in 2019, but needed to pay creditors of the mines to revive operations. Vedanta Resources gained control of KCM's assets following a five-year legal battle after the former Zambian President Edgar Lungu accused the company of failing to invest to expand copper production and seized its assets. The Zambian government owns a 20% stake in KCM through ZCCM, a mining investment company, while Vedanta Resources owns the rest. Last month, Anil Agarwal said Vedanta Resources is looking to reduce its debt by $3 billion over the next three years, as the company grapples with mounting debt and a host of rating downgrades since last year. ","cleaned_content":"uk based vedanta resources parent of indias vedanta has settled dues worth \u003cTWO_HUNDRED\u003e million to help revive operations in konkola copper mines kcm in zambia as part of a deal to take back the mines the indian miner said on friday the miner owned by billionaire anil agarwal had in november \u003cTWO_THOUSAND\u003e regained control of the copper mines and smelter which the zambian administration had seized in \u003cTWO_THOUSAND\u003e but needed to pay creditors of the mines to revive operations vedanta resources gained control of kcms assets following a five year legal battle after the former zambian president edgar lungu accused the company of failing to invest to expand copper production and seized its assets the zambian government owns a \u003cTWO_TEN_PERCENT\u003e stake in kcm through zccm a mining investment company while vedanta resources owns the rest last month anil agarwal said vedanta resources is looking to reduce its debt by \u003cTHREE_\u003e billion over the next three years as the company grapples with mounting debt and a host of rating downgrades since last year","timestamp":"2024-07-19T09:51:00+05:30","market_timestamp":"2024-07-19T09:51:00+05:30","off_market_hours":false}