{"url":"https://www.moneycontrol.com/news/business/markets/paytm-gets-government-nod-for-investment-in-payments-arm-12779437.html","title":"Paytm gets government nod for investment in payments arm; stock soars 10%","description":"The approval, which was stuck for months due to the company's link to China, will remove the main stumbling block to the unit, Paytm Payment Services, resuming normal business operations.Paytm gets government nod for investment in payments armRelated stories","content":"Paytm has got approval from the government for its 500 million rupees ($5.97 million) investment in a key subsidiary, a top finance ministry official told Reuters on Friday. The approval, which was stuck for months due to the company's link to China, will remove the main stumbling block to the unit, Paytm Payment Services, resuming normal business operations. Following the approval, shares of One97 Communications, the parent company of Paytm, surged 10 percent and was locked in the upper circuit at Rs 509.05 on the NSE. This also marks the first time since February 8 that shares of Paytm surpassed the Rs 500-level. Follow our live blog for all the updates Earlier this month, Reuters reported that the government had given the investment the green light. Vivek Joshi, financial services secretary, said the company can approach India's central bank to seek a payment aggregator license which the bank will evaluate. Shares of the payments aggregator have been under pressure since February following the RBI's action against its Payments Bank. In January, the shares had reached levels as high as Rs 800, however, since then, the stock has been unable to bounceback to that mark. In the June quarter, Paytm's revenue dropped by 36 percent year-over-year to Rs 1,502 crore due to ongoing challenges from RBI restrictions. The company's net loss also widened sharply to Rs 840 crore in Q1 of FY25, the steepest loss since its listing. Disclaimer: The views and investment tips expressed by investment experts on Moneycontrol.com are their own and not those of the website or its management. Moneycontrol.com advises users to check with certified experts before taking any investment decisions. ","cleaned_content":"paytm has got approval from the government for its \u003cFIVE_HUNDRED\u003e million rupees \u003cFIVE_\u003e million investment in a key subsidiary a top finance ministry official told reuters on friday the approval which was stuck for months due to the companys link to china will remove the main stumbling block to the unit paytm payment services resuming normal business operations following the approval shares of one97 communications the parent company of paytm surged \u003cONE_TEN_PERCENT\u003e and was locked in the upper circuit at rs \u003cFIVE_HUNDRED\u003e on the nse this also marks the first time since february \u003cEIGHT_\u003e that shares of paytm surpassed the rs \u003cFIVE_HUNDRED\u003e level follow our live blog for all the updates earlier this month reuters reported that the government had given the investment the green light vivek joshi financial services secretary said the company can approach indias central bank to seek a payment aggregator license which the bank will evaluate shares of the payments aggregator have been under pressure since february following the rbis action against its payments bank in january the shares had reached levels as high as rs \u003cEIGHT_HUNDRED\u003e however since then the stock has been unable to bounceback to that mark in the june quarter paytms revenue dropped by \u003cTHREE_TEN_PERCENT\u003e year over year to rs \u003cONE_THOUSAND\u003e crore due to ongoing challenges from rbi restrictions the companys net loss also widened sharply to rs \u003cEIGHT_HUNDRED\u003e crore in q1 of fy25 the steepest loss since its listing disclaimer the views and investment tips expressed by investment experts on moneycontrol com are their own and not those of the website or its management moneycontrol com advises users to check with certified experts before taking any investment decisions","timestamp":"2024-07-26T15:20:00+05:30","market_timestamp":"2024-07-26T15:20:00+05:30","off_market_hours":false}