{"url":"https://www.moneycontrol.com/news/business/fineotex-chemical-raises-rs-342-55-crore-through-issue-of-shares-warrants-12774505.html","title":"Fineotex Chemical raises Rs 342.55 crore through issue of shares, warrants","description":"In a regulatory filing, the company announced the closure of \"fund raising of Rs 342.55 crore through a preferential allotment of equity shares and convertible warrants\".Fineotex Chemical raises Rs 342.55 crore through issue of shares, warrants","content":"Fineotex Chemical Ltd, which manufactures speciality chemicals, on Monday said it has raised Rs 342.55 crore through the issue of equity shares and warrants on a preferential basis. In a regulatory filing, the company announced the closure of \"fund raising of Rs 342.55 crore through a preferential allotment of equity shares and convertible warrants\". \"This preferential allotment aligns with the initial tranche of our fund raised on May 22, 2024, amounting to Rs 124.4 crore. The cumulative funds raised from both tranches now total Rs 342.6 crore,\" Sanjay Tibrewala, CFO and Executive Director at Fineotex Chemical, said. \"The capital raised will be invested strategically to support both organic and inorganic growth opportunities, reinforcing our commitment to enhancing shareholder value and advancing operational excellence,\" he said. ","cleaned_content":"fineotex chemical ltd which manufactures speciality chemicals on monday said it has raised rs \u003cTHREE_HUNDRED\u003e crore through the issue of equity shares and warrants on a preferential basis in a regulatory filing the company announced the closure of fund raising of rs \u003cTHREE_HUNDRED\u003e crore through a preferential allotment of equity shares and convertible warrants this preferential allotment aligns with the initial tranche of our fund raised on may \u003cTWO_TEN\u003e \u003cTWO_THOUSAND\u003e amounting to rs \u003cONE_HUNDRED\u003e crore the cumulative funds raised from both tranches now total rs \u003cTHREE_HUNDRED\u003e crore sanjay tibrewala cfo and executive director at fineotex chemical said the capital raised will be invested strategically to support both organic and inorganic growth opportunities reinforcing our commitment to enhancing shareholder value and advancing operational excellence he said","timestamp":"2024-07-22T12:57:00+05:30","market_timestamp":"2024-07-22T12:57:00+05:30","off_market_hours":false}