{"url":"https://www.moneycontrol.com/news/business/air-india-rolls-out-vrs-for-non-flying-staff-ahead-of-vistara-merger-12771574.html","title":"Air India rolls out VRS for non-flying staff ahead of Vistara merger","description":"Air India has rolled out a voluntary retirement scheme (VRS) along with a voluntary separation scheme for its non-flying permanent staff ahead of the merger of Vistara with it, according to sources.\n\nThe VRS scheme is open to employees who have completed five years of service with the company while the voluntary separation scheme (VSS) has been offered to employees with less than five years of service at the airline, they said.\n\n\n\nAir India confirmed the developments without sharing the specific details of the twin schemes that the airline rolled out on Wednesday giving the aspirants a one-month window to apply for VRS/VSS.\n\n\n\nThis is the third time Air India has come out with a voluntary retirement scheme for its permanent employees since its privatisation two-and-a-half years ago.\n\n\n\nTata Group took over the reins of Air India in January 2022.\n\n\n\nEarlier this month, sources in the know had told PTI that the merger is expected to impact around 600 employees from the two airlines.\n\n\n\nTata Group-owned- loss-making full-service carriers -- Air India and Vistara -- together have more than 23,000 employees.\n\n\n\nSimilar schemes are expected to be announced by Vistara as well soon as after completion of the fitment exercise and assigning of roles some redundancies are bound to creep in, said a source, adding that Air India is trying to accommodate some of the redundant employees with the Air India group or within the Tata Group companies as well.\n\n\n\nVistara is a joint venture between Singapore Airlines and Tata Group.\n\n\n\nOnce the merger is complete, Singapore Airlines will have a 25.1 per cent stake in Air India.\n\n\n\nThe fitment exercise -- which involves the evaluation of the roles and responsibilities of staff of both airlines -- in the run-up to the merger has been going on for the past few months.\n\n\n\nThe exercise takes into account an individual's prior experience, performance and other factors.\n\n\n\nAs part of consolidating its airline business, Tata Group is also merging Air India Express and AIX Connect (formerly AirAsia India).Air India rolls out VRS for non-flying staff ahead of Vistara mergerRelated stories","content":"Air India has rolled out a voluntary retirement scheme (VRS) along with a voluntary separation scheme for its non-flying permanent staff ahead of the merger of Vistara with it, according to sources. The VRS scheme is open to employees who have completed five years of service with the company while the voluntary separation scheme (VSS) has been offered to employees with less than five years of service at the airline, they said. Air India confirmed the developments without sharing the specific details of the twin schemes that the airline rolled out on Wednesday giving the aspirants a one-month window to apply for VRS/VSS. Tata Group took over the reins of Air India in January 2022. Earlier this month, sources in the know had told PTI that the merger is expected to impact around 600 employees from the two airlines. Tata Group-owned- loss-making full-service carriers -- Air India and Vistara -- together have more than 23,000 employees. Similar schemes are expected to be announced by Vistara as well soon as after completion of the fitment exercise and assigning of roles some redundancies are bound to creep in, said a source, adding that Air India is trying to accommodate some of the redundant employees with the Air India group or within the Tata Group companies as well. Vistara is a joint venture between Singapore Airlines and Tata Group. Once the merger is complete, Singapore Airlines will have a 25.1 per cent stake in Air India. The fitment exercise -- which involves the evaluation of the roles and responsibilities of staff of both airlines -- in the run-up to the merger has been going on for the past few months. The exercise takes into account an individual's prior experience, performance and other factors. As part of consolidating its airline business, Tata Group is also merging Air India Express and AIX Connect (formerly AirAsia India). ","cleaned_content":"air india has rolled out a voluntary retirement scheme vrs along with a voluntary separation scheme for its non flying permanent staff ahead of the merger of vistara with it according to sources the vrs scheme is open to employees who have completed five years of service with the company while the voluntary separation scheme vss has been offered to employees with less than five years of service at the airline they said air india confirmed the developments without sharing the specific details of the twin schemes that the airline rolled out on wednesday giving the aspirants a one month window to apply for vrs vss tata group took over the reins of air india in january \u003cTWO_THOUSAND\u003e earlier this month sources in the know had told pti that the merger is expected to impact around \u003cSIX_HUNDRED\u003e employees from the two airlines tata group owned loss making full service carriers air india and vistara together have more than \u003cTWO_TEN_THOUSAND\u003e employees similar schemes are expected to be announced by vistara as well soon as after completion of the fitment exercise and assigning of roles some redundancies are bound to creep in said a source adding that air india is trying to accommodate some of the redundant employees with the air india group or within the tata group companies as well vistara is a joint venture between singapore airlines and tata group once the merger is complete singapore airlines will have a \u003cTWO_TEN_PERCENT\u003e stake in air india the fitment exercise which involves the evaluation of the roles and responsibilities of staff of both airlines in the run up to the merger has been going on for the past few months the exercise takes into account an individuals prior experience performance and other factors as part of consolidating its airline business tata group is also merging air india express and aix connect formerly airasia india","timestamp":"2024-07-18T08:36:00+05:30","market_timestamp":"2024-07-18T09:15:00+05:30","off_market_hours":true}