{"url":"https://www.moneycontrol.com/news/business/byjus-founder-faces-reckoning-as-startup-implodes-12774162.html","title":"Byju's founder faces reckoning as startup implodes","description":"The future of Raveendran's eponymous Byju's online coaching firm rests with India's courts after the county's biggest startup, once loved by global investors who valued it at $22 billion, crashed below $2 billion in valuation. The 44-year-old founder last week lost control of the company as a tribunal kick-started an insolvency process.Byju's founder faces reckoning as startup implodesRelated stories","content":"Byju Raveendran, an Indian mathematics whiz who soared from teacher to startup billionaire before his education-technology company imploded this year, now faces his biggest test. The future of Raveendran's eponymous Byju's online coaching firm rests with India's courts after the county's biggest startup, once loved by global investors who valued it at $22 billion, crashed below $2 billion in valuation. The 44-year-old founder last week lost control of the company as a tribunal kick-started an insolvency process. Accused of \"financial mismanagement and compliance issues\", the son of a family of teachers from a small village in south India faces a reckoning that will test the ingenuity that made him a poster child for India's startups. An appeals tribunal is expected to hold a hearing on Monday on whether Byju's insolvency process should be quashed after the former billionaire argued in court his company is solvent and that insolvency could shut it down and cost the jobs of 27,000 staff, including teachers. Insolvency also would not bode well for Byju's backers, such as Dutch technology investor Prosus. Raveendran denies the allegations of mismanagement and wrongdoing at his firm, which has in recent months faced lawsuits over unpaid loans and boardroom battles with foreign investors that went public. Potential insolvency is a dramatic turn of events for an entrepreneur described by one person who has worked with him as an extremely passionate and goal-oriented person who might adopt \"an abrasive approach\" in a crisis. Raveendran presented a \"suave, nice and polished\" image, appearing to heed advice, but \"eventually there was a trust deficit\", said another executive who quit last year as a Byju's senior vice president. \"He said things are improving, don't worry, we have the money,\" the former executive said. Raveendran and a Byju's spokesperson did not respond to requests for comment. BYJU'S DOWNFALL: 'OUR FAIR SHARE OF MISTAKES' An engineer by training, he started Byju's in 2011 with physical classes after friends urged him to go into teaching. Raveendran, who aced a premier Indian management exam \"with a score of 100 percentile, not once but twice\", according to the company website, started what would become his empire with his wife Divya Gokulnath, 38, a former student of his. In education-obsessed India, Raveendran hit gold by offering online teaching programs priced from $100 to $300. He got a mammoth boost when the COVID-19 pandemic sent students indoors. At the height of his fame in 2021, he and his wife had a net worth of $4 billion, Forbes reckoned. Now all that is in tatters. Behind the reversal of Byju's meteoric success, say executives and advisers who worked with Raveendran, is that he overruled associates and expanded the business through expensive acquisitions, splurging on marketing and being slow to address problems such as sales agents adopting aggressive tactics to mis-sell courses that damaged the company's reputation. With the backing of investors like General Atlantic, Prosus and Facebook founder Mark Zuckerberg's philanthropy venture, Raveendran spent millions on acquisitions, and the company says it has 150 million students in over 100 countries. \"While growing fast, as I've accepted multiple times, we've made our fair share of mistakes\", Raveendran told an interviewer last year at the World Economic Forum in Davos. As he battled crises, the CEO also said decisions to lay off some of its then-50,000 employees and slash branding expenses would help strengthen loss-making Byju's and turn its cashflow positive. \"Every country needs a Byju's,\" he said. ","cleaned_content":"byju raveendran an indian mathematics whiz who soared from teacher to startup billionaire before his education technology company imploded this year now faces his biggest test the future of raveendrans eponymous byjus online coaching firm rests with indias courts after the countys biggest startup once loved by global investors who valued it at \u003cTWO_TEN\u003e billion crashed below \u003cTWO_\u003e billion in valuation the \u003cFOUR_TEN\u003e year old founder last week lost control of the company as a tribunal kick started an insolvency process accused of financial mismanagement and compliance issues the son of a family of teachers from a small village in south india faces a reckoning that will test the ingenuity that made him a poster child for indias startups an appeals tribunal is expected to hold a hearing on monday on whether byjus insolvency process should be quashed after the former billionaire argued in court his company is solvent and that insolvency could shut it down and cost the jobs of \u003cTWO_TEN_THOUSAND\u003e staff including teachers insolvency also would not bode well for byjus backers such as dutch technology investor prosus raveendran denies the allegations of mismanagement and wrongdoing at his firm which has in recent months faced lawsuits over unpaid loans and boardroom battles with foreign investors that went public potential insolvency is a dramatic turn of events for an entrepreneur described by one person who has worked with him as an extremely passionate and goal oriented person who might adopt an abrasive approach in a crisis raveendran presented a suave nice and polished image appearing to heed advice but eventually there was a trust deficit said another executive who quit last year as a byjus senior vice president he said things are improving dont worry we have the money the former executive said raveendran and a byjus spokesperson did not respond to requests for comment byjus downfall our fair share of mistakes an engineer by training he started byjus in \u003cTWO_THOUSAND\u003e with physical classes after friends urged him to go into teaching raveendran who aced a premier indian management exam with a score of \u003cONE_HUNDRED_PERCENT\u003e ile not once but twice according to the company website started what would become his empire with his wife divya gokulnath \u003cTHREE_TEN\u003e a former student of his in education obsessed india raveendran hit gold by offering online teaching programs priced from \u003cONE_HUNDRED\u003e to \u003cTHREE_HUNDRED\u003e he got a mammoth boost when the covid \u003cONE_TEN\u003e pandemic sent students indoors at the height of his fame in \u003cTWO_THOUSAND\u003e he and his wife had a net worth of \u003cFOUR_\u003e billion forbes reckoned now all that is in tatters behind the reversal of byjus meteoric success say executives and advisers who worked with raveendran is that he overruled associates and expanded the business through expensive acquisitions splurging on marketing and being slow to address problems such as sales agents adopting aggressive tactics to mis sell courses that damaged the companys reputation with the backing of investors like general atlantic prosus and facebook founder mark zuckerbergs philanthropy venture raveendran spent millions on acquisitions and the company says it has \u003cONE_HUNDRED\u003e million students in over \u003cONE_HUNDRED\u003e countries while growing fast as ive accepted multiple times weve made our fair share of mistakes raveendran told an interviewer last year at the world economic forum in davos as he battled crises the ceo also said decisions to lay off some of its then \u003cFIVE_TEN_THOUSAND\u003e employees and slash branding expenses would help strengthen loss making byjus and turn its cashflow positive every country needs a byjus he said","timestamp":"2024-07-22T08:01:00+05:30","market_timestamp":"2024-07-22T09:15:00+05:30","off_market_hours":true}