{"url":"https://www.moneycontrol.com/news/business/panasonic-avionics-opens-new-software-design-facility-in-pune-12771106.html","title":"Panasonic Avionics opens new software design facility in Pune","description":"The new facility, inaugurated by the Minister of State for Civil Aviation, Murlidhar Mohol, is the first in the country by Panasonic Avionics Corporation dedicated to supporting the development and delivery of IFEC solutions.Panasonic Avionics opens new software design facility in PuneRelated stories","content":"In-flight Engagement and Connectivity (IFEC) solutions provider Panasonic Avionics on Wednesday opened a new software design and development facility in Pune. The new facility, inaugurated by the Minister of State for Civil Aviation, Murlidhar Mohol, is the first in the country by Panasonic Avionics Corporation dedicated to supporting the development and delivery of IFEC solutions. The facility employs over 200 skilled engineers in the beginning with growth plans in place to scale it up further to support the increasing demand from airlines for these solutions, the company said. \"With its huge number of skilled engineers, and fast-growing aviation sector, India is a natural location for us to invest in for the future of our business, and we look forward to accelerating our software innovation and design capabilities from our new Pune facility,\" said Ken Sain, Chief Executive Officer at Panasonic Avionics Corporation. Sain, however, did not divulge the investment figures. According to him, Tata Group-owned Air India, which recently acquired Airbus wide-body A350 planes in its fleet, has been using its IFES solutions onboard these planes. Initiated in 2021, the new facility has been developed through a 'build-operate-transfer' (BOT) operation basis, the company said. The latest facility is integral to its strategy of enabling airlines to realise their passenger digital engagement visions by using the most innovative IFEC solutions, supported by enterprise software tools that are self-service and designed to lower IFEC solution lifecycle costs, it said. A range of software will be developed, tested, and sustained in the laboratories throughout the facility to deliver passenger experiences for both narrow and widebody aircraft that meet airlines' needs, it said. These include the X Series in-flight entertainment system and digital solutions, among others, the company said. India has become synonymous with capability when it comes to software talent, said Manish Sharma, Chairman of Panasonic Life Solutions India and South Asia, and Director, Panasonic Avionics India. \"Today, India is providing IT support and IT services to the world and Panasonic has invested in setting up innovation centres and global capability centres to provide high-quality services to our other subsidiaries across the world,\" he said. The company's Pune facility is the latest in its series of investments in India, Sharma said, adding, \"We are looking to cater to multiple markets and airlines with innovative solutions for in-flight engagement and communication (IFEC),\" he added. Over 300 airlines globally currently have installed Panasonic Avionics' in-flight engagement, satellite Wi-Fi connectivity, and digital services on their aircraft, as per the company. The company also said it is developing partnerships with universities across India including, Maharashtra to nurture and develop skilled engineering graduates and also accelerate the growth of the new facility. ","cleaned_content":"in flight engagement and connectivity ifec solutions provider panasonic avionics on wednesday opened a new software design and development facility in pune the new facility inaugurated by the minister of state for civil aviation murlidhar mohol is the first in the country by panasonic avionics corporation dedicated to supporting the development and delivery of ifec solutions the facility employs over \u003cTWO_HUNDRED\u003e skilled engineers in the beginning with growth plans in place to scale it up further to support the increasing demand from airlines for these solutions the company said with its huge number of skilled engineers and fast growing aviation sector india is a natural location for us to invest in for the future of our business and we look forward to accelerating our software innovation and design capabilities from our new pune facility said ken sain chief executive officer at panasonic avionics corporation sain however did not divulge the investment figures according to him tata group owned air india which recently acquired airbus wide body a350 planes in its fleet has been using its ifes solutions onboard these planes initiated in \u003cTWO_THOUSAND\u003e the new facility has been developed through a build operate transfer bot operation basis the company said the latest facility is integral to its strategy of enabling airlines to realise their passenger digital engagement visions by using the most innovative ifec solutions supported by enterprise software tools that are self service and designed to lower ifec solution lifecycle costs it said a range of software will be developed tested and sustained in the laboratories throughout the facility to deliver passenger experiences for both narrow and widebody aircraft that meet airlines needs it said these include the x series in flight entertainment system and digital solutions among others the company said india has become synonymous with capability when it comes to software talent said manish sharma chairman of panasonic life solutions india and south asia and director panasonic avionics india today india is providing it support and it services to the world and panasonic has invested in setting up innovation centres and global capability centres to provide high quality services to our other subsidiaries across the world he said the companys pune facility is the latest in its series of investments in india sharma said adding we are looking to cater to multiple markets and airlines with innovative solutions for in flight engagement and communication ifec he added over \u003cTHREE_HUNDRED\u003e airlines globally currently have installed panasonic avionics in flight engagement satellite wi fi connectivity and digital services on their aircraft as per the company the company also said it is developing partnerships with universities across india including maharashtra to nurture and develop skilled engineering graduates and also accelerate the growth of the new facility","timestamp":"2024-07-17T13:22:00+05:30","market_timestamp":"2024-07-17T13:22:00+05:30","off_market_hours":false}