{"url":"https://www.moneycontrol.com/news/business/coal-india-bags-first-critical-mineral-asset-12774631.html","title":"Coal India bags first critical mineral asset","description":"Owning a graphite asset will give Coal India an advantage in powering green energy transition momentum to an extent, according to a statement.Coal India bags first critical mineral assetRelated stories","content":"State-owned Coal India on Monday said it has bagged the first critical mineral asset, a graphite block, in Madhya Pradesh. Owning a graphite asset will give Coal India an advantage in powering green energy transition momentum to an extent, according to a statement. \"Coal India Ltd (CIL) has successfully opened its account in domestic critical mineral asset emerging as the preferred bidder for Khattali Chotti graphite block in Alirajpur district of Madhya Pradesh,\" the PSU said in the statement. With the bagging of this mine, CIL has made its foray into the first-ever non-coal mineral mining venture, the coal behemoth said. \"This was under tranche two forward auction held on 9th July by the Ministry of Mines,\" it said. The company won the bid quoting a mining premium of 150.05 per cent of the value of mineral despatch, which it would pay to the state. CIL will formally receive the letter of intent once it deposits performance security. Further, a composite license will be issued to CIL in a year after the company meets the formalities under the notice inviting tender timeline. The block was put for sale in the second tranche of the critical mine auction. \"CIL under its diversification portfolio won the bid. With this, CIL is poised to play a supporting role in critical minerals domestically,\" it said. The country imports about 69 per cent of its graphite needs - natural, synthetic and end-use products. Currently, the graphite mining industry has limited players, offering space for willing players to venture into this business arena. Graphite has its utility as an anode material in lithium-ion battery manufacturing due to its relatively low cost and energy density. With the electric vehicle market and energy storage systems fast gaining traction, where lithium-ion cells are used, graphite has a big market. The market size for graphite is projected to take a big leap with the absolute demand projected to shoot up at the rate of 25-27 per cent by FY35 from the current level. The PSU had earlier said it is mulling the mining of critical minerals. ","cleaned_content":"state owned coal india on monday said it has bagged the first critical mineral asset a graphite block in madhya pradesh owning a graphite asset will give coal india an advantage in powering green energy transition momentum to an extent according to a statement coal india ltd cil has successfully opened its account in domestic critical mineral asset emerging as the preferred bidder for khattali chotti graphite block in alirajpur district of madhya pradesh the psu said in the statement with the bagging of this mine cil has made its foray into the first ever non coal mineral mining venture the coal behemoth said this was under tranche two forward auction held on \u003cNINE_\u003e th july by the ministry of mines it said the company won the bid quoting a mining premium of \u003cONE_HUNDRED_PERCENT\u003e of the value of mineral despatch which it would pay to the state cil will formally receive the letter of intent once it deposits performance security further a composite license will be issued to cil in a year after the company meets the formalities under the notice inviting tender timeline the block was put for sale in the second tranche of the critical mine auction cil under its diversification portfolio won the bid with this cil is poised to play a supporting role in critical minerals domestically it said the country imports about \u003cSIX_TEN_PERCENT\u003e of its graphite needs natural synthetic and end use products currently the graphite mining industry has limited players offering space for willing players to venture into this business arena graphite has its utility as an anode material in lithium ion battery manufacturing due to its relatively low cost and energy density with the electric vehicle market and energy storage systems fast gaining traction where lithium ion cells are used graphite has a big market the market size for graphite is projected to take a big leap with the absolute demand projected to shoot up at the rate of \u003cTWO_TEN\u003e \u003cTWO_TEN_PERCENT\u003e by fy35 from the current level the psu had earlier said it is mulling the mining of critical minerals","timestamp":"2024-07-22T13:59:00+05:30","market_timestamp":"2024-07-22T13:59:00+05:30","off_market_hours":false}