{"url":"https://www.moneycontrol.com/news/business/hdfc-banks-unit-seeks-up-to-300-million-in-offshore-loan-12774418.html","title":"HDFC Bank’s unit seeks up to $300 million in offshore loan","description":"HDB Financial Services Ltd. is in talks with a group of global and local banks to finalize the terms, said the people, who asked not to be identified because the discussions are private. HDFC Bank’s unit seeks up to $300 million in offshore loan","content":"A unit of HDFC Bank Ltd., India’s largest private sector lender, is planning to borrow as much as $300 million, according to people familiar with the matter, as tighter rules by the nation’s central bank restrict domestic avenues. HDB Financial Services Ltd. is in talks with a group of global and local banks to finalize the terms, said the people, who asked not to be identified because the discussions are private. Non-banking finance companies are increasingly tapping credit market overseas after the Reserve Bank of India limited domestic funding sources for them. Manappuram Finance Ltd., Muthoot Finance Ltd. and Piramal Capital \u0026 Housing Finance Ltd. are among shadow financiers who have borrowed overseas this year. The final terms could change as the borrower aims to sign the deal bilaterally with one of the banks it is currently in talks with, the people said. HDB Financial did not respond to Bloomberg’s request for comment. ","cleaned_content":"a unit of hdfc bank ltd india s largest private sector lender is planning to borrow as much as \u003cTHREE_HUNDRED\u003e million according to people familiar with the matter as tighter rules by the nation s central bank restrict domestic avenues hdb financial services ltd is in talks with a group of global and local banks to finalize the terms said the people who asked not to be identified because the discussions are private non banking finance companies are increasingly tapping credit market overseas after the reserve bank of india limited domestic funding sources for them manappuram finance ltd muthoot finance ltd and piramal capital housing finance ltd are among shadow financiers who have borrowed overseas this year the final terms could change as the borrower aims to sign the deal bilaterally with one of the banks it is currently in talks with the people said hdb financial did not respond to bloomberg s request for comment","timestamp":"2024-07-22T11:54:00+05:30","market_timestamp":"2024-07-22T11:54:00+05:30","off_market_hours":false}