{"url":"https://www.moneycontrol.com/news/business/dlf-sales-bookings-jump-over-3-fold-to-rs-6404-crore-in-q1-on-high-demand-for-luxury-homes-12778884.html","title":"DLF sales bookings jump over 3-fold to Rs 6,404 crore in Q1 on high demand for luxury homes","description":"The company had sold properties worth Rs 2,040 crore in the year-ago period.DLF sales bookings jump over 3-fold to Rs 6,404 crore in Q1 on high demand for luxury homesRelated stories","content":"Realty major DLF's sales bookings jumped over three-fold to Rs 6,404 crore during the first quarter of this fiscal on strong demand for its luxury housing properties. The company had sold properties worth Rs 2,040 crore in the year-ago period. DLF has given guidance to achieve Rs 17,000 crore worth of sales bookings for the entire 2024-25 financial year as against nearly Rs 15,000 crore in the preceding year. In its super-luxury housing project 'The Camellias' at DLF 5, Gurugram, the company sold 4 units for Rs 251 crore. On Thursday, DLF reported a 23 per cent increase in its consolidated profit to Rs 645.61 crore in the first quarter of this fiscal. Its net profit stood at Rs 527 crore in the year-ago period. Total income rose to Rs 1,729.82 crore during the April-June period of this fiscal from Rs 1,521.71 crore in the corresponding period of the previous year. In a statement on Thursday, DLF said, \"We believe that the residential segment is witnessing a structural upcycle and hence we continue to strengthen our new product pipeline.\" \"We stay committed towards leveraging this positive momentum and have planned a strong launch pipeline of an additional 9 million square feet of new products during the fiscal, across various segments and geographies including Gurugram, Mumbai, Goa and Chandigarh Tri-city,\" the company added. The company said it continues to witness healthy sales momentum and strong growth in collections leading to further improvement in its net cash position.\"Our rental business continued its steady performance during the period,\" DLF said. DLF's rental arm DLF Cyber City Developers Ltd (DCCDL) revenue stood at Rs 1,553 crore, reflecting (year-on-year) y-o-y growth of 10 per cent while consolidated profit for the quarter stood at Rs 470 crore, registering a y-o-y growth of 20 per cent. \"We continue to have a positive outlook on the rental business and are accelerating our capex commitments to further strengthen our rental portfolio and deliver healthy growth,\" the company said. DLF is India's leading real estate developer and has more than seven decades of track record. It has developed more than 178 real estate projects and developed an area in excess of 349 million square feet. DLF Group has 220 million square feet of development potential across residential and commercial segments. The group has an annuity portfolio (office and retail real estate spaces) of over 44 million square feet. DLF is primarily engaged in the business of developing and selling residential properties (Development Business) and developing and leasing commercial and retail properties (Annuity Business). ","cleaned_content":"realty major dlfs sales bookings jumped over three fold to rs \u003cSIX_THOUSAND\u003e crore during the first quarter of this fiscal on strong demand for its luxury housing properties the company had sold properties worth rs \u003cTWO_THOUSAND\u003e crore in the year ago period dlf has given guidance to achieve rs \u003cONE_TEN_THOUSAND\u003e crore worth of sales bookings for the entire \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e financial year as against nearly rs \u003cONE_TEN_THOUSAND\u003e crore in the preceding year in its super luxury housing project the camellias at dlf \u003cFIVE_\u003e gurugram the company sold \u003cFOUR_\u003e units for rs \u003cTWO_HUNDRED\u003e crore on thursday dlf reported a \u003cTWO_TEN_PERCENT\u003e increase in its consolidated profit to rs \u003cSIX_HUNDRED\u003e crore in the first quarter of this fiscal its net profit stood at rs \u003cFIVE_HUNDRED\u003e crore in the year ago period total income rose to rs \u003cONE_THOUSAND\u003e crore during the april june period of this fiscal from rs \u003cONE_THOUSAND\u003e crore in the corresponding period of the previous year in a statement on thursday dlf said we believe that the residential segment is witnessing a structural upcycle and hence we continue to strengthen our new product pipeline we stay committed towards leveraging this positive momentum and have planned a strong launch pipeline of an additional \u003cNINE_\u003e million square feet of new products during the fiscal across various segments and geographies including gurugram mumbai goa and chandigarh tri city the company added the company said it continues to witness healthy sales momentum and strong growth in collections leading to further improvement in its net cash position our rental business continued its steady performance during the period dlf said dlfs rental arm dlf cyber city developers ltd dccdl revenue stood at rs \u003cONE_THOUSAND\u003e crore reflecting year on year y o y growth of \u003cONE_TEN_PERCENT\u003e while consolidated profit for the quarter stood at rs \u003cFOUR_HUNDRED\u003e crore registering a y o y growth of \u003cTWO_TEN_PERCENT\u003e we continue to have a positive outlook on the rental business and are accelerating our capex commitments to further strengthen our rental portfolio and deliver healthy growth the company said dlf is indias leading real estate developer and has more than seven decades of track record it has developed more than \u003cONE_HUNDRED\u003e real estate projects and developed an area in excess of \u003cTHREE_HUNDRED\u003e million square feet dlf group has \u003cTWO_HUNDRED\u003e million square feet of development potential across residential and commercial segments the group has an annuity portfolio office and retail real estate spaces of over \u003cFOUR_TEN\u003e million square feet dlf is primarily engaged in the business of developing and selling residential properties development business and developing and leasing commercial and retail properties annuity business","timestamp":"2024-07-26T09:43:00+05:30","market_timestamp":"2024-07-26T09:43:00+05:30","off_market_hours":false}