{"url":"https://www.moneycontrol.com/news/business/paytm-partners-with-axis-bank-to-offer-pos-solutions-card-payment-devices-12775596.html","title":"Paytm partners with Axis Bank to offer POS solutions, card payment devices","description":"Paytm's EDC devices (card machines) come equipped with an integrated software that offers complete store management services, including inventory management, invoice generation, promotions and discounts, sales tracking and reporting, CRM, etc, the company said in a regulatory filing.Paytm partners with Axis Bank to offer POS solutions, card payment devices","content":"Fintech firm One 97 Communications, which owns the brand Paytm, has partnered with Axis Bank to provide point of sales solutions and card payment machines to banks and its merchant network, the company said on Tuesday. Paytm's EDC devices (card machines) come equipped with an integrated software that offers complete store management services, including inventory management, invoice generation, promotions and discounts, sales tracking and reporting, CRM, etc, the company said in a regulatory filing. \"By integrating our POS solutions and EDC devices (card machines) with Axis Bank's expansive merchant network, we are enhancing transaction efficiency and providing comprehensive store management services. This partnership extends our reach and strengthens customer engagement and satisfaction, ultimately supporting merchants in growing their businesses,\" Paytm spokesperson said. For Axis Bank, this collaboration strengthens their merchant acquiring portfolio, enabling them to offer payment solutions, the filing said. \"We are happy to support Paytm in the EDC business. This partnership enables us to extend our relevant business offerings to a larger base of merchants and this is an exciting milestone to build upon,\" Sanjeev Moghe, President \u0026 Head, Cards \u0026 Payments, Axis Bank, said. ","cleaned_content":"fintech firm one \u003cNINE_TEN\u003e communications which owns the brand paytm has partnered with axis bank to provide point of sales solutions and card payment machines to banks and its merchant network the company said on tuesday paytms edc devices card machines come equipped with an integrated software that offers complete store management services including inventory management invoice generation promotions and discounts sales tracking and reporting crm etc the company said in a regulatory filing by integrating our pos solutions and edc devices card machines with axis banks expansive merchant network we are enhancing transaction efficiency and providing comprehensive store management services this partnership extends our reach and strengthens customer engagement and satisfaction ultimately supporting merchants in growing their businesses paytm spokesperson said for axis bank this collaboration strengthens their merchant acquiring portfolio enabling them to offer payment solutions the filing said we are happy to support paytm in the edc business this partnership enables us to extend our relevant business offerings to a larger base of merchants and this is an exciting milestone to build upon sanjeev moghe president head cards payments axis bank said","timestamp":"2024-07-23T10:59:00+05:30","market_timestamp":"2024-07-23T10:59:00+05:30","off_market_hours":false}