{"url":"https://www.moneycontrol.com/news/business/india-may-send-tax-notices-to-more-it-majors-after-4-billion-demand-to-infosys-report-12784387.html","title":"After Infosys, GST demand notices to more IT majors possible, says report","description":"In serving its highest ever tax demand on Infosys, the government accused India's second largest tech services company of evading taxes on such services, and sought 320 billion rupees, or almost all its revenue for the quarter ended June 30.India may send tax notices to more IT majors after $4-billion demand to Infosys: ReportRelated stories","content":"The tax department may issue notices to other infotech players as well, news agency Reuters reported citing a government source, amid scrutiny of alleged service tax evasion by their overseas offices, a day after Infosys faced the tax demand. \"This is an industry-wide issue,\" a senior tax official familiar with the developments told Reuters, implying notices may be sent to other IT companies too. India's second-largest IT company Infosys was slapped with a tax demand for alleged evasion of over Rs 32,000 crore from the Directorate General of GST Intelligence (DGGI), as per a document seen by Moneycontrol. The document said Infosys was including expenses incurred towards overseas branches as part of their export invoice and computing the eligible refund based on that. \"Issuing such a substantial show-cause notice is likely to set a precedent, leading to similar notices being issued to other multinational companies, particularly in the IT sector,\" Rajat Mohan, director at accounting firm MOORE Singhi told Reuters. Infosys clarified that it has paid all dues and GST is not applicable on expenses claimed by DGGI. \"Infosys has paid all its GST dues and is fully in compliance with the central and state regulations on this matter,\" the company said in a statement. Former Infosys board member and Chief Financial Officer Mohandas Pai called the Rs 32,000 crore GST demand as 'tax terrorism' at its worst. \"This is a business model issue, not a tax evasion issue,\" he added. Shares of Infosys have been subdued in trade on August 1, weighed down by the tax demand. ","cleaned_content":"the tax department may issue notices to other infotech players as well news agency reuters reported citing a government source amid scrutiny of alleged service tax evasion by their overseas offices a day after infosys faced the tax demand this is an industry wide issue a senior tax official familiar with the developments told reuters implying notices may be sent to other it companies too indias second largest it company infosys was slapped with a tax demand for alleged evasion of over rs \u003cTHREE_TEN_THOUSAND\u003e crore from the directorate general of gst intelligence dggi as per a document seen by moneycontrol the document said infosys was including expenses incurred towards overseas branches as part of their export invoice and computing the eligible refund based on that issuing such a substantial show cause notice is likely to set a precedent leading to similar notices being issued to other multinational companies particularly in the it sector rajat mohan director at accounting firm moore singhi told reuters infosys clarified that it has paid all dues and gst is not applicable on expenses claimed by dggi infosys has paid all its gst dues and is fully in compliance with the central and state regulations on this matter the company said in a statement former infosys board member and chief financial officer mohandas pai called the rs \u003cTHREE_TEN_THOUSAND\u003e crore gst demand as tax terrorism at its worst this is a business model issue not a tax evasion issue he added shares of infosys have been subdued in trade on august \u003cONE_\u003e weighed down by the tax demand","timestamp":"2024-08-01T14:20:00+05:30","market_timestamp":"2024-08-01T14:20:00+05:30","off_market_hours":false}