{"url":"https://www.moneycontrol.com/news/business/toyota-to-set-up-manufacturing-plant-in-maharashtra-likely-to-invest-rs-20000-crore-12783323.html","title":"Toyota to set up manufacturing plant in Maharashtra; likely to invest Rs 20,000 crore","description":"The company has inked a Memorandum of Understanding (MoU) with the Maharashtra government to examine the setting up of a greenfield manufacturing facility at Chhatrapati Sambhaji Nagar, Toyota Kirloskar Motor (TKM) said in a statement.In a social media post on X, Maharashtra Deputy Chief Minister Devendra Fadnavis shared the investment figure of Rs 20,000 crore for the plantRelated stories","content":"Automaker Toyota Kirloskar Motor on Wednesday said it will set up a new manufacturing plant in Maharashtra at an investment of around Rs 20,000 crore. The company has inked a Memorandum of Understanding (MoU) with the Maharashtra government to examine the setting up of a greenfield manufacturing facility at Chhatrapati Sambhaji Nagar, Toyota Kirloskar Motor (TKM) said in a statement. Headquartered in Karnataka, TKM already has two manufacturing units located at Bidadi near Bengaluru. \"Today's MoU signing marks a pivotal point as we stride into the next phase of growth in the country enabling us to contribute to enriching lives with qualitative mobility solutions locally and globally,\" TKM Managing Director and Chief Executive Officer Masakazu Yoshimura said. The proposed investment, once finalised, is expected to be made over a multi-year period, potentially contributing to substantial job creation and economic growth in the region. In a social media post on X, Maharashtra Deputy Chief Minister Devendra Fadnavis shared the investment figure of Rs 20,000 crore for the plant. \"Transforming Maharashtra, Developing Marathwada!Reaffirming its commitment to India; Toyota Kirloskar Motors is set to launch a Green Field Manufacturing Facility in Maharashtra!\" he posted. TKM currently has an installed production capacity of 3.42 lakh vehicles at its two Bidadi-based units. ","cleaned_content":"automaker toyota kirloskar motor on wednesday said it will set up a new manufacturing plant in maharashtra at an investment of around rs \u003cTWO_TEN_THOUSAND\u003e crore the company has inked a memorandum of understanding mou with the maharashtra government to examine the setting up of a greenfield manufacturing facility at chhatrapati sambhaji nagar toyota kirloskar motor tkm said in a statement headquartered in karnataka tkm already has two manufacturing units located at bidadi near bengaluru todays mou signing marks a pivotal point as we stride into the next phase of growth in the country enabling us to contribute to enriching lives with qualitative mobility solutions locally and globally tkm managing director and chief executive officer masakazu yoshimura said the proposed investment once finalised is expected to be made over a multi year period potentially contributing to substantial job creation and economic growth in the region in a social media post on x maharashtra deputy chief minister devendra fadnavis shared the investment figure of rs \u003cTWO_TEN_THOUSAND\u003e crore for the plant transforming maharashtra developing marathwada reaffirming its commitment to india toyota kirloskar motors is set to launch a green field manufacturing facility in maharashtra he posted tkm currently has an installed production capacity of \u003cTHREE_\u003e lakh vehicles at its two bidadi based units","timestamp":"2024-07-31T14:06:00+05:30","market_timestamp":"2024-07-31T14:06:00+05:30","off_market_hours":false}