{"url":"https://www.moneycontrol.com/news/business/honeywell-signs-long-term-maintenance-deal-with-air-india-12780909.html","title":"Honeywell signs long-term maintenance deal with Air India","description":"The pact for the aftermarket support to Honeywell APUs, which will help the airline reduce unplanned maintenance cost and downtime and, in turn, ensure high aircraft dispatch and fleet availability, the Nasdaq-listed company said.Honeywell signs long-term maintenance deal with Air India","content":"Global conglomerate Honeywell on Monday said it has inked a long-term pact with Tata Group-owned Air India for the maintenance of the Auxiliary Power Units (APUs) for the airline's existing and new aircraft fleet. The pact for the aftermarket support to Honeywell APUs, which will help the airline reduce unplanned maintenance cost and downtime and, in turn, ensure high aircraft dispatch and fleet availability, the Nasdaq-listed company said. The APU is a critical piece of aircraft equipment that provides electrical power and air conditioning to a plane while it is on the ground. It helps ensure passenger comfort and supplies the air source before a pilot is ready to start the main engines. \"We are strengthening our collaboration with Air India and helping in its fleet modernisation efforts, as part of a long-standing commitment to supporting the carrier's innovation and growth objectives,\" said Ashish Modi, President of Honeywell India. \"This agreement forms part of our global growth and transformation plans, to help achieve more efficient, reliable operations, with maximised fleet availability, through Honeywell's advanced technology services,\" said Sisira Kanta Dash, chief technical officer, Air India. ","cleaned_content":"global conglomerate honeywell on monday said it has inked a long term pact with tata group owned air india for the maintenance of the auxiliary power units apus for the airlines existing and new aircraft fleet the pact for the aftermarket support to honeywell apus which will help the airline reduce unplanned maintenance cost and downtime and in turn ensure high aircraft dispatch and fleet availability the nasdaq listed company said the apu is a critical piece of aircraft equipment that provides electrical power and air conditioning to a plane while it is on the ground it helps ensure passenger comfort and supplies the air source before a pilot is ready to start the main engines we are strengthening our collaboration with air india and helping in its fleet modernisation efforts as part of a long standing commitment to supporting the carriers innovation and growth objectives said ashish modi president of honeywell india this agreement forms part of our global growth and transformation plans to help achieve more efficient reliable operations with maximised fleet availability through honeywells advanced technology services said sisira kanta dash chief technical officer air india","timestamp":"2024-07-29T11:49:00+05:30","market_timestamp":"2024-07-29T11:49:00+05:30","off_market_hours":false}