{"url":"https://www.moneycontrol.com/news/business/facing-insolvency-byjus-hit-with-new-challenge-from-lenders-12785494.html","title":"Facing insolvency, Byju's hit with new challenge from lenders","description":"By Arpan  ChaturvediNEW DELHI      U.S.-based Glas Trust is asking an Indian court to not quash insolvency proceedings for ed-tech giant Byju's as ..Facing insolvency, Byju's hit with new challenge from lendersRelated stories","content":"U.S.-based Glas Trust is asking an Indian court to not quash insolvency proceedings for ed-tech giant Byju's as lenders the trust represents are owed $1 billion, posing a new challenge for the Indian startup that was once the nation's biggest. Byju's was valued at $22 billion in 2022 before being hit with many setbacks including boardroom exits, an auditor resignation and a public spat with foreign investors over mismanagement. The company has denied any wrongdoing. Byju's is facing insolvency proceedings after India's cricket board said it was not paid $19 million in sponsorship dues. Its former billionaire CEO Byju Raveendran wants the insolvency quashed as his co-founder brother decided to pay the cricket board, settling the matter. Byju Raveendran hasn't commented on the matter. But Riju in a separate court filing dated Aug. 1 and seen by Reuters, said he paid the cricket board's settlement amount from \"personal funds\" and the liquidation of personal assets. A judge is likely to rule on the matter on Friday. Raveendran and a spokesperson for Byju's did not respond to a request for comment. Glas Trust also did not respond. Byju's, which operates in more than 21 countries, became popular during the COVID-19 pandemic by offering online education courses. A ruling by the Indian court in favour of Glas could renew problems for the ed-tech company despite the settlement with the cricket body and means its assets would remain frozen. Raveendran has warned that insolvency would lead to \"a total shut down of services\" and could trigger an employee exodus. Byju's has around 27,000 employees, including 16,000 teachers. ","cleaned_content":"u s based glas trust is asking an indian court to not quash insolvency proceedings for ed tech giant byjus as lenders the trust represents are owed \u003cONE_\u003e billion posing a new challenge for the indian startup that was once the nations biggest byjus was valued at \u003cTWO_TEN\u003e billion in \u003cTWO_THOUSAND\u003e before being hit with many setbacks including boardroom exits an auditor resignation and a public spat with foreign investors over mismanagement the company has denied any wrongdoing byjus is facing insolvency proceedings after indias cricket board said it was not paid \u003cONE_TEN\u003e million in sponsorship dues its former billionaire ceo byju raveendran wants the insolvency quashed as his co founder brother decided to pay the cricket board settling the matter byju raveendran hasnt commented on the matter but riju in a separate court filing dated aug \u003cONE_\u003e and seen by reuters said he paid the cricket boards settlement amount from personal funds and the liquidation of personal assets a judge is likely to rule on the matter on friday raveendran and a spokesperson for byjus did not respond to a request for comment glas trust also did not respond byjus which operates in more than \u003cTWO_TEN\u003e countries became popular during the covid \u003cONE_TEN\u003e pandemic by offering online education courses a ruling by the indian court in favour of glas could renew problems for the ed tech company despite the settlement with the cricket body and means its assets would remain frozen raveendran has warned that insolvency would lead to a total shut down of services and could trigger an employee exodus byjus has around \u003cTWO_TEN_THOUSAND\u003e employees including \u003cONE_TEN_THOUSAND\u003e teachers","timestamp":"2024-08-02T12:52:00+05:30","market_timestamp":"2024-08-02T12:52:00+05:30","off_market_hours":false}