{"url":"https://www.moneycontrol.com/news/business/billionaire-battle-heats-up-as-adani-challenges-birla-in-cement-12780588.html","title":"Billionaire battle heats up as Adani challenges Birla in cement","description":"The clash of titans is likely to intensify as the deep-pocketed tycoons seek to dominate supplies of a building material that is critical to sustaining India’s infrastructure boom. Billionaire battle heats up as Adani challenges Birla in cementRelated stories","content":"Battle lines are being drawn in India’s cement space as Gautam Adani’s expansion spree sets off a race with fellow billionaire Kumar Mangalam Birla’s UltraTech Cement Ltd. to build capacity and snap up assets. The clash of titans is likely to intensify as the deep-pocketed tycoons seek to dominate supplies of a building material that is critical to sustaining India’s infrastructure boom. Adani’s ambitious upstart and the sector leader UltraTech have already done six deals in less than two years, with Birla’s cement maker announcing the seventh on Sunday to control a coveted regional player. At least half a dozen smaller rivals are still up for grabs. Adani Group’s big bang entry in 2022 upended the local pecking order — it became No. 2 cement maker overnight with the acquisition of Ambuja Cements Ltd. and ACC Ltd. — but it spent much of 2023 fire-fighting after Hindenburg Research’s scathing report. The ports-to-power conglomerate only got back to its expansionist ways fully this year, stoking a turf war in cement as Birla’s entrenched incumbent digs in its heels. M\u0026A WarchestAdani, already down four acquisitions in the sector since it entered, is looking to double annual production capacity to 140 million tons by 2028. The group is scouting for more cement assets to expand its reach, procure key raw material — limestone reserves — and has a war chest of about $4.5 billion for acquisitions over the next two years, according to people familiar with the discussions who spoke on the condition of anonymity. The Adani Group, which controls India’s largest private sector port operator, is aiming to drive down costs significantly even if it can’t match the cost efficiency of Chinese cement makers, one person said. Sea or inland water transportation costs a fraction of transport via trucks and Adani Ports \u0026 Special Economic Zone Ltd.’s network will be helpful there, this person added. Adani Ports is already planning a 2-million-ton cement grinding unit at its transshipment terminal in Kerala. Green energy from group firms can help pare fuel costs, the person said. Leadership Moat To bolster the moat around its leadership, UltraTech acquired a smaller rival last year. In June, it bought a minority stake in a Chennai-based cement maker in June before ramping it up to majority control this week —  a move seen as marking its territory to fend off Adani. It’s also circling another target. Birla’s cement giant will continue to expand operations and snap up assets to reach 200 million tons annual capacity by 2027, people familiar with Birla’s strategy said. Representatives for the Adani Group declined to comment while those for UltraTech didn’t respond to an emailed request for comments. Mission to BuildPrime Minister Narendra Modi’s mission to build everything from airport and power facilities to roads, bridges and tunnels will spur India’s infrastructure investment to 15 trillion rupees ($179.2 billion) by March 2026, according to Crisil Ratings. This will spawn massive demand for cement, outpacing supply in the coming years and creating opportunities for expansion that neither Adani, Asia’s second-richest person, nor Birla can resist. Adani, which acquired Penna Cement Industries Ltd. last month, has looked at Jaypee Group’s as well as Orient Cement Ltd. in the recent past, according to local media reports. Orient Cement has now drawn interest from UltraTech also. Others such as Saurashtra Cement Ltd., Mangalam Cement Ltd., Vadraj Cement Ltd. and Bagalkot Cement Industries Ltd. may also emerge as targets, people familiar said.  The southern parts of India is the most fragmented market for cement in the country, with the highest installed capacity and a large number of firms which have not expanded capacity over the years, Sanjeev Kumar Singh and Mudit Agarwal, analysts at Motilal Oswal Financial Services Ltd. wrote in a July report. “It is possible that a few of these entities might consider exiting the industry if they are offered favorable valuations,” Singh and Agarwal wrote. Hunting GroundThat makes this geography the perfect hunting ground for both the billionaires, who have already begun cliching deals. Adani’s Penna Cement purchase in June was to boost its footprint in southern India. Days later, UltraTech bought a 23% stake in India Cements Ltd., a Chennai-based firm with almost 14.5 million tons capacity, in a move to block any possible Adani overtures. On Sunday, Birla’s firm bought almost a third more of India Cements for $472 million, pushing its total stake past 55%. It “enables UltraTech to serve the southern markets more effectively” and expedites the path to 200 million tons target, Birla said in a statement Sunday. “The pace of acquisitions in the cement industry was inevitable because of government spending in infrastructure and housing,”said Aveek Mitra, New Delhi-based founder of Aveksat Investment Advisory. India has about 100 listed and closely held cement makers, with most having tiny market shares, according to Mitra. “Asset block of 28 million tons is in pipeline for acquisition” and M\u0026A deals will continue since the large incumbent players want to maintain their market share, Anupama Reddy, co-group head of corporate ratings at ICRA Ltd. wrote in a June 13 note.  To be sure, even with all the aggressive expansion it’d still be hard for Adani to topple UltraTech. The gap between the two rivals is significant and will remain so, based on announced capacity additions. Anti-Trust ScrutinyAdani and UltraTech will also need to be mindful of scrutiny from India’s anti-trust watchdog and avoid acquisitions in geographies where they have high market share concentration. While cement demand is strong now, it could reduce in four or five years, according to Jyoti Gupta, a research analyst at Nirmal Bang Institutional Equities. Smaller players like Dalmia Bharat Ltd., Shree Cement Ltd. and JSW Cement Ltd. are also scaling up. “When infrastructure spending will reduce, and there is ample supply of residential properties, will there be enough demand to utilize all this added capacity?” Gupta said. ","cleaned_content":"battle lines are being drawn in india s cement space as gautam adani s expansion spree sets off a race with fellow billionaire kumar mangalam birla s ultratech cement ltd to build capacity and snap up assets the clash of titans is likely to intensify as the deep pocketed tycoons seek to dominate supplies of a building material that is critical to sustaining india s infrastructure boom adani s ambitious upstart and the sector leader ultratech have already done six deals in less than two years with birla s cement maker announcing the seventh on sunday to control a coveted regional player at least half a dozen smaller rivals are still up for grabs adani group s big bang entry in \u003cTWO_THOUSAND\u003e upended the local pecking order it became no \u003cTWO_\u003e cement maker overnight with the acquisition of ambuja cements ltd and acc ltd but it spent much of \u003cTWO_THOUSAND\u003e fire fighting after hindenburg research s scathing report the ports to power conglomerate only got back to its expansionist ways fully this year stoking a turf war in cement as birla s entrenched incumbent digs in its heels m a warchestadani already down four acquisitions in the sector since it entered is looking to double annual production capacity to \u003cONE_HUNDRED\u003e million tons by \u003cTWO_THOUSAND\u003e the group is scouting for more cement assets to expand its reach procure key raw material limestone reserves and has a war chest of about \u003cFOUR_\u003e billion for acquisitions over the next two years according to people familiar with the discussions who spoke on the condition of anonymity the adani group which controls india s largest private sector port operator is aiming to drive down costs significantly even if it can t match the cost efficiency of chinese cement makers one person said sea or inland water transportation costs a fraction of transport via trucks and adani ports special economic zone ltd s network will be helpful there this person added adani ports is already planning a \u003cTWO_\u003e million ton cement grinding unit at its transshipment terminal in kerala green energy from group firms can help pare fuel costs the person said leadership moat to bolster the moat around its leadership ultratech acquired a smaller rival last year in june it bought a minority stake in a chennai based cement maker in june before ramping it up to majority control this week a move seen as marking its territory to fend off adani it s also circling another target birla s cement giant will continue to expand operations and snap up assets to reach \u003cTWO_HUNDRED\u003e million tons annual capacity by \u003cTWO_THOUSAND\u003e people familiar with birla s strategy said representatives for the adani group declined to comment while those for ultratech didn t respond to an emailed request for comments mission to buildprime minister narendra modi s mission to build everything from airport and power facilities to roads bridges and tunnels will spur india s infrastructure investment to \u003cONE_TEN\u003e trillion rupees \u003cONE_HUNDRED\u003e billion by march \u003cTWO_THOUSAND\u003e according to crisil ratings this will spawn massive demand for cement outpacing supply in the coming years and creating opportunities for expansion that neither adani asia s second richest person nor birla can resist adani which acquired penna cement industries ltd last month has looked at jaypee group s as well as orient cement ltd in the recent past according to local media reports orient cement has now drawn interest from ultratech also others such as saurashtra cement ltd mangalam cement ltd vadraj cement ltd and bagalkot cement industries ltd may also emerge as targets people familiar said the southern parts of india is the most fragmented market for cement in the country with the highest installed capacity and a large number of firms which have not expanded capacity over the years sanjeev kumar singh and mudit agarwal analysts at motilal oswal financial services ltd wrote in a july report it is possible that a few of these entities might consider exiting the industry if they are offered favorable valuations singh and agarwal wrote hunting groundthat makes this geography the perfect hunting ground for both the billionaires who have already begun cliching deals adani s penna cement purchase in june was to boost its footprint in southern india days later ultratech bought a \u003cTWO_TEN_PERCENT\u003e stake in india cements ltd a chennai based firm with almost \u003cONE_TEN\u003e million tons capacity in a move to block any possible adani overtures on sunday birla s firm bought almost a third more of india cements for \u003cFOUR_HUNDRED\u003e million pushing its total stake past \u003cFIVE_TEN_PERCENT\u003e it enables ultratech to serve the southern markets more effectively and expedites the path to \u003cTWO_HUNDRED\u003e million tons target birla said in a statement sunday the pace of acquisitions in the cement industry was inevitable because of government spending in infrastructure and housing said aveek mitra new delhi based founder of aveksat investment advisory india has about \u003cONE_HUNDRED\u003e listed and closely held cement makers with most having tiny market shares according to mitra asset block of \u003cTWO_TEN\u003e million tons is in pipeline for acquisition and m a deals will continue since the large incumbent players want to maintain their market share anupama reddy co group head of corporate ratings at icra ltd wrote in a june \u003cONE_TEN\u003e note to be sure even with all the aggressive expansion it d still be hard for adani to topple ultratech the gap between the two rivals is significant and will remain so based on announced capacity additions anti trust scrutinyadani and ultratech will also need to be mindful of scrutiny from india s anti trust watchdog and avoid acquisitions in geographies where they have high market share concentration while cement demand is strong now it could reduce in four or five years according to jyoti gupta a research analyst at nirmal bang institutional equities smaller players like dalmia bharat ltd shree cement ltd and jsw cement ltd are also scaling up when infrastructure spending will reduce and there is ample supply of residential properties will there be enough demand to utilize all this added capacity gupta said","timestamp":"2024-07-29T07:01:00+05:30","market_timestamp":"2024-07-29T09:15:00+05:30","off_market_hours":true}