{"url":"https://www.moneycontrol.com/news/business/pnb-hikes-lending-rate-by-5-bps-across-tenors-12784362.html","title":"PNB hikes lending rate by 5 bps across tenors","description":"The benchmark one-year tenor MCLR, which is used to price most consumer loans such as auto and personal, will be at 8.90 per cent against the earlier rate of 8.85 per cent, PNB said in a regulatory filing.PNB hikes lending rate by 5 bps across tenors","content":"State-owned Punjab National Bank on Thursday raised the marginal cost of funds-based lending rate (MCLR) by 0.05 per cent, or 5 basis points, across tenors, making most of the consumer loans costlier. The benchmark one-year tenor MCLR, which is used to price most consumer loans such as auto and personal, will be at 8.90 per cent against the earlier rate of 8.85 per cent, PNB said in a regulatory filing. The three-year MCLR stands at 9.20 per cent, up 5 basis points. The MCLR on overnight tenor will be 8.30 per cent against 8.25 per cent. The new rates are effective from August 1, 2024. On Wednesday, another public sector lender Bank of India also announced an increase in MCLR by 5 basis points for one year tenor to 8.95 per cent. However, the rates were unchanged for the remaining tenors. ","cleaned_content":"state owned punjab national bank on thursday raised the marginal cost of funds based lending rate mclr by \u003cZERO_PERCENT\u003e or \u003cFIVE_\u003e basis points across tenors making most of the consumer loans costlier the benchmark one year tenor mclr which is used to price most consumer loans such as auto and personal will be at \u003cEIGHT_PERCENT\u003e against the earlier rate of \u003cEIGHT_PERCENT\u003e pnb said in a regulatory filing the three year mclr stands at \u003cNINE_PERCENT\u003e up \u003cFIVE_\u003e basis points the mclr on overnight tenor will be \u003cEIGHT_PERCENT\u003e against \u003cEIGHT_PERCENT\u003e the new rates are effective from august \u003cONE_\u003e \u003cTWO_THOUSAND\u003e on wednesday another public sector lender bank of india also announced an increase in mclr by \u003cFIVE_\u003e basis points for one year tenor to \u003cEIGHT_PERCENT\u003e however the rates were unchanged for the remaining tenors","timestamp":"2024-08-01T13:25:00+05:30","market_timestamp":"2024-08-01T13:25:00+05:30","off_market_hours":false}