{"url":"https://www.moneycontrol.com/news/business/jms-group-to-invest-rs-400-crore-to-develop-housing-project-in-gurugram-12781239.html","title":"JMS Group to invest Rs 400 crore to develop housing project in Gurugram","description":"The company has acquired 8.65 acre of prime land in Sector 95, New Gurugram, according to a statement. It will develop around 450 units in this housing project.JMS Group to invest Rs 400 crore to develop housing project in Gurugram","content":"Realty firm JMS Group on Monday said it will invest Rs 400 crore to develop a group housing project in Gurugram. The company has acquired 8.65 acre of prime land in Sector 95, New Gurugram, according to a statement. It will develop around 450 units in this housing project. \"Upon completion, the upcoming project is projected to generate revenues nearing 1,000 crore...The company has allocated an investment of approximately Rs 400 crore for the construction of this residential project,\" JMS Group said. \"This endeavour not only represents a substantial investment but also reaffirms our dedication to creating sustainable and contemporary living environments,\" Singh said. The construction work will start after getting all necessary approvals. JMS Group has launched 6 housing and 2 commercial projects so far. The housing demand in Gurugram and adjoining areas has been very strong in the last three years. Prices too have risen sharply in the city. ","cleaned_content":"realty firm jms group on monday said it will invest rs \u003cFOUR_HUNDRED\u003e crore to develop a group housing project in gurugram the company has acquired \u003cEIGHT_\u003e acre of prime land in sector \u003cNINE_TEN\u003e new gurugram according to a statement it will develop around \u003cFOUR_HUNDRED\u003e units in this housing project upon completion the upcoming project is projected to generate revenues nearing \u003cONE_THOUSAND\u003e crore the company has allocated an investment of approximately rs \u003cFOUR_HUNDRED\u003e crore for the construction of this residential project jms group said this endeavour not only represents a substantial investment but also reaffirms our dedication to creating sustainable and contemporary living environments singh said the construction work will start after getting all necessary approvals jms group has launched \u003cSIX_\u003e housing and \u003cTWO_\u003e commercial projects so far the housing demand in gurugram and adjoining areas has been very strong in the last three years prices too have risen sharply in the city","timestamp":"2024-07-29T14:06:00+05:30","market_timestamp":"2024-07-29T14:06:00+05:30","off_market_hours":false}