{"url":"https://www.moneycontrol.com/news/business/bajaj-auto-sees-bright-future-in-cng-motorbikes-12778756.html","title":"Bajaj Auto sees bright future in CNG motorbikes","description":"Bajaj Freedom, a sports motorcycle with a 124 cubic capacity engine, was launched earlier this month with a starting price of 95,000 rupees ($1,135). Some 100 of the bikes have already been delivered to customers, Executive Director Rakesh Sharma said in an interview.Bajaj’s Freedom motorcycle was initially launched in states with a high penetration of CNG filling stations, such as Maharashtra, Gujarat and the metropolitan area around capital Delhi, Executive Director Rakesh Sharma said. (Image: BajajAuto.com)Related stories","content":"Bajaj Auto Ltd., India’s No. 1 maker of auto rickshaws, said it’s received around 6,000 orders for its new compressed natural gas-powered motorbike — a vehicle it bills as a world first — as consumers seek more affordable ways to embrace greener passenger transport. Bajaj Freedom, a sports motorcycle with a 124 cubic capacity engine, was launched earlier this month with a starting price of 95,000 rupees ($1,135). Some 100 of the bikes have already been delivered to customers, Executive Director Rakesh Sharma said in an interview. Sharma puts the addressable audience for the Freedom in the hundreds of millions. Most of Bajaj’s typical customers are price conscious, earning less than 40,000 rupees a month, and the Freedom can shave up to 1,800 rupees off fuel costs versus similarly sized bikes that run on petrol or diesel, he said. Being lead and sulfur free, CNG-run vehicles can reduce greenhouse gas emissions and they’re also quieter than gasoline or diesel ones, which results in less noise pollution. While high levels of domestic production mean CNG in India is cheaper, its lower energy density can require vehicles to refuel more frequently. India’s petroleum and gas ministry has said it aims to build 17,500 CNG filling stations across the country by 2030. Pune-based Bajaj’s Freedom motorcycle was initially launched in states with a high penetration of CNG filling stations, such as Maharashtra, Gujarat and the metropolitan area around capital Delhi, Sharma said. It’s now open for orders across the country. Bajaj also plans to launch the bike in countries that commonly use CNG as an alternative fuel too, like Argentina, Venezuela, Nigeria and Tanzania, Sharma said, without specifying any timeline. Although Bajaj is India’s top maker of auto rickshaws it isn’t No. 1 in scooters. There, it places fourth, with a market share of around 12% behind Hero Motocorp Ltd., Honda Motorcycle and Scooter India Pvt.and TVS Motor Company Ltd.. “We’ve heard other competitors are also looking at developing CNG two wheelers,” Sharma said. “It’s a defining movement for the motorcycle industry.” ","cleaned_content":"bajaj auto ltd india s no \u003cONE_\u003e maker of auto rickshaws said it s received around \u003cSIX_THOUSAND\u003e orders for its new compressed natural gas powered motorbike a vehicle it bills as a world first as consumers seek more affordable ways to embrace greener passenger transport bajaj freedom a sports motorcycle with a \u003cONE_HUNDRED\u003e cubic capacity engine was launched earlier this month with a starting price of \u003cNINE_TEN_THOUSAND\u003e rupees \u003cONE_THOUSAND\u003e some \u003cONE_HUNDRED\u003e of the bikes have already been delivered to customers executive director rakesh sharma said in an interview sharma puts the addressable audience for the freedom in the hundreds of millions most of bajaj s typical customers are price conscious earning less than \u003cFOUR_TEN_THOUSAND\u003e rupees a month and the freedom can shave up to \u003cONE_THOUSAND\u003e rupees off fuel costs versus similarly sized bikes that run on petrol or diesel he said being lead and sulfur free cng run vehicles can reduce greenhouse gas emissions and they re also quieter than gasoline or diesel ones which results in less noise pollution while high levels of domestic production mean cng in india is cheaper its lower energy density can require vehicles to refuel more frequently india s petroleum and gas ministry has said it aims to build \u003cONE_TEN_THOUSAND\u003e cng filling stations across the country by \u003cTWO_THOUSAND\u003e pune based bajaj s freedom motorcycle was initially launched in states with a high penetration of cng filling stations such as maharashtra gujarat and the metropolitan area around capital delhi sharma said it s now open for orders across the country bajaj also plans to launch the bike in countries that commonly use cng as an alternative fuel too like argentina venezuela nigeria and tanzania sharma said without specifying any timeline although bajaj is india s top maker of auto rickshaws it isn t no \u003cONE_\u003e in scooters there it places fourth with a market share of around \u003cONE_TEN_PERCENT\u003e behind hero motocorp ltd honda motorcycle and scooter india pvt and tvs motor company ltd we ve heard other competitors are also looking at developing cng two wheelers sharma said it s a defining movement for the motorcycle industry","timestamp":"2024-07-27T16:19:00+05:30","market_timestamp":"2024-07-29T09:15:00+05:30","off_market_hours":true}