{"url":"https://www.moneycontrol.com/news/business/pv-sales-rise-10-in-july-on-new-launches-enhanced-discounts-fada-12787000.html","title":"PV sales rise 10% in July on new launches, enhanced discounts: FADA","description":"Total passenger vehicle retail sales rose to 320,129 units in July, as compared to 290,564 units in July 2023.FADA, which collated vehicle registration data from 1,568 out of 1,645 RTOs across the country, noted that the near-term outlook across the auto retail segments shows a blend of optimism and caution.Related stories","content":"Passenger vehicle (PV) retail sales in India witnessed a 10 percent on-year jump in July driven by new model launches and enhanced discounts. According to Federation of Automobile Dealers Associations (FADA), the total PV retails rose to 320,129 units in July, as compared to 290,564 units in July 2023. The jump in PV retails come at a time when despatches by carmakers to dealers went down by 2.5 percent at 344,076 units last month vis-à-vis 352,941 units in July 2023. On a month-on-month (MoM) basis, PV retails shot up by nearly 14 percent from 281,566 units in June 2024. \"Dealers reported benefits from good product availability, attractive schemes, and a wider range of products. Nonetheless, heavy rains, low consumer sentiment, and intense competition posed challenges. Some dealers managed to sustain sales through strong promotions and incremental discounts, stated FADA vice president CS Vigneshwar In his view, \"This poses a substantial risk for dealer sustainability, necessitating extreme caution. FADA urges PV original equipment manufacturers (OEMs) to be vigilant about potential dealer failures due to these high inventory levels.\" It was reported recently that auto dealers, which has been saddled with a huge inventory pileup, have urged carmakers to delay vehicle dispatches. The auto retail body reiterated that high inventory levels pose a significant risk and it is crucial for PV OEMs to avoid further increases in stock to prevent financial strain on dealers. “It is also crucial for the Reserve Bank of India to mandate financial institutions to implement stringent checks before releasing inventory funding, preferably requiring dealer consent or collaterals to prevent the escalation of NPAs, he added. Two-wheeler and CV segments also grow Two-wheeler retail sales last month stood at 14.43 lakh units, an increase of 17 per cent over 12.31 lakh units in July 2023. According to FADA, the segment experienced notable growth due to a thriving rural economy, positive monsoon effects, and the government's support programmes enhancing rural incomes. \"The introduction of new products and better stock availability also contributed significantly, despite market slowdowns in certain regions, excessive rains, and increased competition,\" he added. Commercial vehicle (CV) retail sales grew 7 percent year-on-year to 80,057 units last month. \"Positive factors included growth in the construction and mining sectors, while challenges such as continuous rainfall, negative rural market sentiment, poor finance availability, and high vehicle prices were also noted,\" Vigneshwar said, adding that tractor sales declined 12 percent year-on-year to 79,970 units in July. FADA, which collated vehicle registration data from 1,568 out of 1,645 RTOs across the country, noted that the near-term outlook across the auto retail segments shows a blend of optimism and caution. It expects the two-wheeler sales to be buoyed by factors such as a growing rural economy, positive monsoon impacts and the introduction of new products. The festive season beginning after the Aadi festival and favourable agricultural conditions are also likely to contribute to increased sales, according to FADA However, heavy rainfall, ongoing agricultural activities and inconsistent monsoon patterns may dampen demand in certain areas. FADA noted that the PV segment could see mixed results in the near-term. While the festive season, attractive schemes and good monsoon are expected to boost sales, concerns over low consumer sentiment, heavy rainfall and a lack of new product launches persist, FADA noted The CV segment faces a modest outlook, with positive factors including improved market reach and the festive season, tempered by challenges such as bad freight rates and ongoing rainfall, it added. ","cleaned_content":"passenger vehicle pv retail sales in india witnessed a \u003cONE_TEN_PERCENT\u003e on year jump in july driven by new model launches and enhanced discounts according to federation of automobile dealers associations fada the total pv retails rose to \u003cTHREE_HUNDRED_THOUSAND\u003e units in july as compared to \u003cTWO_HUNDRED_THOUSAND\u003e units in july \u003cTWO_THOUSAND\u003e the jump in pv retails come at a time when despatches by carmakers to dealers went down by \u003cTWO_PERCENT\u003e at \u003cTHREE_HUNDRED_THOUSAND\u003e units last month vis vis \u003cTHREE_HUNDRED_THOUSAND\u003e units in july \u003cTWO_THOUSAND\u003e on a month on month mom basis pv retails shot up by nearly \u003cONE_TEN_PERCENT\u003e from \u003cTWO_HUNDRED_THOUSAND\u003e units in june \u003cTWO_THOUSAND\u003e dealers reported benefits from good product availability attractive schemes and a wider range of products nonetheless heavy rains low consumer sentiment and intense competition posed challenges some dealers managed to sustain sales through strong promotions and incremental discounts stated fada vice president cs vigneshwar in his view this poses a substantial risk for dealer sustainability necessitating extreme caution fada urges pv original equipment manufacturers oems to be vigilant about potential dealer failures due to these high inventory levels it was reported recently that auto dealers which has been saddled with a huge inventory pileup have urged carmakers to delay vehicle dispatches the auto retail body reiterated that high inventory levels pose a significant risk and it is crucial for pv oems to avoid further increases in stock to prevent financial strain on dealers it is also crucial for the reserve bank of india to mandate financial institutions to implement stringent checks before releasing inventory funding preferably requiring dealer consent or collaterals to prevent the escalation of npas he added two wheeler and cv segments also grow two wheeler retail sales last month stood at \u003cONE_TEN\u003e lakh units an increase of \u003cONE_TEN_PERCENT\u003e over \u003cONE_TEN\u003e lakh units in july \u003cTWO_THOUSAND\u003e according to fada the segment experienced notable growth due to a thriving rural economy positive monsoon effects and the governments support programmes enhancing rural incomes the introduction of new products and better stock availability also contributed significantly despite market slowdowns in certain regions excessive rains and increased competition he added commercial vehicle cv retail sales grew \u003cSEVEN_PERCENT\u003e year on year to \u003cEIGHT_TEN_THOUSAND\u003e units last month positive factors included growth in the construction and mining sectors while challenges such as continuous rainfall negative rural market sentiment poor finance availability and high vehicle prices were also noted vigneshwar said adding that tractor sales declined \u003cONE_TEN_PERCENT\u003e year on year to \u003cSEVEN_TEN_THOUSAND\u003e units in july fada which collated vehicle registration data from \u003cONE_THOUSAND\u003e out of \u003cONE_THOUSAND\u003e rtos across the country noted that the near term outlook across the auto retail segments shows a blend of optimism and caution it expects the two wheeler sales to be buoyed by factors such as a growing rural economy positive monsoon impacts and the introduction of new products the festive season beginning after the aadi festival and favourable agricultural conditions are also likely to contribute to increased sales according to fada however heavy rainfall ongoing agricultural activities and inconsistent monsoon patterns may dampen demand in certain areas fada noted that the pv segment could see mixed results in the near term while the festive season attractive schemes and good monsoon are expected to boost sales concerns over low consumer sentiment heavy rainfall and a lack of new product launches persist fada noted the cv segment faces a modest outlook with positive factors including improved market reach and the festive season tempered by challenges such as bad freight rates and ongoing rainfall it added","timestamp":"2024-08-05T15:02:00+05:30","market_timestamp":"2024-08-05T15:02:00+05:30","off_market_hours":false}