{"url":"https://www.moneycontrol.com/news/business/bajaj-group-prepares-to-enter-healthcare-biz-report-12786757.html","title":"Bajaj Group prepares to enter healthcare biz: Report","description":"Nirav Bajaj, head of corporate strategy at Mukand, the group's steel company, is overseeing the project and likely to helm the new companyThe conglomerate is likely to invest in phases based on milestones the business achieves.Related stories","content":"The Rs 1.46-lakh-crore Bajaj Group is preparing to enter the healthcare sector by setting up a chain of hospitals in metro cities, the Economic Times has reported. This will be the first major diversification for the 98-year-old business house after the death of group's patriarch Rahul Bajaj in February 2022. The plan is in the initial stages and the healthcare business will be housed in a newly formed company, the report said. Nirav Bajaj, head of corporate strategy at Mukand, the group's steel company, is overseeing the project and likely to helm the new business the report added. The investment plans are yet to be decided, the report said. The conglomerate is likely to invest in phases based on milestones the business achieves. An office has been set up in Mumbai's Lower Parel for the new venture, the report added. Moneycontrol couldn't verify the report independently. Also Read | Bajaj Group commits Rs 5,000 cr for five years towards CSR initiatives Bajaj Group, which became the fifth business house to cross the Rs 10-lakh-crore mark in market cap in December 2023, was founded by Jamnalal Bajaj in Mumbai in 1926. It operates in various industries including automobiles, home appliances, lighting, iron and steel, insurance, travel and finance.  ","cleaned_content":"the rs \u003cONE_\u003e lakh crore bajaj group is preparing to enter the healthcare sector by setting up a chain of hospitals in metro cities the economic times has reported this will be the first major diversification for the \u003cNINE_TEN\u003e year old business house after the death of groups patriarch rahul bajaj in february \u003cTWO_THOUSAND\u003e the plan is in the initial stages and the healthcare business will be housed in a newly formed company the report said nirav bajaj head of corporate strategy at mukand the groups steel company is overseeing the project and likely to helm the new business the report added the investment plans are yet to be decided the report said the conglomerate is likely to invest in phases based on milestones the business achieves an office has been set up in mumbais lower parel for the new venture the report added moneycontrol couldnt verify the report independently also read bajaj group commits rs \u003cFIVE_THOUSAND\u003e cr for five years towards csr initiatives bajaj group which became the fifth business house to cross the rs \u003cONE_TEN\u003e lakh crore mark in market cap in december \u003cTWO_THOUSAND\u003e was founded by jamnalal bajaj in mumbai in \u003cONE_THOUSAND\u003e it operates in various industries including automobiles home appliances lighting iron and steel insurance travel and finance","timestamp":"2024-08-05T08:08:00+05:30","market_timestamp":"2024-08-05T09:15:00+05:30","off_market_hours":true}