{"url":"https://www.moneycontrol.com/news/business/promoter-pe-firm-true-north-exploring-exit-from-shree-digvijay-cement-12833792.html","title":"Promoter PE firm True North exploring exit from Shree Digvijay Cement","description":"Back in November 2018, True North signed an agreement to buy Brazilian firm Votorantim Cimentos’ 75 percent stake in Shree Digvijay Cement Company LimitedShree Digvijay Cement has been selling products under the \"Kamal Cement\" brand and began operations in 1944Related stories","content":"Leading home-grown private equity firm True North, the promoter of Shree Digvijay Cement Company, is evaluating a complete exit from the listed entity, four persons in the know told Moneycontrol on the condition of anonymity. \"Nearly six years after entering the firm, True North is now exploring options to cede control in Shree Digvijay Cement and sell its majority stake of 54.83 percent,\" said one of the persons cited above. Two other persons confirmed the above plans. A fourth person said that the firm had explored a possible sale earlier as well but those conversations did not proceed due to a valuation mismatch. \"A deal under the current environment would hinge on the right kind of valuations being offered,\" this person added. When contacted, True North declined to comment. An email query and reminders sent to Shree Digvijay Cement went unanswered at the time of publishing this article. Back in November 2018, True North signed an agreement to buy Brazilian firm Votorantim Cimentos’ direct and indirect 75 percent stake in Shree Digvijay Cement Company Limited. True North made an open offer to acquire a 25.1 percent stake held by public shareholders for Rs 23.33 apiece, aggregating to Rs 83 crore, according to a stock exchange filing by the cement player. From those levels, both the firm's share price and market cap have risen by more than 4x to Rs 96.43/share and Rs 1,420 crore respectively, at the end of trade on October 1, 2024. Shree Digvijay Cement has been selling products under the \"Kamal Cement\" brand and began operations in 1944. According to a January 2024 report by Crisil Ratings, the firm has an installed capacity of 1.2 mtpa (million tonnes per annum) True North has owned and managed two other players in this space - RDC Concrete, a manufacturer of ready-mix concrete, which was sold to Infra.Market in 2021 and Robo Silicon, a manufacturer of construction aggregates. The domestic cement sector is in the middle of an intense M\u0026A tussle between the market leader Birla Group which acquired India Cements in June and Kesoram’s cement vertical earlier and an aggressive number 2, the Adani Group, which has purchased Sanghi Industries and Penna Cement. Also Read: Billionaire battle heats up as Adani challenges Birla in cement UltraTech Cement acquired a controlling stake in India Cements, valuing the deal at $123 per tonne for 14 million tonnes of assets, according to a July 28 report by Moneycontrol. Also Read: Analysts expect modest impact on stock following UltraTech-India Cement deal Lens on Shree Digvijay Cement As per its annual report, as of FY 24, the firm posted its highest ever Ebidta, PBT and PAT of Rs 154.94 crore, Rs 118.21 crore and Rs 87.76 crore respectively. Cement sector veteran and Chairman of the board of directors of Shree Digvijay Cement, Anil Singhvi said in the annual report, \"I may also hasten to add that from our cement plant vintage, this perhaps is the most profitable cement company in India and there cannot be a lesser joy for me to have enjoyed this journey with the ordinary people achieving extra ordinary results.\" He added, \"We have just about 250 people and the last EBITDA for 2023-24 was about Rs 155 crores, on a per person basis it’s about Rs 62 lakhs. I don’t think there is any parallel in cement industry to have achieved this kind of profitability by such a small team of ordinary souls having extra ordinary passion. Having achieved a tremendous turnaround in productivity in every sphere of our cement plant this is the time for us to look forward for expansion of capacity.\" The annual report further adds that the Board of Directors has announced expansion at the existing unit at Sikka, Jamnagar, Gujarat. \"The new grinding unit project is under construction now and will be completed in the fourth quarter of FY 2024-25. After completion of the project, total cement capacity will increase to 3.00 mtpa,\" the report says. ","cleaned_content":"leading home grown private equity firm true north the promoter of shree digvijay cement company is evaluating a complete exit from the listed entity four persons in the know told moneycontrol on the condition of anonymity nearly six years after entering the firm true north is now exploring options to cede control in shree digvijay cement and sell its majority stake of \u003cFIVE_TEN_PERCENT\u003e said one of the persons cited above two other persons confirmed the above plans a fourth person said that the firm had explored a possible sale earlier as well but those conversations did not proceed due to a valuation mismatch a deal under the current environment would hinge on the right kind of valuations being offered this person added when contacted true north declined to comment an email query and reminders sent to shree digvijay cement went unanswered at the time of publishing this article back in november \u003cTWO_THOUSAND\u003e true north signed an agreement to buy brazilian firm votorantim cimentos direct and indirect \u003cSEVEN_TEN_PERCENT\u003e stake in shree digvijay cement company limited true north made an open offer to acquire a \u003cTWO_TEN_PERCENT\u003e stake held by public shareholders for rs \u003cTWO_TEN\u003e apiece aggregating to rs \u003cEIGHT_TEN\u003e crore according to a stock exchange filing by the cement player from those levels both the firms share price and market cap have risen by more than \u003cFOUR_\u003e x to rs \u003cNINE_TEN\u003e share and rs \u003cONE_THOUSAND\u003e crore respectively at the end of trade on october \u003cONE_\u003e \u003cTWO_THOUSAND\u003e shree digvijay cement has been selling products under the kamal cement brand and began operations in \u003cONE_THOUSAND\u003e according to a january \u003cTWO_THOUSAND\u003e report by crisil ratings the firm has an installed capacity of \u003cONE_\u003e mtpa million tonnes per annum true north has owned and managed two other players in this space rdc concrete a manufacturer of ready mix concrete which was sold to infra market in \u003cTWO_THOUSAND\u003e and robo silicon a manufacturer of construction aggregates the domestic cement sector is in the middle of an intense m a tussle between the market leader birla group which acquired india cements in june and kesoram s cement vertical earlier and an aggressive number \u003cTWO_\u003e the adani group which has purchased sanghi industries and penna cement also read billionaire battle heats up as adani challenges birla in cement ultratech cement acquired a controlling stake in india cements valuing the deal at \u003cONE_HUNDRED\u003e per tonne for \u003cONE_TEN\u003e million tonnes of assets according to a july \u003cTWO_TEN\u003e report by moneycontrol also read analysts expect modest impact on stock following ultratech india cement deal lens on shree digvijay cement as per its annual report as of fy \u003cTWO_TEN\u003e the firm posted its highest ever ebidta pbt and pat of rs \u003cONE_HUNDRED\u003e crore rs \u003cONE_HUNDRED\u003e crore and rs \u003cEIGHT_TEN\u003e crore respectively cement sector veteran and chairman of the board of directors of shree digvijay cement anil singhvi said in the annual report i may also hasten to add that from our cement plant vintage this perhaps is the most profitable cement company in india and there cannot be a lesser joy for me to have enjoyed this journey with the ordinary people achieving extra ordinary results he added we have just about \u003cTWO_HUNDRED\u003e people and the last ebitda for \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e was about rs \u003cONE_HUNDRED\u003e crores on a per person basis it s about rs \u003cSIX_TEN\u003e lakhs i don t think there is any parallel in cement industry to have achieved this kind of profitability by such a small team of ordinary souls having extra ordinary passion having achieved a tremendous turnaround in productivity in every sphere of our cement plant this is the time for us to look forward for expansion of capacity the annual report further adds that the board of directors has announced expansion at the existing unit at sikka jamnagar gujarat the new grinding unit project is under construction now and will be completed in the fourth quarter of fy \u003cTWO_THOUSAND\u003e \u003cTWO_TEN\u003e after completion of the project total cement capacity will increase to \u003cTHREE_\u003e mtpa the report says","timestamp":"2024-10-01T20:47:00+05:30","market_timestamp":"2024-10-03T09:15:00+05:30","off_market_hours":true}