{"url":"https://www.moneycontrol.com/news/business/markets/mc-inside-edge-sme-bankers-under-multiple-radar-debt-pms-schemes-gain-traction-bullish-analysts-add-caveat-to-power-sector-12832328.html","title":"MC Inside Edge: SME bankers under multiple radar, debt PMS schemes gain traction, bullish analysts add caveat to power sector","description":"Your dose of all the inner goings-on from Dalal Street. Know what stocks veteran bulls are eyeing and what the bears are ganging up against. Know what stocks veteran bulls are eyeing and what the bears are ganging up against.Related stories","content":"Rough road ahead for SME bankers SME bankers are a worried lot. If the capital market regulator and exchanges were not enough, the recent buzz is that two more investigative agencies have brought such bankers under their radar. The ED and IT department are believed to be looking into the operations of some merchant banking firms that have been managing the bulk of SME IPOs that have hit the markets in the recent past. While it is too early to ascertain the exact scope of investigations, the buzz is that the two agencies are following the money trail to understand the modus operandi of certain entities that have been boasting of record successes in the SME IPO segment.  Portfolio management services (PMS), which, simply put, is wealth management for rich individuals, was always known as an active equity fund management product. But, of late, there is a growing interest in debt PMS as an increasing number of investors are booking profits in equities and deploying the corpus in debt, at least a large part of it. Fund managers are saying that many HNIs are wary of the current valuations of equities and hence looking at debt. Over the past one year, assets under management (AUM) of debt PMS have increased by 15.06% till August, while equity PMS has seen a larger growth of 46% though the bulk of the AUM surge is on account of rising stock prices rather than just inflows, which skew the numbers. A power struggle The power segment continues to be having its day under the sun especially on the renewable side and the recent spate of IPO announcements is also giving the sector a boost. Analysts, however, have been raising concerns on valuations and execution risks with the upcoming earnings season being watched out closely. Although most have a positive outlook, the segment could be set for a series of re-ratings as some analysts are maintaining a wait-and-watch mode despite the continued optimism. ","cleaned_content":"rough road ahead for sme bankers sme bankers are a worried lot if the capital market regulator and exchanges were not enough the recent buzz is that two more investigative agencies have brought such bankers under their radar the ed and it department are believed to be looking into the operations of some merchant banking firms that have been managing the bulk of sme ipos that have hit the markets in the recent past while it is too early to ascertain the exact scope of investigations the buzz is that the two agencies are following the money trail to understand the modus operandi of certain entities that have been boasting of record successes in the sme ipo segment portfolio management services pms which simply put is wealth management for rich individuals was always known as an active equity fund management product but of late there is a growing interest in debt pms as an increasing number of investors are booking profits in equities and deploying the corpus in debt at least a large part of it fund managers are saying that many hnis are wary of the current valuations of equities and hence looking at debt over the past one year assets under management aum of debt pms have increased by \u003cONE_TEN_PERCENT\u003e till august while equity pms has seen a larger growth of \u003cFOUR_TEN_PERCENT\u003e though the bulk of the aum surge is on account of rising stock prices rather than just inflows which skew the numbers a power struggle the power segment continues to be having its day under the sun especially on the renewable side and the recent spate of ipo announcements is also giving the sector a boost analysts however have been raising concerns on valuations and execution risks with the upcoming earnings season being watched out closely although most have a positive outlook the segment could be set for a series of re ratings as some analysts are maintaining a wait and watch mode despite the continued optimism","timestamp":"2024-09-30T14:33:00+05:30","market_timestamp":"2024-09-30T14:33:00+05:30","off_market_hours":false}