{"url":"https://www.moneycontrol.com/news/business/stocks/coforge-time-to-pocket-gains-as-the-stock-surges-12843103.html","title":"Coforge: Time to pocket gains as the stock surges?","description":"We recommend  investors should partially book profits and re-enter on any weaknessGiven the strong rally, we recommend  investors should partially book profits and re-enter on any weakness as Coforge with its BFSI-heavy portfolio is in a vantage position to capture the demand revivalRelated stories","content":"Highlights  Revenue momentum strong so far Coforge had ended FY24 on a strong note with an organic Constant Currency revenue growth of 13.3 percent. While Q1 FY25 started on a healthy note with a sequential revenue growth of 1.6 percent, the high base of FY24 and the Cigniti acquisition may lead to a slight subdued near-term growth. However, on the back of demand revival, FY26 could turn out to be a good year. Nevertheless, given that the company has now dropped the annual growth guidance, and the Cigniti integration (although Cigniti grew by a decent 2.4 percent sequentially in reported currency in Q1) may  consume some bandwidth, we feel the rally partially captures the optimism. Source: Company Margin remains a key watch In the last reported quarter, adjusted operating margin (excluding ESOP costs) declined by 110 basis points sequentially on account of visa costs even in the absence of a wage hike that got implemented from July 1. However, the management is still guiding to a margin improvement of 50 basis points in the first half of FY25 over the corresponding period thereby indicating 120 basis points sequential decline in margin in Q2. Coforge is hopeful of a full-year margin expansion of 50 basis points. After FY25, margin improvement is expected, thanks to the peaking out of sales and marketing expenses (now over 15 percent of revenue), higher offshoring (now 52 percent and has headroom to improve), stable resource cost as attrition has fallen to a low of 11.4 percent now, and improving utilisation, which at 81.6 percent is lower than most peers. However, the key near-term watch remains the margin gains in Cigniti (28 percent stake at the end of Q1 and likely to go up post the open offer) that reported a margin of 12.6 percent in Q1. The  management is guiding to a strong margin uptick to the tune of 16 percent for Cigniti. Order inflows extremely strong Despite the challenging market environment, the company maintained traction in deal wins, thanks to its aggressive sales and marketing efforts. In Q1 FY25, the company won two large deals, one in BFS (banking financial services) and the other in aviation and clocked more than $300 million in order inflows for the 10th consecutive quarter. Source: Company The executable order book is solid with a YoY growth in excess of 19 percent, providing revenue visibility for the organic business.  Source: Company Cigniti acquisition – Is the Street pricing in a success? After the initial hiccup with the Cigniti acquisition, the Street appears to be turning optimistic on the same. While the net margin of Cigniti is similar to Coforge (as Coforge had a few exceptional items impacting margins in recent times), the operating margin of Cigniti is much inferior. In fact, the offerings of Cigniti, which are mainly digital assurance and digital engineering service, are inherently low-margin compared to Coforge. Coforge’s rationale for the acquisition was primarily to have three additional industry verticals — retail, hi-tech, and healthcare — through Cigniti. In addition, Cigniti has a good footprint in south-west, mid-west, and western part of the US while Coforge is concentrated in the east coast. Coforge has a relatively smaller presence (48 percent of sales) in the US and this acquisition should aid in fortifying presence in a key market. Finally, Coforge believes that testing, which is the principal offering of Cigniti, isn’t going to get eliminated with the adoption of the AI. It believes that the need for testing should increase as new complexities and opportunities arise. This remains a key watch. The combined entity of Coforge plus Cigniti of $1.3 billon at the end of FY24 is targeting to achieve $2 billion revenue, implying a revenue CAGR of 15 percent. Coforge is also expecting 150-250 basis points margin gains over this period. While we have not tweaked our estimates factoring in this acquisition, we feel the recent rally captures the near-term optimism of a better-than-expected acquisition. Given the strong rally, we recommend  investors should partially book profits and re-enter on any weakness as Coforge with its BFSI-heavy portfolio is in a vantage position to capture the demand revival. Source: Company, Moneycontrol Research Key risks: Severe demand slowdown and/or heightened competitive intensity  ","cleaned_content":"highlights revenue momentum strong so far coforge had ended fy24 on a strong note with an organic constant currency revenue growth of \u003cONE_TEN_PERCENT\u003e while q1 fy25 started on a healthy note with a sequential revenue growth of \u003cONE_PERCENT\u003e the high base of fy24 and the cigniti acquisition may lead to a slight subdued near term growth however on the back of demand revival fy26 could turn out to be a good year nevertheless given that the company has now dropped the annual growth guidance and the cigniti integration although cigniti grew by a decent \u003cTWO_PERCENT\u003e sequentially in reported currency in q1 may consume some bandwidth we feel the rally partially captures the optimism source company margin remains a key watch in the last reported quarter adjusted operating margin excluding esop costs declined by \u003cONE_HUNDRED\u003e basis points sequentially on account of visa costs even in the absence of a wage hike that got implemented from july \u003cONE_\u003e however the management is still guiding to a margin improvement of \u003cFIVE_TEN\u003e basis points in the first half of fy25 over the corresponding period thereby indicating \u003cONE_HUNDRED\u003e basis points sequential decline in margin in q2 coforge is hopeful of a full year margin expansion of \u003cFIVE_TEN\u003e basis points after fy25 margin improvement is expected thanks to the peaking out of sales and marketing expenses now over \u003cONE_TEN_PERCENT\u003e of revenue higher offshoring now \u003cFIVE_TEN_PERCENT\u003e and has headroom to improve stable resource cost as attrition has fallen to a low of \u003cONE_TEN_PERCENT\u003e now and improving utilisation which at \u003cEIGHT_TEN_PERCENT\u003e is lower than most peers however the key near term watch remains the margin gains in cigniti \u003cTWO_TEN_PERCENT\u003e stake at the end of q1 and likely to go up post the open offer that reported a margin of \u003cONE_TEN_PERCENT\u003e in q1 the management is guiding to a strong margin uptick to the tune of \u003cONE_TEN_PERCENT\u003e for cigniti order inflows extremely strong despite the challenging market environment the company maintained traction in deal wins thanks to its aggressive sales and marketing efforts in q1 fy25 the company won two large deals one in bfs banking financial services and the other in aviation and clocked more than \u003cTHREE_HUNDRED\u003e million in order inflows for the \u003cONE_TEN\u003e th consecutive quarter source company the executable order book is solid with a yoy growth in excess of \u003cONE_TEN_PERCENT\u003e providing revenue visibility for the organic business source company cigniti acquisition is the street pricing in a success after the initial hiccup with the cigniti acquisition the street appears to be turning optimistic on the same while the net margin of cigniti is similar to coforge as coforge had a few exceptional items impacting margins in recent times the operating margin of cigniti is much inferior in fact the offerings of cigniti which are mainly digital assurance and digital engineering service are inherently low margin compared to coforge coforge s rationale for the acquisition was primarily to have three additional industry verticals retail hi tech and healthcare through cigniti in addition cigniti has a good footprint in south west mid west and western part of the us while coforge is concentrated in the east coast coforge has a relatively smaller presence \u003cFOUR_TEN_PERCENT\u003e of sales in the us and this acquisition should aid in fortifying presence in a key market finally coforge believes that testing which is the principal offering of cigniti isn t going to get eliminated with the adoption of the ai it believes that the need for testing should increase as new complexities and opportunities arise this remains a key watch the combined entity of coforge plus cigniti of \u003cONE_\u003e billon at the end of fy24 is targeting to achieve \u003cTWO_\u003e billion revenue implying a revenue cagr of \u003cONE_TEN_PERCENT\u003e coforge is also expecting \u003cONE_HUNDRED\u003e \u003cTWO_HUNDRED\u003e basis points margin gains over this period while we have not tweaked our estimates factoring in this acquisition we feel the recent rally captures the near term optimism of a better than expected acquisition given the strong rally we recommend investors should partially book profits and re enter on any weakness as coforge with its bfsi heavy portfolio is in a vantage position to capture the demand revival source company moneycontrol research key risks severe demand slowdown and or heightened competitive intensity","timestamp":"2024-10-16T13:04:00+05:30","market_timestamp":"2024-10-16T13:04:00+05:30","off_market_hours":false}