{"url":"https://www.moneycontrol.com/news/india/bengaluru-rains-karnataka-govt-issues-work-from-home-advisory-to-it-bt-pvt-companies-for-oct-16-12842796.html","title":"Bengaluru rains: Karnataka govt issues work-from-home advisory to IT-BT, pvt companies for Oct 16","description":"The Karnataka Innovation \u0026 Technology Society, under the Department of Electronics, Information Technology, Biotechnology, and Science \u0026 Technology, Karnataka government, has issued the advisory.Manyata Tech Park near HebbalRelated stories","content":"The Karnataka government on October 15 issued a work-from-home advisory to IT-BT and private firms in Bengaluru for October 16. \"In light of the continuous heavy rains in Bengaluru and the orange alert issued by the Meteorological Department, we are prioritising the safety and well-being of all employees working in IT, BT, and private companies located in Bengaluru,\" the advisory issued by the Karnataka Innovation \u0026 Technology Society (KITS) stated. KITS operates under the Department of Electronics, Information Technology, Biotechnology, and Science \u0026 Technology of the Karnataka government. \"As transportation systems may be disrupted due to flooding, waterlogging, and traffic congestion, commuting to office premises could pose risks. As a precautionary measure, it is recommended that IT, BT, and private companies permit their employees to work from home (WFH) on October 16, 2024,\" it added. Bengaluru Urban Deputy Commissioner G Jagadeesha declared a holiday for schools and anganwadis on Wednesday (October 16). However, colleges will remain open. October 17 is a public holiday in observance of Maharshi Valmiki Jayanti. Also, read: Bengaluru rains: School buses stranded on flooded road, students rescued in tractors near tech hub ORR Heavy rains have lashed the city since Monday night, leaving it reeling from flooded roads and traffic gridlocks. Techies have been demanding that the state government issue an advisory to companies to provide work-from-home arrangements. Meanwhile, Tamil Nadu Chief Minister MK Stalin has instructed authorities to declare a holiday for schools and colleges in Chennai, Tiruvallur, Kancheepuram and Chengalpattu districts for October 15 following the meteorological department’s forecast of heavy rain. The chief minister on October 14, who reviewed the state's monsoon preparedness, also directed authorities to issue an advisory allowing employees of IT companies in the four districts to work from home from October 15 to 18. ","cleaned_content":"the karnataka government on october \u003cONE_TEN\u003e issued a work from home advisory to it bt and private firms in bengaluru for october \u003cONE_TEN\u003e in light of the continuous heavy rains in bengaluru and the orange alert issued by the meteorological department we are prioritising the safety and well being of all employees working in it bt and private companies located in bengaluru the advisory issued by the karnataka innovation technology society kits stated kits operates under the department of electronics information technology biotechnology and science technology of the karnataka government as transportation systems may be disrupted due to flooding waterlogging and traffic congestion commuting to office premises could pose risks as a precautionary measure it is recommended that it bt and private companies permit their employees to work from home wfh on october \u003cONE_TEN\u003e \u003cTWO_THOUSAND\u003e it added bengaluru urban deputy commissioner g jagadeesha declared a holiday for schools and anganwadis on wednesday october \u003cONE_TEN\u003e however colleges will remain open october \u003cONE_TEN\u003e is a public holiday in observance of maharshi valmiki jayanti also read bengaluru rains school buses stranded on flooded road students rescued in tractors near tech hub orr heavy rains have lashed the city since monday night leaving it reeling from flooded roads and traffic gridlocks techies have been demanding that the state government issue an advisory to companies to provide work from home arrangements meanwhile tamil nadu chief minister mk stalin has instructed authorities to declare a holiday for schools and colleges in chennai tiruvallur kancheepuram and chengalpattu districts for october \u003cONE_TEN\u003e following the meteorological department s forecast of heavy rain the chief minister on october \u003cONE_TEN\u003e who reviewed the states monsoon preparedness also directed authorities to issue an advisory allowing employees of it companies in the four districts to work from home from october \u003cONE_TEN\u003e to \u003cONE_TEN\u003e","timestamp":"2024-10-15T22:04:00+05:30","market_timestamp":"2024-10-16T09:15:00+05:30","off_market_hours":true}