{"url":"https://www.moneycontrol.com/news/business/markets/mcap-of-4-of-top-10-most-valued-firms-jumps-rs-81151-cr-last-week-icici-hdfc-bank-biggest-gainers-12845770.html","title":"Mcap of 4 of top 10 most valued firms jumps Rs 81,151 cr last week; ICICI, HDFC Bank biggest gainers","description":"Last week, the BSE benchmark declined 156.61 points, or 0.19 per cent.Mcap of 4 of top 10 most valued firms jumps Rs 81,151 cr last week; ICICI, HDFC Bank biggest gainersRelated stories","content":"Four of the top-10 most-valued firms together added Rs 81,151.31 crore in market valuation last week, with ICICI Bank and HDFC Bank emerging as the biggest gainers. Last week, the BSE benchmark declined 156.61 points, or 0.19 per cent. While HDFC Bank, Bharti Airtel, ICICI Bank, and the State Bank of India were the gainers, Reliance Industries, Tata Consultancy Services (TCS), Infosys, Hindustan Unilever, ITC, and Life Insurance Corporation of India (LIC) suffered a combined erosion of Rs 76,622.05 crore from their market valuation. The valuation of HDFC Bank jumped Rs 23,579.11 crore to Rs 12,82,848.30 crore. State Bank of India's market valuation climbed Rs 17,804.61 crore to Rs 7,31,773.56 crore and that of Bharti Airtel went up Rs 11,272.45 crore to Rs 9,71,707.61 crore. On the other hand, the market capitalisation (mcap) of Infosys slumped Rs 23,314.31 crore to Rs 7,80,126.10 crore. The valuation of Reliance Industries declined Rs 16,645.39 crore to Rs 18,38,721.14 crore. The mcap of Hindustan Unilever tumbled Rs 15,248.85 crore to Rs 6,38,066.75 crore and that of TCS diminished by Rs 10,402.01 crore to Rs 14,91,321.40 crore. LIC's valuation went lower by Rs 8,760.12 crore to Rs 5,91,418.91 crore. The mcap of ITC dipped Rs 2,251.37 crore to Rs 6,08,682.29 crore. Reliance Industries continued to remain the most-valued domestic firm, followed by TCS, HDFC Bank, Bharti Airtel, ICICI Bank, Infosys, State Bank of India, Hindustan Unilever, ITC, and LIC. Disclaimer: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary. ","cleaned_content":"four of the top \u003cONE_TEN\u003e most valued firms together added rs \u003cEIGHT_TEN_THOUSAND\u003e crore in market valuation last week with icici bank and hdfc bank emerging as the biggest gainers last week the bse benchmark declined \u003cONE_HUNDRED\u003e points or \u003cZERO_PERCENT\u003e while hdfc bank bharti airtel icici bank and the state bank of india were the gainers reliance industries tata consultancy services tcs infosys hindustan unilever itc and life insurance corporation of india lic suffered a combined erosion of rs \u003cSEVEN_TEN_THOUSAND\u003e crore from their market valuation the valuation of hdfc bank jumped rs \u003cTWO_TEN_THOUSAND\u003e crore to rs \u003cONE_MILLION\u003e crore state bank of indias market valuation climbed rs \u003cONE_TEN_THOUSAND\u003e crore to rs \u003cSEVEN_HUNDRED_THOUSAND\u003e crore and that of bharti airtel went up rs \u003cONE_TEN_THOUSAND\u003e crore to rs \u003cNINE_HUNDRED_THOUSAND\u003e crore on the other hand the market capitalisation mcap of infosys slumped rs \u003cTWO_TEN_THOUSAND\u003e crore to rs \u003cSEVEN_HUNDRED_THOUSAND\u003e crore the valuation of reliance industries declined rs \u003cONE_TEN_THOUSAND\u003e crore to rs \u003cONE_MILLION\u003e crore the mcap of hindustan unilever tumbled rs \u003cONE_TEN_THOUSAND\u003e crore to rs \u003cSIX_HUNDRED_THOUSAND\u003e crore and that of tcs diminished by rs \u003cONE_TEN_THOUSAND\u003e crore to rs \u003cONE_MILLION\u003e crore lics valuation went lower by rs \u003cEIGHT_THOUSAND\u003e crore to rs \u003cFIVE_HUNDRED_THOUSAND\u003e crore the mcap of itc dipped rs \u003cTWO_THOUSAND\u003e crore to rs \u003cSIX_HUNDRED_THOUSAND\u003e crore reliance industries continued to remain the most valued domestic firm followed by tcs hdfc bank bharti airtel icici bank infosys state bank of india hindustan unilever itc and lic disclaimer moneycontrol is a part of the network18 group network18 is controlled by independent media trust of which reliance industries is the sole beneficiary","timestamp":"2024-10-20T10:47:00+05:30","market_timestamp":"2024-10-21T09:15:00+05:30","off_market_hours":true}